1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
/**
 * \file atsamd20.h
 *
 * \brief ATSAMD20 registers description
 *
 * Copyright (C) 2012-2014, Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 * $Id: atsamd20.h 8410 2013-08-08 16:59:55Z ataradov $
 *
 */

#ifndef _ATSAMD20_H_
#define _ATSAMD20_H_

/*- Includes ---------------------------------------------------------------*/
#include <stdint.h>

/*- Prototypes -------------------------------------------------------------*/
void HAL_IrqHandlerReset(void);
void HAL_IrqHandlerNmi(void);
void HAL_IrqHandlerHardFault(void);
void HAL_IrqHandlerSvCall(void);
void HAL_IrqHandlerPendSv(void);
void HAL_IrqHandlerSysTick(void);

void HAL_IrqHandlerPm(void);
void HAL_IrqHandlerSysctrl(void);
void HAL_IrqHandlerWdt(void);
void HAL_IrqHandlerRtc(void);
void HAL_IrqHandlerEic(void);
void HAL_IrqHandlerNvmctrl(void);
void HAL_IrqHandlerEvsys(void);
void HAL_IrqHandlerSercom0(void);
void HAL_IrqHandlerSercom1(void);
void HAL_IrqHandlerSercom2(void);
void HAL_IrqHandlerSercom3(void);
void HAL_IrqHandlerSercom4(void);
void HAL_IrqHandlerSercom5(void);
void HAL_IrqHandlerTc0(void);
void HAL_IrqHandlerTc1(void);
void HAL_IrqHandlerTc2(void);
void HAL_IrqHandlerTc3(void);
void HAL_IrqHandlerTc4(void);
void HAL_IrqHandlerTc5(void);
void HAL_IrqHandlerTc6(void);
void HAL_IrqHandlerTc7(void);
void HAL_IrqHandlerAdc(void);
void HAL_IrqHandlerAc(void);
void HAL_IrqHandlerDac(void);
void HAL_IrqHandlerPtc(void);

/*- Definitions ------------------------------------------------------------*/
#define MMIO_REG(mem_addr, type) (*(volatile type *)(mem_addr))

// 0x40000000 PAC0

#define PAC0_WPCLR	MMIO_REG(0x40000000, uint32_t)
#define PAC0_WPCLR_PM	(1 << 1)
#define PAC0_WPCLR_SYSCTRL	(1 << 2)
#define PAC0_WPCLR_GCLK	(1 << 3)
#define PAC0_WPCLR_WDT	(1 << 4)
#define PAC0_WPCLR_RTC	(1 << 5)
#define PAC0_WPCLR_EIC	(1 << 6)

#define PAC0_WPCLR_s    MMIO_REG(0x40000000, struct __struct_PAC0_WPCLR)
struct __struct_PAC0_WPCLR
{
  uint32_t  : 1;
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t gclk : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t  : 25;
};

#define PAC0_WPSET	MMIO_REG(0x40000004, uint32_t)
#define PAC0_WPSET_PM	(1 << 1)
#define PAC0_WPSET_SYSCTRL	(1 << 2)
#define PAC0_WPSET_GCLK	(1 << 3)
#define PAC0_WPSET_WDT	(1 << 4)
#define PAC0_WPSET_RTC	(1 << 5)
#define PAC0_WPSET_EIC	(1 << 6)

#define PAC0_WPSET_s    MMIO_REG(0x40000004, struct __struct_PAC0_WPSET)
struct __struct_PAC0_WPSET
{
  uint32_t  : 1;
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t gclk : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t  : 25;
};

// 0x40000400 PM

#define PM_CTRL	MMIO_REG(0x40000400, uint8_t)
#define PM_CTRL_CFDEN	(1 << 2)
#define PM_CTRL_BKUPCLK	(1 << 4)

#define PM_CTRL_s    MMIO_REG(0x40000400, struct __struct_PM_CTRL)
struct __struct_PM_CTRL
{
  uint8_t  : 2;
  uint8_t cfden : 1;
  uint8_t  : 1;
  uint8_t bkupclk : 1;
  uint8_t  : 3;
};

#define PM_SLEEP	MMIO_REG(0x40000401, uint8_t)
#define PM_SLEEP_IDLE(x)	((x) << 0)
#define PM_SLEEP_IDLE_MSK	0x00000003
#define PM_SLEEP_IDLE_VAL(x)	(((x) >> 0) & 0x3)

#define PM_SLEEP_s    MMIO_REG(0x40000401, struct __struct_PM_SLEEP)
struct __struct_PM_SLEEP
{
  uint8_t idle : 2;
  uint8_t  : 6;
};

#define PM_CPUSEL	MMIO_REG(0x40000408, uint8_t)
#define PM_CPUSEL_CPUDIV(x)	((x) << 0)
#define PM_CPUSEL_CPUDIV_MSK	0x00000007
#define PM_CPUSEL_CPUDIV_VAL(x)	(((x) >> 0) & 0x7)

#define PM_CPUSEL_s    MMIO_REG(0x40000408, struct __struct_PM_CPUSEL)
struct __struct_PM_CPUSEL
{
  uint8_t cpudiv : 3;
  uint8_t  : 5;
};

#define PM_APBASEL	MMIO_REG(0x40000409, uint8_t)
#define PM_APBASEL_APBADIV(x)	((x) << 0)
#define PM_APBASEL_APBADIV_MSK	0x00000007
#define PM_APBASEL_APBADIV_VAL(x)	(((x) >> 0) & 0x7)

#define PM_APBASEL_s    MMIO_REG(0x40000409, struct __struct_PM_APBASEL)
struct __struct_PM_APBASEL
{
  uint8_t apbadiv : 3;
  uint8_t  : 5;
};

#define PM_APBBSEL	MMIO_REG(0x4000040a, uint8_t)
#define PM_APBBSEL_APBBDIV(x)	((x) << 0)
#define PM_APBBSEL_APBBDIV_MSK	0x00000007
#define PM_APBBSEL_APBBDIV_VAL(x)	(((x) >> 0) & 0x7)

#define PM_APBBSEL_s    MMIO_REG(0x4000040a, struct __struct_PM_APBBSEL)
struct __struct_PM_APBBSEL
{
  uint8_t apbbdiv : 3;
  uint8_t  : 5;
};

#define PM_APBCSEL	MMIO_REG(0x4000040b, uint8_t)
#define PM_APBCSEL_APBCDIV(x)	((x) << 0)
#define PM_APBCSEL_APBCDIV_MSK	0x00000007
#define PM_APBCSEL_APBCDIV_VAL(x)	(((x) >> 0) & 0x7)

#define PM_APBCSEL_s    MMIO_REG(0x4000040b, struct __struct_PM_APBCSEL)
struct __struct_PM_APBCSEL
{
  uint8_t apbcdiv : 3;
  uint8_t  : 5;
};

