1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define PM_AHBMASK	MMIO_REG(0x40000414, uint32_t)
#define PM_AHBMASK_HPB0	(1 << 0)
#define PM_AHBMASK_HPB1	(1 << 1)
#define PM_AHBMASK_HPB2	(1 << 2)
#define PM_AHBMASK_DSU	(1 << 3)
#define PM_AHBMASK_NVMCTRL	(1 << 4)

#define PM_AHBMASK_s    MMIO_REG(0x40000414, struct __struct_PM_AHBMASK)
struct __struct_PM_AHBMASK
{
  uint32_t hpb0 : 1;
  uint32_t hpb1 : 1;
  uint32_t hpb2 : 1;
  uint32_t dsu : 1;
  uint32_t nvmctrl : 1;
  uint32_t  : 27;
};

#define PM_APBAMASK	MMIO_REG(0x40000418, uint32_t)
#define PM_APBAMASK_PAC0	(1 << 0)
#define PM_APBAMASK_PM	(1 << 1)
#define PM_APBAMASK_SYSCTRL	(1 << 2)
#define PM_APBAMASK_GCLK	(1 << 3)
#define PM_APBAMASK_WDT	(1 << 4)
#define PM_APBAMASK_RTC	(1 << 5)
#define PM_APBAMASK_EIC	(1 << 6)

#define PM_APBAMASK_s    MMIO_REG(0x40000418, struct __struct_PM_APBAMASK)
struct __struct_PM_APBAMASK
{
  uint32_t pac0 : 1;
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t gclk : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t  : 25;
};

#define PM_APBBMASK	MMIO_REG(0x4000041c, uint32_t)
#define PM_APBBMASK_PAC1	(1 << 0)
#define PM_APBBMASK_DSU	(1 << 1)
#define PM_APBBMASK_NVMCTRL	(1 << 2)
#define PM_APBBMASK_PORT	(1 << 3)

#define PM_APBBMASK_s    MMIO_REG(0x4000041c, struct __struct_PM_APBBMASK)
struct __struct_PM_APBBMASK
{
  uint32_t pac1 : 1;
  uint32_t dsu : 1;
  uint32_t nvmctrl : 1;
  uint32_t port : 1;
  uint32_t  : 28;
};

#define PM_APBCMASK	MMIO_REG(0x40000420, uint32_t)
#define PM_APBCMASK_PAC2	(1 << 0)
#define PM_APBCMASK_EVSYS	(1 << 1)
#define PM_APBCMASK_SERCOM0	(1 << 2)
#define PM_APBCMASK_SERCOM1	(1 << 3)
#define PM_APBCMASK_SERCOM2	(1 << 4)
#define PM_APBCMASK_SERCOM3	(1 << 5)
#define PM_APBCMASK_SERCOM4	(1 << 6)
#define PM_APBCMASK_SERCOM5	(1 << 7)
#define PM_APBCMASK_TC0	(1 << 8)
#define PM_APBCMASK_TC1	(1 << 9)
#define PM_APBCMASK_TC2	(1 << 10)
#define PM_APBCMASK_TC3	(1 << 11)
#define PM_APBCMASK_TC4	(1 << 12)
#define PM_APBCMASK_TC5	(1 << 13)
#define PM_APBCMASK_TC6	(1 << 14)
#define PM_APBCMASK_TC7	(1 << 15)
#define PM_APBCMASK_ADC	(1 << 16)
#define PM_APBCMASK_AC	(1 << 17)
#define PM_APBCMASK_DAC	(1 << 18)
#define PM_APBCMASK_PTC	(1 << 19)

#define PM_APBCMASK_s    MMIO_REG(0x40000420, struct __struct_PM_APBCMASK)
struct __struct_PM_APBCMASK
{
  uint32_t pac2 : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tc0 : 1;
  uint32_t tc1 : 1;
  uint32_t tc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t  : 12;
};

#define PM_INTENCLR	MMIO_REG(0x40000434, uint8_t)
#define PM_INTENCLR_CKRDY	(1 << 0)
#define PM_INTENCLR_CFD	(1 << 1)

#define PM_INTENCLR_s    MMIO_REG(0x40000434, struct __struct_PM_INTENCLR)
struct __struct_PM_INTENCLR
{
  uint8_t ckrdy : 1;
  uint8_t cfd : 1;
  uint8_t  : 6;
};

#define PM_INTENSET	MMIO_REG(0x40000435, uint8_t)
#define PM_INTENSET_CKRDY	(1 << 0)
#define PM_INTENSET_CFD	(1 << 1)

#define PM_INTENSET_s    MMIO_REG(0x40000435, struct __struct_PM_INTENSET)
struct __struct_PM_INTENSET
{
  uint8_t ckrdy : 1;
  uint8_t cfd : 1;
  uint8_t  : 6;
};

#define PM_INTFLAG	MMIO_REG(0x40000436, uint8_t)
#define PM_INTFLAG_CKRDY	(1 << 0)
#define PM_INTFLAG_CFD	(1 << 1)

#define PM_INTFLAG_s    MMIO_REG(0x40000436, struct __struct_PM_INTFLAG)
struct __struct_PM_INTFLAG
{
  uint8_t ckrdy : 1;
  uint8_t cfd : 1;
  uint8_t  : 6;
};

#define PM_RCAUSE	MMIO_REG(0x40000438, uint8_t)
#define PM_RCAUSE_POR	(1 << 0)
#define PM_RCAUSE_BOD12	(1 << 1)
#define PM_RCAUSE_BOD33	(1 << 2)
#define PM_RCAUSE_EXT	(1 << 4)
#define PM_RCAUSE_WDT	(1 << 5)
#define PM_RCAUSE_SYST	(1 << 6)

#define PM_RCAUSE_s    MMIO_REG(0x40000438, struct __struct_PM_RCAUSE)
struct __struct_PM_RCAUSE
{
  uint8_t por : 1;
  uint8_t bod12 : 1;
  uint8_t bod33 : 1;
  uint8_t  : 1;
  uint8_t ext : 1;
  uint8_t wdt : 1;
  uint8_t syst : 1;
  uint8_t  : 1;
};

// 0x40000800 SYSCTRL

#define SYSCTRL_INTENCLR	MMIO_REG(0x40000800, uint32_t)
#define SYSCTRL_INTENCLR_XOSCRDY	(1 << 0)
#define SYSCTRL_INTENCLR_XOSC32KRDY	(1 << 1)
#define SYSCTRL_INTENCLR_OSC32KRDY	(1 << 2)
#define SYSCTRL_INTENCLR_OSC8MRDY	(1 << 3)
#define SYSCTRL_INTENCLR_DFLLRDY	(1 << 4)
#define SYSCTRL_INTENCLR_DFLLOOB	(1 << 5)
#define SYSCTRL_INTENCLR_DFLLLCKF	(1 << 6)
#define SYSCTRL_INTENCLR_DFLLLCKC	(1 << 7)
#define SYSCTRL_INTENCLR_DFLLRCS	(1 << 8)
#define SYSCTRL_INTENCLR_BOD33RDY	(1 << 9)
#define SYSCTRL_INTENCLR_BOD33DET	(1 << 10)
#define SYSCTRL_INTENCLR_B33SRDY	(1 << 11)
#define SYSCTRL_INTENCLR_BOD12RDY	(1 << 12)
#define SYSCTRL_INTENCLR_BOD12DET	(1 << 13)
#define SYSCTRL_INTENCLR_B12SRDY	(1 << 14)

#define SYSCTRL_INTENCLR_s    MMIO_REG(0x40000800, struct __struct_SYSCTRL_INTENCLR)
struct __struct_SYSCTRL_INTENCLR
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t bod12rdy : 1;
  uint32_t bod12det : 1;
  uint32_t b12srdy : 1;
  uint32_t  : 17;
};

#define SYSCTRL_INTENSET	MMIO_REG(0x40000804, uint32_t)
#define SYSCTRL_INTENSET_XOSCRDY	(1 << 0)
#define SYSCTRL_INTENSET_XOSC32KRDY	(1 << 1)
#define SYSCTRL_INTENSET_OSC32KRDY	(1 << 2)
#define SYSCTRL_INTENSET_OSC8MRDY	(1 << 3)
#define SYSCTRL_INTENSET_DFLLRDY	(1 << 4)
#define SYSCTRL_INTENSET_DFLLOOB	(1 << 5)
#define SYSCTRL_INTENSET_DFLLLCKF	(1 << 6)
#define SYSCTRL_INTENSET_DFLLLCKC	(1 << 7)
#define SYSCTRL_INTENSET_DFLLRCS	(1 << 8)
#define SYSCTRL_INTENSET_BOD33RDY	(1 << 9)
#define SYSCTRL_INTENSET_BOD33DET	(1 << 10)
#define SYSCTRL_INTENSET_B33SRDY	(1 << 11)
#define SYSCTRL_INTENSET_BOD12RDY	(1 << 12)
#define SYSCTRL_INTENSET_BOD12DET	(1 << 13)
#define SYSCTRL_INTENSET_B12SRDY	(1 << 14)

#define SYSCTRL_INTENSET_s    MMIO_REG(0x40000804, struct __struct_SYSCTRL_INTENSET)
struct __struct_SYSCTRL_INTENSET
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t bod12rdy : 1;
  uint32_t bod12det : 1;
  uint32_t b12srdy : 1;
  uint32_t  : 17;
};

#define SYSCTRL_INTFLAG	MMIO_REG(0x40000808, uint32_t)
#define SYSCTRL_INTFLAG_XOSCRDY	(1 << 0)
#define SYSCTRL_INTFLAG_XOSC32KRDY	(1 << 1)
#define SYSCTRL_INTFLAG_OSC32KRDY	(1 << 2)
#define SYSCTRL_INTFLAG_OSC8MRDY	(1 << 3)
#define SYSCTRL_INTFLAG_DFLLRDY	(1 << 4)
#define SYSCTRL_INTFLAG_DFLLOOB	(1 << 5)
#define SYSCTRL_INTFLAG_DFLLLCKF	(1 << 6)
#define SYSCTRL_INTFLAG_DFLLLCKC	(1 << 7)
#define SYSCTRL_INTFLAG_DFLLRCS	(1 << 8)
#define SYSCTRL_INTFLAG_BOD33RDY	(1 << 9)
#define SYSCTRL_INTFLAG_BOD33DET	(1 << 10)
#define SYSCTRL_INTFLAG_B33SRDY	(1 << 11)
#define SYSCTRL_INTFLAG_BOD12RDY	(1 << 12)
#define SYSCTRL_INTFLAG_BOD12DET	(1 << 13)
#define SYSCTRL_INTFLAG_B12SRDY	(1 << 14)

#define SYSCTRL_INTFLAG_s    MMIO_REG(0x40000808, struct __struct_SYSCTRL_INTFLAG)
struct __struct_SYSCTRL_INTFLAG
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t bod12rdy : 1;
  uint32_t bod12det : 1;
  uint32_t b12srdy : 1;
  uint32_t  : 17;
};

#define SYSCTRL_PCLKSR	MMIO_REG(0x4000080c, uint32_t)
#define SYSCTRL_PCLKSR_XOSCRDY	(1 << 0)
#define SYSCTRL_PCLKSR_XOSC32KRDY	(1 << 1)
#define SYSCTRL_PCLKSR_OSC32KRDY	(1 << 2)
#define SYSCTRL_PCLKSR_OSC8MRDY	(1 << 3)
#define SYSCTRL_PCLKSR_DFLLRDY	(1 << 4)
#define SYSCTRL_PCLKSR_DFLLOOB	(1 << 5)
#define SYSCTRL_PCLKSR_DFLLLCKF	(1 << 6)
#define SYSCTRL_PCLKSR_DFLLLCKC	(1 << 7)
#define SYSCTRL_PCLKSR_DFLLRCS	(1 << 8)
#define SYSCTRL_PCLKSR_BOD33RDY	(1 << 9)
#define SYSCTRL_PCLKSR_BOD33DET	(1 << 10)
#define SYSCTRL_PCLKSR_B33SRDY	(1 << 11)
#define SYSCTRL_PCLKSR_BOD12RDY	(1 << 12)
#define SYSCTRL_PCLKSR_BOD12DET	(1 << 13)
#define SYSCTRL_PCLKSR_B12SRDY	(1 << 14)

#define SYSCTRL_PCLKSR_s    MMIO_REG(0x4000080c, struct __struct_SYSCTRL_PCLKSR)
struct __struct_SYSCTRL_PCLKSR
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t bod12rdy : 1;
  uint32_t bod12det : 1;
  uint32_t b12srdy : 1;
  uint32_t  : 17;
};

#define SYSCTRL_XOSC	MMIO_REG(0x40000810, uint16_t)
#define SYSCTRL_XOSC_ENABLE	(1 << 1)
#define SYSCTRL_XOSC_XTALEN	(1 << 2)
#define SYSCTRL_XOSC_RUNSTDBY	(1 << 6)
#define SYSCTRL_XOSC_ONDEMAND	(1 << 7)
#define SYSCTRL_XOSC_GAIN(x)	((x) << 8)
#define SYSCTRL_XOSC_GAIN_MSK	0x00000700
#define SYSCTRL_XOSC_GAIN_VAL(x)	(((x) >> 8) & 0x7)
#define SYSCTRL_XOSC_AMPGC	(1 << 11)
#define SYSCTRL_XOSC_STARTUP(x)	((x) << 12)
#define SYSCTRL_XOSC_STARTUP_MSK	0x0000f000
#define SYSCTRL_XOSC_STARTUP_VAL(x)	(((x) >> 12) & 0xf)

#define SYSCTRL_XOSC_s    MMIO_REG(0x40000810, struct __struct_SYSCTRL_XOSC)
struct __struct_SYSCTRL_XOSC
{
  uint16_t  : 1;
  uint16_t enable : 1;
  uint16_t xtalen : 1;
  uint16_t  : 3;
  uint16_t runstdby : 1;
  uint16_t ondemand : 1;
  uint16_t gain : 3;
  uint16_t ampgc : 1;
  uint16_t startup : 4;
};

#define SYSCTRL_XOSC32K	MMIO_REG(0x40000814, uint16_t)
#define SYSCTRL_XOSC32K_ENABLE	(1 << 1)
#define SYSCTRL_XOSC32K_XTALEN	(1 << 2)
#define SYSCTRL_XOSC32K_EN32K	(1 << 3)
#define SYSCTRL_XOSC32K_EN1K	(1 << 4)
#define SYSCTRL_XOSC32K_AAMPEN	(1 << 5)
#define SYSCTRL_XOSC32K_RUNSTDBY	(1 << 6)
#define SYSCTRL_XOSC32K_ONDEMAND	(1 << 7)
#define SYSCTRL_XOSC32K_STARTUP(x)	((x) << 8)
#define SYSCTRL_XOSC32K_STARTUP_MSK	0x00000700
#define SYSCTRL_XOSC32K_STARTUP_VAL(x)	(((x) >> 8) & 0x7)
#define SYSCTRL_XOSC32K_WRTLOCK	(1 << 12)

