1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define SYSCTRL_BOD12	MMIO_REG(0x40000838, uint32_t)
#define SYSCTRL_BOD12_ENABLE	(1 << 1)
#define SYSCTRL_BOD12_HYST	(1 << 2)
#define SYSCTRL_BOD12_ACTION(x)	((x) << 3)
#define SYSCTRL_BOD12_ACTION_MSK	0x00000018
#define SYSCTRL_BOD12_ACTION_VAL(x)	(((x) >> 3) & 0x3)
#define SYSCTRL_BOD12_RUNSTDBY	(1 << 6)
#define SYSCTRL_BOD12_MODE	(1 << 8)
#define SYSCTRL_BOD12_CEN	(1 << 9)
#define SYSCTRL_BOD12_PSEL(x)	((x) << 12)
#define SYSCTRL_BOD12_PSEL_MSK	0x0000f000
#define SYSCTRL_BOD12_PSEL_VAL(x)	(((x) >> 12) & 0xf)
#define SYSCTRL_BOD12_LEVEL(x)	((x) << 16)
#define SYSCTRL_BOD12_LEVEL_MSK	0x001f0000
#define SYSCTRL_BOD12_LEVEL_VAL(x)	(((x) >> 16) & 0x1f)

#define SYSCTRL_BOD12_s    MMIO_REG(0x40000838, struct __struct_SYSCTRL_BOD12)
struct __struct_SYSCTRL_BOD12
{
  uint32_t  : 1;
  uint32_t enable : 1;
  uint32_t hyst : 1;
  uint32_t action : 2;
  uint32_t  : 1;
  uint32_t runstdby : 1;
  uint32_t  : 1;
  uint32_t mode : 1;
  uint32_t cen : 1;
  uint32_t  : 2;
  uint32_t psel : 4;
  uint32_t level : 5;
  uint32_t  : 11;
};

#define SYSCTRL_VREG	MMIO_REG(0x4000083c, uint16_t)
#define SYSCTRL_VREG_ENABLE	(1 << 1)
#define SYSCTRL_VREG_VDMON(x)	((x) << 4)
#define SYSCTRL_VREG_VDMON_MSK	0x00000030
#define SYSCTRL_VREG_VDMON_VAL(x)	(((x) >> 4) & 0x3)
#define SYSCTRL_VREG_RUNSTDBY	(1 << 6)
#define SYSCTRL_VREG_LEVEL(x)	((x) << 8)
#define SYSCTRL_VREG_LEVEL_MSK	0x00000700
#define SYSCTRL_VREG_LEVEL_VAL(x)	(((x) >> 8) & 0x7)
#define SYSCTRL_VREG_CALIB(x)	((x) << 12)
#define SYSCTRL_VREG_CALIB_MSK	0x00007000
#define SYSCTRL_VREG_CALIB_VAL(x)	(((x) >> 12) & 0x7)

#define SYSCTRL_VREG_s    MMIO_REG(0x4000083c, struct __struct_SYSCTRL_VREG)
struct __struct_SYSCTRL_VREG
{
  uint16_t  : 1;
  uint16_t enable : 1;
  uint16_t  : 2;
  uint16_t vdmon : 2;
  uint16_t runstdby : 1;
  uint16_t  : 1;
  uint16_t level : 3;
  uint16_t  : 1;
  uint16_t calib : 3;
  uint16_t  : 1;
};

#define SYSCTRL_VREF	MMIO_REG(0x40000840, uint32_t)
#define SYSCTRL_VREF_TSEN	(1 << 1)
#define SYSCTRL_VREF_BGOUTEN	(1 << 2)
#define SYSCTRL_VREF_CALIB(x)	((x) << 16)
#define SYSCTRL_VREF_CALIB_MSK	0x07ff0000
#define SYSCTRL_VREF_CALIB_VAL(x)	(((x) >> 16) & 0x7ff)

#define SYSCTRL_VREF_s    MMIO_REG(0x40000840, struct __struct_SYSCTRL_VREF)
struct __struct_SYSCTRL_VREF
{
  uint32_t  : 1;
  uint32_t tsen : 1;
  uint32_t bgouten : 1;
  uint32_t  : 13;
  uint32_t calib : 11;
  uint32_t  : 5;
};

// 0x40000c00 GCLK

#define GCLK_CTRL	MMIO_REG(0x40000c00, uint8_t)
#define GCLK_CTRL_SWRST	(1 << 0)

#define GCLK_CTRL_s    MMIO_REG(0x40000c00, struct __struct_GCLK_CTRL)
struct __struct_GCLK_CTRL
{
  uint8_t swrst : 1;
  uint8_t  : 7;
};

#define GCLK_STATUS	MMIO_REG(0x40000c01, uint8_t)
#define GCLK_STATUS_SYNCBUSY	(1 << 7)

#define GCLK_STATUS_s    MMIO_REG(0x40000c01, struct __struct_GCLK_STATUS)
struct __struct_GCLK_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define GCLK_CLKCTRL	MMIO_REG(0x40000c02, uint16_t)
#define GCLK_CLKCTRL_ID(x)	((x) << 0)
#define GCLK_CLKCTRL_ID_MSK	0x0000003f
#define GCLK_CLKCTRL_ID_VAL(x)	(((x) >> 0) & 0x3f)
#define GCLK_CLKCTRL_GEN(x)	((x) << 8)
#define GCLK_CLKCTRL_GEN_MSK	0x00000f00
#define GCLK_CLKCTRL_GEN_VAL(x)	(((x) >> 8) & 0xf)
#define GCLK_CLKCTRL_CLKEN	(1 << 14)
#define GCLK_CLKCTRL_WRTLOCK	(1 << 15)

#define GCLK_CLKCTRL_s    MMIO_REG(0x40000c02, struct __struct_GCLK_CLKCTRL)
struct __struct_GCLK_CLKCTRL
{
  uint16_t id : 6;
  uint16_t  : 2;
  uint16_t gen : 4;
  uint16_t  : 2;
  uint16_t clken : 1;
  uint16_t wrtlock : 1;
};

#define GCLK_GENCTRL	MMIO_REG(0x40000c04, uint32_t)
#define GCLK_GENCTRL_ID(x)	((x) << 0)
#define GCLK_GENCTRL_ID_MSK	0x0000000f
#define GCLK_GENCTRL_ID_VAL(x)	(((x) >> 0) & 0xf)
#define GCLK_GENCTRL_SRC(x)	((x) << 8)
#define GCLK_GENCTRL_SRC_MSK	0x00001f00
#define GCLK_GENCTRL_SRC_VAL(x)	(((x) >> 8) & 0x1f)
#define GCLK_GENCTRL_GENEN	(1 << 16)
#define GCLK_GENCTRL_IDC	(1 << 17)
#define GCLK_GENCTRL_OOV	(1 << 18)
#define GCLK_GENCTRL_OE	(1 << 19)
#define GCLK_GENCTRL_DIVSEL	(1 << 20)
#define GCLK_GENCTRL_RUNSTDBY	(1 << 21)

#define GCLK_GENCTRL_s    MMIO_REG(0x40000c04, struct __struct_GCLK_GENCTRL)
struct __struct_GCLK_GENCTRL
{
  uint32_t id : 4;
  uint32_t  : 4;
  uint32_t src : 5;
  uint32_t  : 3;
  uint32_t genen : 1;
  uint32_t idc : 1;
  uint32_t oov : 1;
  uint32_t oe : 1;
  uint32_t divsel : 1;
  uint32_t runstdby : 1;
  uint32_t  : 10;
};

#define GCLK_GENDIV	MMIO_REG(0x40000c08, uint32_t)
#define GCLK_GENDIV_ID(x)	((x) << 0)
#define GCLK_GENDIV_ID_MSK	0x0000000f
#define GCLK_GENDIV_ID_VAL(x)	(((x) >> 0) & 0xf)
#define GCLK_GENDIV_DIV(x)	((x) << 8)
#define GCLK_GENDIV_DIV_MSK	0x00ffff00
#define GCLK_GENDIV_DIV_VAL(x)	(((x) >> 8) & 0xffff)

#define GCLK_GENDIV_s    MMIO_REG(0x40000c08, struct __struct_GCLK_GENDIV)
struct __struct_GCLK_GENDIV
{
  uint32_t id : 4;
  uint32_t  : 4;
  uint32_t div : 16;
  uint32_t  : 8;
};

// 0x40001000 WDT

#define WDT_CTRL	MMIO_REG(0x40001000, uint8_t)
#define WDT_CTRL_ENABLE	(1 << 1)
#define WDT_CTRL_WEN	(1 << 2)
#define WDT_CTRL_ALWAYSON	(1 << 7)

#define WDT_CTRL_s    MMIO_REG(0x40001000, struct __struct_WDT_CTRL)
struct __struct_WDT_CTRL
{
  uint8_t  : 1;
  uint8_t enable : 1;
  uint8_t wen : 1;
  uint8_t  : 4;
  uint8_t alwayson : 1;
};

#define WDT_CONFIG	MMIO_REG(0x40001001, uint8_t)
#define WDT_CONFIG_PER(x)	((x) << 0)
#define WDT_CONFIG_PER_MSK	0x0000000f
#define WDT_CONFIG_PER_VAL(x)	(((x) >> 0) & 0xf)
#define WDT_CONFIG_WINDOW(x)	((x) << 4)
#define WDT_CONFIG_WINDOW_MSK	0x000000f0
#define WDT_CONFIG_WINDOW_VAL(x)	(((x) >> 4) & 0xf)

#define WDT_CONFIG_s    MMIO_REG(0x40001001, struct __struct_WDT_CONFIG)
struct __struct_WDT_CONFIG
{
  uint8_t per : 4;
  uint8_t window : 4;
};

#define WDT_EWCTRL	MMIO_REG(0x40001002, uint8_t)
#define WDT_EWCTRL_EWOFFSET(x)	((x) << 0)
#define WDT_EWCTRL_EWOFFSET_MSK	0x0000000f
#define WDT_EWCTRL_EWOFFSET_VAL(x)	(((x) >> 0) & 0xf)

#define WDT_EWCTRL_s    MMIO_REG(0x40001002, struct __struct_WDT_EWCTRL)
struct __struct_WDT_EWCTRL
{
  uint8_t ewoffset : 4;
  uint8_t  : 4;
};

#define WDT_INTENCLR	MMIO_REG(0x40001004, uint8_t)
#define WDT_INTENCLR_EW	(1 << 0)

#define WDT_INTENCLR_s    MMIO_REG(0x40001004, struct __struct_WDT_INTENCLR)
struct __struct_WDT_INTENCLR
{
  uint8_t ew : 1;
  uint8_t  : 7;
};

