1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define RTC_M1_READREQ	MMIO_REG(0x40001402, uint16_t)
#define RTC_M1_READREQ_ADDR(x)	((x) << 0)
#define RTC_M1_READREQ_ADDR_MSK	0x0000003f
#define RTC_M1_READREQ_ADDR_VAL(x)	(((x) >> 0) & 0x3f)
#define RTC_M1_READREQ_RCONT	(1 << 14)
#define RTC_M1_READREQ_RREQ	(1 << 15)

#define RTC_M1_READREQ_s    MMIO_REG(0x40001402, struct __struct_RTC_M1_READREQ)
struct __struct_RTC_M1_READREQ
{
  uint16_t addr : 6;
  uint16_t  : 8;
  uint16_t rcont : 1;
  uint16_t rreq : 1;
};

#define RTC_M1_EVCTRL	MMIO_REG(0x40001404, uint16_t)
#define RTC_M1_EVCTRL_PEREO0	(1 << 0)
#define RTC_M1_EVCTRL_PEREO1	(1 << 1)
#define RTC_M1_EVCTRL_PEREO2	(1 << 2)
#define RTC_M1_EVCTRL_PEREO3	(1 << 3)
#define RTC_M1_EVCTRL_PEREO4	(1 << 4)
#define RTC_M1_EVCTRL_PEREO5	(1 << 5)
#define RTC_M1_EVCTRL_PEREO6	(1 << 6)
#define RTC_M1_EVCTRL_PEREO7	(1 << 7)
#define RTC_M1_EVCTRL_CMPEO0	(1 << 8)
#define RTC_M1_EVCTRL_CMPEO1	(1 << 9)
#define RTC_M1_EVCTRL_OVFEO	(1 << 15)

#define RTC_M1_EVCTRL_s    MMIO_REG(0x40001404, struct __struct_RTC_M1_EVCTRL)
struct __struct_RTC_M1_EVCTRL
{
  uint16_t pereo0 : 1;
  uint16_t pereo1 : 1;
  uint16_t pereo2 : 1;
  uint16_t pereo3 : 1;
  uint16_t pereo4 : 1;
  uint16_t pereo5 : 1;
  uint16_t pereo6 : 1;
  uint16_t pereo7 : 1;
  uint16_t cmpeo0 : 1;
  uint16_t cmpeo1 : 1;
  uint16_t  : 5;
  uint16_t ovfeo : 1;
};

#define RTC_M1_INTENCLR	MMIO_REG(0x40001406, uint8_t)
#define RTC_M1_INTENCLR_CMP0	(1 << 0)
#define RTC_M1_INTENCLR_CMP1	(1 << 1)
#define RTC_M1_INTENCLR_SYNCRDY	(1 << 6)
#define RTC_M1_INTENCLR_OVF	(1 << 7)

#define RTC_M1_INTENCLR_s    MMIO_REG(0x40001406, struct __struct_RTC_M1_INTENCLR)
struct __struct_RTC_M1_INTENCLR
{
  uint8_t cmp0 : 1;
  uint8_t cmp1 : 1;
  uint8_t  : 4;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M1_INTENSET	MMIO_REG(0x40001407, uint8_t)
#define RTC_M1_INTENSET_CMP0	(1 << 0)
#define RTC_M1_INTENSET_CMP1	(1 << 1)
#define RTC_M1_INTENSET_SYNCRDY	(1 << 6)
#define RTC_M1_INTENSET_OVF	(1 << 7)

#define RTC_M1_INTENSET_s    MMIO_REG(0x40001407, struct __struct_RTC_M1_INTENSET)
struct __struct_RTC_M1_INTENSET
{
  uint8_t cmp0 : 1;
  uint8_t cmp1 : 1;
  uint8_t  : 4;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M1_INTFLAG	MMIO_REG(0x40001408, uint8_t)
#define RTC_M1_INTFLAG_CMP0	(1 << 0)
#define RTC_M1_INTFLAG_CMP1	(1 << 1)
#define RTC_M1_INTFLAG_SYNCRDY	(1 << 6)
#define RTC_M1_INTFLAG_OVF	(1 << 7)

#define RTC_M1_INTFLAG_s    MMIO_REG(0x40001408, struct __struct_RTC_M1_INTFLAG)
struct __struct_RTC_M1_INTFLAG
{
  uint8_t cmp0 : 1;
  uint8_t cmp1 : 1;
  uint8_t  : 4;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M1_STATUS	MMIO_REG(0x4000140a, uint8_t)
#define RTC_M1_STATUS_SYNCBUSY	(1 << 7)

#define RTC_M1_STATUS_s    MMIO_REG(0x4000140a, struct __struct_RTC_M1_STATUS)
struct __struct_RTC_M1_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define RTC_M1_DBGCTRL	MMIO_REG(0x4000140b, uint8_t)
#define RTC_M1_DBGCTRL_DBGRUN	(1 << 0)

#define RTC_M1_DBGCTRL_s    MMIO_REG(0x4000140b, struct __struct_RTC_M1_DBGCTRL)
struct __struct_RTC_M1_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

#define RTC_M1_FREQCORR	MMIO_REG(0x4000140c, uint8_t)
#define RTC_M1_FREQCORR_VALUE(x)	((x) << 0)
#define RTC_M1_FREQCORR_VALUE_MSK	0x0000007f
#define RTC_M1_FREQCORR_VALUE_VAL(x)	(((x) >> 0) & 0x7f)
#define RTC_M1_FREQCORR_SIGN	(1 << 7)

#define RTC_M1_FREQCORR_s    MMIO_REG(0x4000140c, struct __struct_RTC_M1_FREQCORR)
struct __struct_RTC_M1_FREQCORR
{
  uint8_t value : 7;
  uint8_t sign : 1;
};

#define RTC_M1_COUNT	MMIO_REG(0x40001410, uint16_t)
#define RTC_M1_COUNT_COUNT(x)	((x) << 0)
#define RTC_M1_COUNT_COUNT_MSK	0x0000ffff
#define RTC_M1_COUNT_COUNT_VAL(x)	(((x) >> 0) & 0xffff)

#define RTC_M1_COUNT_s    MMIO_REG(0x40001410, struct __struct_RTC_M1_COUNT)
struct __struct_RTC_M1_COUNT
{
  uint16_t count : 16;
};

#define RTC_M1_PER	MMIO_REG(0x40001414, uint16_t)
#define RTC_M1_PER_PER(x)	((x) << 0)
#define RTC_M1_PER_PER_MSK	0x0000ffff
#define RTC_M1_PER_PER_VAL(x)	(((x) >> 0) & 0xffff)

#define RTC_M1_PER_s    MMIO_REG(0x40001414, struct __struct_RTC_M1_PER)
struct __struct_RTC_M1_PER
{
  uint16_t per : 16;
};

#define RTC_M1_COMP0	MMIO_REG(0x40001418, uint16_t)
#define RTC_M1_COMP0_COMP(x)	((x) << 0)
#define RTC_M1_COMP0_COMP_MSK	0x0000ffff
#define RTC_M1_COMP0_COMP_VAL(x)	(((x) >> 0) & 0xffff)

#define RTC_M1_COMP0_s    MMIO_REG(0x40001418, struct __struct_RTC_M1_COMP0)
struct __struct_RTC_M1_COMP0
{
  uint16_t comp : 16;
};

#define RTC_M1_COMP1	MMIO_REG(0x4000141a, uint16_t)
#define RTC_M1_COMP1_COMP(x)	((x) << 0)
#define RTC_M1_COMP1_COMP_MSK	0x0000ffff
#define RTC_M1_COMP1_COMP_VAL(x)	(((x) >> 0) & 0xffff)

#define RTC_M1_COMP1_s    MMIO_REG(0x4000141a, struct __struct_RTC_M1_COMP1)
struct __struct_RTC_M1_COMP1
{
  uint16_t comp : 16;
};

// 0x40001400 RTC_M2

#define RTC_M2_CTRL	MMIO_REG(0x40001400, uint16_t)
#define RTC_M2_CTRL_SWRST	(1 << 0)
#define RTC_M2_CTRL_ENABLE	(1 << 1)
#define RTC_M2_CTRL_MODE(x)	((x) << 2)
#define RTC_M2_CTRL_MODE_MSK	0x0000000c
#define RTC_M2_CTRL_MODE_VAL(x)	(((x) >> 2) & 0x3)
#define RTC_M2_CTRL_CLKREP	(1 << 6)
#define RTC_M2_CTRL_MATCHCLR	(1 << 7)
#define RTC_M2_CTRL_PRESCALER(x)	((x) << 8)
#define RTC_M2_CTRL_PRESCALER_MSK	0x00000f00
#define RTC_M2_CTRL_PRESCALER_VAL(x)	(((x) >> 8) & 0xf)

#define RTC_M2_CTRL_s    MMIO_REG(0x40001400, struct __struct_RTC_M2_CTRL)
struct __struct_RTC_M2_CTRL
{
  uint16_t swrst : 1;
  uint16_t enable : 1;
  uint16_t mode : 2;
  uint16_t  : 2;
  uint16_t clkrep : 1;
  uint16_t matchclr : 1;
  uint16_t prescaler : 4;
  uint16_t  : 4;
};

#define RTC_M2_READREQ	MMIO_REG(0x40001402, uint16_t)
#define RTC_M2_READREQ_ADDR(x)	((x) << 0)
#define RTC_M2_READREQ_ADDR_MSK	0x0000003f
#define RTC_M2_READREQ_ADDR_VAL(x)	(((x) >> 0) & 0x3f)
#define RTC_M2_READREQ_RCONT	(1 << 14)
#define RTC_M2_READREQ_RREQ	(1 << 15)

#define RTC_M2_READREQ_s    MMIO_REG(0x40001402, struct __struct_RTC_M2_READREQ)
struct __struct_RTC_M2_READREQ
{
  uint16_t addr : 6;
  uint16_t  : 8;
  uint16_t rcont : 1;
  uint16_t rreq : 1;
};

#define RTC_M2_EVCTRL	MMIO_REG(0x40001404, uint16_t)
#define RTC_M2_EVCTRL_PEREO0	(1 << 0)
#define RTC_M2_EVCTRL_PEREO1	(1 << 1)
#define RTC_M2_EVCTRL_PEREO2	(1 << 2)
#define RTC_M2_EVCTRL_PEREO3	(1 << 3)
#define RTC_M2_EVCTRL_PEREO4	(1 << 4)
#define RTC_M2_EVCTRL_PEREO5	(1 << 5)
#define RTC_M2_EVCTRL_PEREO6	(1 << 6)
#define RTC_M2_EVCTRL_PEREO7	(1 << 7)
#define RTC_M2_EVCTRL_ALARMEO0	(1 << 8)
#define RTC_M2_EVCTRL_OVFEO	(1 << 15)

#define RTC_M2_EVCTRL_s    MMIO_REG(0x40001404, struct __struct_RTC_M2_EVCTRL)
struct __struct_RTC_M2_EVCTRL
{
  uint16_t pereo0 : 1;
  uint16_t pereo1 : 1;
  uint16_t pereo2 : 1;
  uint16_t pereo3 : 1;
  uint16_t pereo4 : 1;
  uint16_t pereo5 : 1;
  uint16_t pereo6 : 1;
  uint16_t pereo7 : 1;
  uint16_t alarmeo0 : 1;
  uint16_t  : 6;
  uint16_t ovfeo : 1;
};

#define RTC_M2_INTENCLR	MMIO_REG(0x40001406, uint8_t)
#define RTC_M2_INTENCLR_ALARM0	(1 << 0)
#define RTC_M2_INTENCLR_SYNCRDY	(1 << 6)
#define RTC_M2_INTENCLR_OVF	(1 << 7)

#define RTC_M2_INTENCLR_s    MMIO_REG(0x40001406, struct __struct_RTC_M2_INTENCLR)
struct __struct_RTC_M2_INTENCLR
{
  uint8_t alarm0 : 1;
  uint8_t  : 5;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M2_INTENSET	MMIO_REG(0x40001407, uint8_t)
#define RTC_M2_INTENSET_ALARM0	(1 << 0)
#define RTC_M2_INTENSET_SYNCRDY	(1 << 6)
#define RTC_M2_INTENSET_OVF	(1 << 7)

#define RTC_M2_INTENSET_s    MMIO_REG(0x40001407, struct __struct_RTC_M2_INTENSET)
struct __struct_RTC_M2_INTENSET
{
  uint8_t alarm0 : 1;
  uint8_t  : 5;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M2_INTFLAG	MMIO_REG(0x40001408, uint8_t)
#define RTC_M2_INTFLAG_ALARM0	(1 << 0)
#define RTC_M2_INTFLAG_SYNCRDY	(1 << 6)
#define RTC_M2_INTFLAG_OVF	(1 << 7)

#define RTC_M2_INTFLAG_s    MMIO_REG(0x40001408, struct __struct_RTC_M2_INTFLAG)
struct __struct_RTC_M2_INTFLAG
{
  uint8_t alarm0 : 1;
  uint8_t  : 5;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

