1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define RTC_M2_STATUS	MMIO_REG(0x4000140a, uint8_t)
#define RTC_M2_STATUS_SYNCBUSY	(1 << 7)

#define RTC_M2_STATUS_s    MMIO_REG(0x4000140a, struct __struct_RTC_M2_STATUS)
struct __struct_RTC_M2_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define RTC_M2_DBGCTRL	MMIO_REG(0x4000140b, uint8_t)
#define RTC_M2_DBGCTRL_DBGRUN	(1 << 0)

#define RTC_M2_DBGCTRL_s    MMIO_REG(0x4000140b, struct __struct_RTC_M2_DBGCTRL)
struct __struct_RTC_M2_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

#define RTC_M2_FREQCORR	MMIO_REG(0x4000140c, uint8_t)
#define RTC_M2_FREQCORR_VALUE(x)	((x) << 0)
#define RTC_M2_FREQCORR_VALUE_MSK	0x0000007f
#define RTC_M2_FREQCORR_VALUE_VAL(x)	(((x) >> 0) & 0x7f)
#define RTC_M2_FREQCORR_SIGN	(1 << 7)

#define RTC_M2_FREQCORR_s    MMIO_REG(0x4000140c, struct __struct_RTC_M2_FREQCORR)
struct __struct_RTC_M2_FREQCORR
{
  uint8_t value : 7;
  uint8_t sign : 1;
};

#define RTC_M2_CLOCK	MMIO_REG(0x40001410, uint32_t)
#define RTC_M2_CLOCK_SECOND(x)	((x) << 0)
#define RTC_M2_CLOCK_SECOND_MSK	0x0000003f
#define RTC_M2_CLOCK_SECOND_VAL(x)	(((x) >> 0) & 0x3f)
#define RTC_M2_CLOCK_MINUTE(x)	((x) << 6)
#define RTC_M2_CLOCK_MINUTE_MSK	0x00000fc0
#define RTC_M2_CLOCK_MINUTE_VAL(x)	(((x) >> 6) & 0x3f)
#define RTC_M2_CLOCK_HOUR(x)	((x) << 12)
#define RTC_M2_CLOCK_HOUR_MSK	0x0001f000
#define RTC_M2_CLOCK_HOUR_VAL(x)	(((x) >> 12) & 0x1f)
#define RTC_M2_CLOCK_DAY(x)	((x) << 17)
#define RTC_M2_CLOCK_DAY_MSK	0x003e0000
#define RTC_M2_CLOCK_DAY_VAL(x)	(((x) >> 17) & 0x1f)
#define RTC_M2_CLOCK_MONTH(x)	((x) << 22)
#define RTC_M2_CLOCK_MONTH_MSK	0x03c00000
#define RTC_M2_CLOCK_MONTH_VAL(x)	(((x) >> 22) & 0xf)
#define RTC_M2_CLOCK_YEAR(x)	((x) << 26)
#define RTC_M2_CLOCK_YEAR_MSK	0xfc000000
#define RTC_M2_CLOCK_YEAR_VAL(x)	(((x) >> 26) & 0x3f)

#define RTC_M2_CLOCK_s    MMIO_REG(0x40001410, struct __struct_RTC_M2_CLOCK)
struct __struct_RTC_M2_CLOCK
{
  uint32_t second : 6;
  uint32_t minute : 6;
  uint32_t hour : 5;
  uint32_t day : 5;
  uint32_t month : 4;
  uint32_t year : 6;
};

#define RTC_M2_ALARM0	MMIO_REG(0x40001418, uint32_t)
#define RTC_M2_ALARM0_SECOND(x)	((x) << 0)
#define RTC_M2_ALARM0_SECOND_MSK	0x0000003f
#define RTC_M2_ALARM0_SECOND_VAL(x)	(((x) >> 0) & 0x3f)
#define RTC_M2_ALARM0_MINUTE(x)	((x) << 6)
#define RTC_M2_ALARM0_MINUTE_MSK	0x00000fc0
#define RTC_M2_ALARM0_MINUTE_VAL(x)	(((x) >> 6) & 0x3f)
#define RTC_M2_ALARM0_HOUR(x)	((x) << 12)
#define RTC_M2_ALARM0_HOUR_MSK	0x0001f000
#define RTC_M2_ALARM0_HOUR_VAL(x)	(((x) >> 12) & 0x1f)
#define RTC_M2_ALARM0_DAY(x)	((x) << 17)
#define RTC_M2_ALARM0_DAY_MSK	0x003e0000
#define RTC_M2_ALARM0_DAY_VAL(x)	(((x) >> 17) & 0x1f)
#define RTC_M2_ALARM0_MONTH(x)	((x) << 22)
#define RTC_M2_ALARM0_MONTH_MSK	0x03c00000
#define RTC_M2_ALARM0_MONTH_VAL(x)	(((x) >> 22) & 0xf)
#define RTC_M2_ALARM0_YEAR(x)	((x) << 26)
#define RTC_M2_ALARM0_YEAR_MSK	0xfc000000
#define RTC_M2_ALARM0_YEAR_VAL(x)	(((x) >> 26) & 0x3f)

#define RTC_M2_ALARM0_s    MMIO_REG(0x40001418, struct __struct_RTC_M2_ALARM0)
struct __struct_RTC_M2_ALARM0
{
  uint32_t second : 6;
  uint32_t minute : 6;
  uint32_t hour : 5;
  uint32_t day : 5;
  uint32_t month : 4;
  uint32_t year : 6;
};

#define RTC_M2_MASK0	MMIO_REG(0x4000141c, uint8_t)
#define RTC_M2_MASK0_SEL(x)	((x) << 0)
#define RTC_M2_MASK0_SEL_MSK	0x00000007
#define RTC_M2_MASK0_SEL_VAL(x)	(((x) >> 0) & 0x7)

#define RTC_M2_MASK0_s    MMIO_REG(0x4000141c, struct __struct_RTC_M2_MASK0)
struct __struct_RTC_M2_MASK0
{
  uint8_t sel : 3;
  uint8_t  : 5;
};

// 0x40001800 EIC

#define EIC_CTRL	MMIO_REG(0x40001800, uint8_t)
#define EIC_CTRL_SWRST	(1 << 0)
#define EIC_CTRL_ENABLE	(1 << 1)

#define EIC_CTRL_s    MMIO_REG(0x40001800, struct __struct_EIC_CTRL)
struct __struct_EIC_CTRL
{
  uint8_t swrst : 1;
  uint8_t enable : 1;
  uint8_t  : 6;
};

#define EIC_STATUS	MMIO_REG(0x40001801, uint8_t)
#define EIC_STATUS_SYNCBUSY	(1 << 7)

#define EIC_STATUS_s    MMIO_REG(0x40001801, struct __struct_EIC_STATUS)
struct __struct_EIC_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define EIC_NMICTRL	MMIO_REG(0x40001802, uint8_t)
#define EIC_NMICTRL_NMISENSE(x)	((x) << 0)
#define EIC_NMICTRL_NMISENSE_MSK	0x00000007
#define EIC_NMICTRL_NMISENSE_VAL(x)	(((x) >> 0) & 0x7)
#define EIC_NMICTRL_NMIFLTEN	(1 << 3)

#define EIC_NMICTRL_s    MMIO_REG(0x40001802, struct __struct_EIC_NMICTRL)
struct __struct_EIC_NMICTRL
{
  uint8_t nmisense : 3;
  uint8_t nmiflten : 1;
  uint8_t  : 4;
};

#define EIC_NMIFLAG	MMIO_REG(0x40001803, uint8_t)
#define EIC_NMIFLAG_NMI	(1 << 0)

#define EIC_NMIFLAG_s    MMIO_REG(0x40001803, struct __struct_EIC_NMIFLAG)
struct __struct_EIC_NMIFLAG
{
  uint8_t nmi : 1;
  uint8_t  : 7;
};

#define EIC_EVCTRL	MMIO_REG(0x40001804, uint32_t)
#define EIC_EVCTRL_EXTINTEO(x)	((x) << 0)
#define EIC_EVCTRL_EXTINTEO_MSK	0x0000ffff
#define EIC_EVCTRL_EXTINTEO_VAL(x)	(((x) >> 0) & 0xffff)

#define EIC_EVCTRL_s    MMIO_REG(0x40001804, struct __struct_EIC_EVCTRL)
struct __struct_EIC_EVCTRL
{
  uint32_t extinteo : 16;
  uint32_t  : 16;
};

#define EIC_INTENCLR	MMIO_REG(0x40001808, uint32_t)
#define EIC_INTENCLR_EXTINT(x)	((x) << 0)
#define EIC_INTENCLR_EXTINT_MSK	0x0000ffff
#define EIC_INTENCLR_EXTINT_VAL(x)	(((x) >> 0) & 0xffff)

#define EIC_INTENCLR_s    MMIO_REG(0x40001808, struct __struct_EIC_INTENCLR)
struct __struct_EIC_INTENCLR
{
  uint32_t extint : 16;
  uint32_t  : 16;
};

#define EIC_INTENSET	MMIO_REG(0x4000180c, uint32_t)
#define EIC_INTENSET_EXTINT(x)	((x) << 0)
#define EIC_INTENSET_EXTINT_MSK	0x0000ffff
#define EIC_INTENSET_EXTINT_VAL(x)	(((x) >> 0) & 0xffff)

#define EIC_INTENSET_s    MMIO_REG(0x4000180c, struct __struct_EIC_INTENSET)
struct __struct_EIC_INTENSET
{
  uint32_t extint : 16;
  uint32_t  : 16;
};

#define EIC_INTFLAG	MMIO_REG(0x40001810, uint32_t)
#define EIC_INTFLAG_EXTINT(x)	((x) << 0)
#define EIC_INTFLAG_EXTINT_MSK	0x0000ffff
#define EIC_INTFLAG_EXTINT_VAL(x)	(((x) >> 0) & 0xffff)

#define EIC_INTFLAG_s    MMIO_REG(0x40001810, struct __struct_EIC_INTFLAG)
struct __struct_EIC_INTFLAG
{
  uint32_t extint : 16;
  uint32_t  : 16;
};

#define EIC_WAKEUP	MMIO_REG(0x40001814, uint32_t)
#define EIC_WAKEUP_WAKEUPEN(x)	((x) << 0)
#define EIC_WAKEUP_WAKEUPEN_MSK	0x0000ffff
#define EIC_WAKEUP_WAKEUPEN_VAL(x)	(((x) >> 0) & 0xffff)

#define EIC_WAKEUP_s    MMIO_REG(0x40001814, struct __struct_EIC_WAKEUP)
struct __struct_EIC_WAKEUP
{
  uint32_t wakeupen : 16;
  uint32_t  : 16;
};

#define EIC_CONFIG0	MMIO_REG(0x40001818, uint32_t)
#define EIC_CONFIG0_SENSE0(x)	((x) << 0)
#define EIC_CONFIG0_SENSE0_MSK	0x00000007
#define EIC_CONFIG0_SENSE0_VAL(x)	(((x) >> 0) & 0x7)
#define EIC_CONFIG0_FILTEN0	(1 << 3)
#define EIC_CONFIG0_SENSE1(x)	((x) << 4)
#define EIC_CONFIG0_SENSE1_MSK	0x00000070
#define EIC_CONFIG0_SENSE1_VAL(x)	(((x) >> 4) & 0x7)
#define EIC_CONFIG0_FILTEN1	(1 << 7)
#define EIC_CONFIG0_SENSE2(x)	((x) << 8)
#define EIC_CONFIG0_SENSE2_MSK	0x00000700
#define EIC_CONFIG0_SENSE2_VAL(x)	(((x) >> 8) & 0x7)
#define EIC_CONFIG0_FILTEN2	(1 << 11)
#define EIC_CONFIG0_SENSE3(x)	((x) << 12)
#define EIC_CONFIG0_SENSE3_MSK	0x00007000
#define EIC_CONFIG0_SENSE3_VAL(x)	(((x) >> 12) & 0x7)
#define EIC_CONFIG0_FILTEN3	(1 << 15)
#define EIC_CONFIG0_SENSE4(x)	((x) << 16)
#define EIC_CONFIG0_SENSE4_MSK	0x00070000
#define EIC_CONFIG0_SENSE4_VAL(x)	(((x) >> 16) & 0x7)
#define EIC_CONFIG0_FILTEN4	(1 << 19)
#define EIC_CONFIG0_SENSE5(x)	((x) << 20)
#define EIC_CONFIG0_SENSE5_MSK	0x00700000
#define EIC_CONFIG0_SENSE5_VAL(x)	(((x) >> 20) & 0x7)
#define EIC_CONFIG0_FILTEN5	(1 << 23)
#define EIC_CONFIG0_SENSE6(x)	((x) << 24)
#define EIC_CONFIG0_SENSE6_MSK	0x07000000
#define EIC_CONFIG0_SENSE6_VAL(x)	(((x) >> 24) & 0x7)
#define EIC_CONFIG0_FILTEN6	(1 << 27)
#define EIC_CONFIG0_SENSE7(x)	((x) << 28)
#define EIC_CONFIG0_SENSE7_MSK	0x70000000
#define EIC_CONFIG0_SENSE7_VAL(x)	(((x) >> 28) & 0x7)
#define EIC_CONFIG0_FILTEN7	(1 << 31)

#define EIC_CONFIG0_s    MMIO_REG(0x40001818, struct __struct_EIC_CONFIG0)
struct __struct_EIC_CONFIG0
{
  uint32_t sense0 : 3;
  uint32_t filten0 : 1;
  uint32_t sense1 : 3;
  uint32_t filten1 : 1;
  uint32_t sense2 : 3;
  uint32_t filten2 : 1;
  uint32_t sense3 : 3;
  uint32_t filten3 : 1;
  uint32_t sense4 : 3;
  uint32_t filten4 : 1;
  uint32_t sense5 : 3;
  uint32_t filten5 : 1;
  uint32_t sense6 : 3;
  uint32_t filten6 : 1;
  uint32_t sense7 : 3;
  uint32_t filten7 : 1;
};

#define EIC_CONFIG1	MMIO_REG(0x4000181c, uint32_t)
#define EIC_CONFIG1_SENSE8(x)	((x) << 0)
#define EIC_CONFIG1_SENSE8_MSK	0x00000007
#define EIC_CONFIG1_SENSE8_VAL(x)	(((x) >> 0) & 0x7)
#define EIC_CONFIG1_FILTEN8	(1 << 3)
#define EIC_CONFIG1_SENSE9(x)	((x) << 4)
#define EIC_CONFIG1_SENSE9_MSK	0x00000070
#define EIC_CONFIG1_SENSE9_VAL(x)	(((x) >> 4) & 0x7)
#define EIC_CONFIG1_FILTEN9	(1 << 7)
#define EIC_CONFIG1_SENSE10(x)	((x) << 8)
#define EIC_CONFIG1_SENSE10_MSK	0x00000700
#define EIC_CONFIG1_SENSE10_VAL(x)	(((x) >> 8) & 0x7)
#define EIC_CONFIG1_FILTEN10	(1 << 11)
#define EIC_CONFIG1_SENSE11(x)	((x) << 12)
#define EIC_CONFIG1_SENSE11_MSK	0x00007000
#define EIC_CONFIG1_SENSE11_VAL(x)	(((x) >> 12) & 0x7)
#define EIC_CONFIG1_FILTEN11	(1 << 15)
#define EIC_CONFIG1_SENSE12(x)	((x) << 16)
#define EIC_CONFIG1_SENSE12_MSK	0x00070000
#define EIC_CONFIG1_SENSE12_VAL(x)	(((x) >> 16) & 0x7)
#define EIC_CONFIG1_FILTEN12	(1 << 19)
#define EIC_CONFIG1_SENSE13(x)	((x) << 20)
#define EIC_CONFIG1_SENSE13_MSK	0x00700000
#define EIC_CONFIG1_SENSE13_VAL(x)	(((x) >> 20) & 0x7)
#define EIC_CONFIG1_FILTEN13	(1 << 23)
#define EIC_CONFIG1_SENSE14(x)	((x) << 24)
#define EIC_CONFIG1_SENSE14_MSK	0x07000000
#define EIC_CONFIG1_SENSE14_VAL(x)	(((x) >> 24) & 0x7)
#define EIC_CONFIG1_FILTEN14	(1 << 27)
#define EIC_CONFIG1_SENSE15(x)	((x) << 28)
#define EIC_CONFIG1_SENSE15_MSK	0x70000000
#define EIC_CONFIG1_SENSE15_VAL(x)	(((x) >> 28) & 0x7)
#define EIC_CONFIG1_FILTEN15	(1 << 31)

