1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define PORTA_PINCFG9_s    MMIO_REG(0x41004449, struct __struct_PORTA_PINCFG9)
struct __struct_PORTA_PINCFG9
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG10	MMIO_REG(0x4100444a, uint8_t)
#define PORTA_PINCFG10_PMUXEN	(1 << 0)
#define PORTA_PINCFG10_INEN	(1 << 1)
#define PORTA_PINCFG10_PULLEN	(1 << 2)

#define PORTA_PINCFG10_s    MMIO_REG(0x4100444a, struct __struct_PORTA_PINCFG10)
struct __struct_PORTA_PINCFG10
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG11	MMIO_REG(0x4100444b, uint8_t)
#define PORTA_PINCFG11_PMUXEN	(1 << 0)
#define PORTA_PINCFG11_INEN	(1 << 1)
#define PORTA_PINCFG11_PULLEN	(1 << 2)

#define PORTA_PINCFG11_s    MMIO_REG(0x4100444b, struct __struct_PORTA_PINCFG11)
struct __struct_PORTA_PINCFG11
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG12	MMIO_REG(0x4100444c, uint8_t)
#define PORTA_PINCFG12_PMUXEN	(1 << 0)
#define PORTA_PINCFG12_INEN	(1 << 1)
#define PORTA_PINCFG12_PULLEN	(1 << 2)

#define PORTA_PINCFG12_s    MMIO_REG(0x4100444c, struct __struct_PORTA_PINCFG12)
struct __struct_PORTA_PINCFG12
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG13	MMIO_REG(0x4100444d, uint8_t)
#define PORTA_PINCFG13_PMUXEN	(1 << 0)
#define PORTA_PINCFG13_INEN	(1 << 1)
#define PORTA_PINCFG13_PULLEN	(1 << 2)

#define PORTA_PINCFG13_s    MMIO_REG(0x4100444d, struct __struct_PORTA_PINCFG13)
struct __struct_PORTA_PINCFG13
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG14	MMIO_REG(0x4100444e, uint8_t)
#define PORTA_PINCFG14_PMUXEN	(1 << 0)
#define PORTA_PINCFG14_INEN	(1 << 1)
#define PORTA_PINCFG14_PULLEN	(1 << 2)

#define PORTA_PINCFG14_s    MMIO_REG(0x4100444e, struct __struct_PORTA_PINCFG14)
struct __struct_PORTA_PINCFG14
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG15	MMIO_REG(0x4100444f, uint8_t)
#define PORTA_PINCFG15_PMUXEN	(1 << 0)
#define PORTA_PINCFG15_INEN	(1 << 1)
#define PORTA_PINCFG15_PULLEN	(1 << 2)

#define PORTA_PINCFG15_s    MMIO_REG(0x4100444f, struct __struct_PORTA_PINCFG15)
struct __struct_PORTA_PINCFG15
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG16	MMIO_REG(0x41004450, uint8_t)
#define PORTA_PINCFG16_PMUXEN	(1 << 0)
#define PORTA_PINCFG16_INEN	(1 << 1)
#define PORTA_PINCFG16_PULLEN	(1 << 2)

#define PORTA_PINCFG16_s    MMIO_REG(0x41004450, struct __struct_PORTA_PINCFG16)
struct __struct_PORTA_PINCFG16
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG17	MMIO_REG(0x41004451, uint8_t)
#define PORTA_PINCFG17_PMUXEN	(1 << 0)
#define PORTA_PINCFG17_INEN	(1 << 1)
#define PORTA_PINCFG17_PULLEN	(1 << 2)

#define PORTA_PINCFG17_s    MMIO_REG(0x41004451, struct __struct_PORTA_PINCFG17)
struct __struct_PORTA_PINCFG17
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG18	MMIO_REG(0x41004452, uint8_t)
#define PORTA_PINCFG18_PMUXEN	(1 << 0)
#define PORTA_PINCFG18_INEN	(1 << 1)
#define PORTA_PINCFG18_PULLEN	(1 << 2)

#define PORTA_PINCFG18_s    MMIO_REG(0x41004452, struct __struct_PORTA_PINCFG18)
struct __struct_PORTA_PINCFG18
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG19	MMIO_REG(0x41004453, uint8_t)
#define PORTA_PINCFG19_PMUXEN	(1 << 0)
#define PORTA_PINCFG19_INEN	(1 << 1)
#define PORTA_PINCFG19_PULLEN	(1 << 2)

#define PORTA_PINCFG19_s    MMIO_REG(0x41004453, struct __struct_PORTA_PINCFG19)
struct __struct_PORTA_PINCFG19
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG20	MMIO_REG(0x41004454, uint8_t)
#define PORTA_PINCFG20_PMUXEN	(1 << 0)
#define PORTA_PINCFG20_INEN	(1 << 1)
#define PORTA_PINCFG20_PULLEN	(1 << 2)

#define PORTA_PINCFG20_s    MMIO_REG(0x41004454, struct __struct_PORTA_PINCFG20)
struct __struct_PORTA_PINCFG20
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG21	MMIO_REG(0x41004455, uint8_t)
#define PORTA_PINCFG21_PMUXEN	(1 << 0)
#define PORTA_PINCFG21_INEN	(1 << 1)
#define PORTA_PINCFG21_PULLEN	(1 << 2)

#define PORTA_PINCFG21_s    MMIO_REG(0x41004455, struct __struct_PORTA_PINCFG21)
struct __struct_PORTA_PINCFG21
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG22	MMIO_REG(0x41004456, uint8_t)
#define PORTA_PINCFG22_PMUXEN	(1 << 0)
#define PORTA_PINCFG22_INEN	(1 << 1)
#define PORTA_PINCFG22_PULLEN	(1 << 2)

#define PORTA_PINCFG22_s    MMIO_REG(0x41004456, struct __struct_PORTA_PINCFG22)
struct __struct_PORTA_PINCFG22
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG23	MMIO_REG(0x41004457, uint8_t)
#define PORTA_PINCFG23_PMUXEN	(1 << 0)
#define PORTA_PINCFG23_INEN	(1 << 1)
#define PORTA_PINCFG23_PULLEN	(1 << 2)

#define PORTA_PINCFG23_s    MMIO_REG(0x41004457, struct __struct_PORTA_PINCFG23)
struct __struct_PORTA_PINCFG23
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG24	MMIO_REG(0x41004458, uint8_t)
#define PORTA_PINCFG24_PMUXEN	(1 << 0)
#define PORTA_PINCFG24_INEN	(1 << 1)
#define PORTA_PINCFG24_PULLEN	(1 << 2)

#define PORTA_PINCFG24_s    MMIO_REG(0x41004458, struct __struct_PORTA_PINCFG24)
struct __struct_PORTA_PINCFG24
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG25	MMIO_REG(0x41004459, uint8_t)
#define PORTA_PINCFG25_PMUXEN	(1 << 0)
#define PORTA_PINCFG25_INEN	(1 << 1)
#define PORTA_PINCFG25_PULLEN	(1 << 2)

#define PORTA_PINCFG25_s    MMIO_REG(0x41004459, struct __struct_PORTA_PINCFG25)
struct __struct_PORTA_PINCFG25
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG26	MMIO_REG(0x4100445a, uint8_t)
#define PORTA_PINCFG26_PMUXEN	(1 << 0)
#define PORTA_PINCFG26_INEN	(1 << 1)
#define PORTA_PINCFG26_PULLEN	(1 << 2)

