1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define PORTA_PINCFG26_s    MMIO_REG(0x4100445a, struct __struct_PORTA_PINCFG26)
struct __struct_PORTA_PINCFG26
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG27	MMIO_REG(0x4100445b, uint8_t)
#define PORTA_PINCFG27_PMUXEN	(1 << 0)
#define PORTA_PINCFG27_INEN	(1 << 1)
#define PORTA_PINCFG27_PULLEN	(1 << 2)

#define PORTA_PINCFG27_s    MMIO_REG(0x4100445b, struct __struct_PORTA_PINCFG27)
struct __struct_PORTA_PINCFG27
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG28	MMIO_REG(0x4100445c, uint8_t)
#define PORTA_PINCFG28_PMUXEN	(1 << 0)
#define PORTA_PINCFG28_INEN	(1 << 1)
#define PORTA_PINCFG28_PULLEN	(1 << 2)

#define PORTA_PINCFG28_s    MMIO_REG(0x4100445c, struct __struct_PORTA_PINCFG28)
struct __struct_PORTA_PINCFG28
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG29	MMIO_REG(0x4100445d, uint8_t)
#define PORTA_PINCFG29_PMUXEN	(1 << 0)
#define PORTA_PINCFG29_INEN	(1 << 1)
#define PORTA_PINCFG29_PULLEN	(1 << 2)

#define PORTA_PINCFG29_s    MMIO_REG(0x4100445d, struct __struct_PORTA_PINCFG29)
struct __struct_PORTA_PINCFG29
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG30	MMIO_REG(0x4100445e, uint8_t)
#define PORTA_PINCFG30_PMUXEN	(1 << 0)
#define PORTA_PINCFG30_INEN	(1 << 1)
#define PORTA_PINCFG30_PULLEN	(1 << 2)

#define PORTA_PINCFG30_s    MMIO_REG(0x4100445e, struct __struct_PORTA_PINCFG30)
struct __struct_PORTA_PINCFG30
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG31	MMIO_REG(0x4100445f, uint8_t)
#define PORTA_PINCFG31_PMUXEN	(1 << 0)
#define PORTA_PINCFG31_INEN	(1 << 1)
#define PORTA_PINCFG31_PULLEN	(1 << 2)

#define PORTA_PINCFG31_s    MMIO_REG(0x4100445f, struct __struct_PORTA_PINCFG31)
struct __struct_PORTA_PINCFG31
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

// 0x41004480 PORTB

#define PORTB_DIR	MMIO_REG(0x41004480, uint32_t)
#define PORTB_DIR_P0	(1 << 0)
#define PORTB_DIR_P1	(1 << 1)
#define PORTB_DIR_P2	(1 << 2)
#define PORTB_DIR_P3	(1 << 3)
#define PORTB_DIR_P4	(1 << 4)
#define PORTB_DIR_P5	(1 << 5)
#define PORTB_DIR_P6	(1 << 6)
#define PORTB_DIR_P7	(1 << 7)
#define PORTB_DIR_P8	(1 << 8)
#define PORTB_DIR_P9	(1 << 9)
#define PORTB_DIR_P10	(1 << 10)
#define PORTB_DIR_P11	(1 << 11)
#define PORTB_DIR_P12	(1 << 12)
#define PORTB_DIR_P13	(1 << 13)
#define PORTB_DIR_P14	(1 << 14)
#define PORTB_DIR_P15	(1 << 15)
#define PORTB_DIR_P16	(1 << 16)
#define PORTB_DIR_P17	(1 << 17)
#define PORTB_DIR_P18	(1 << 18)
#define PORTB_DIR_P19	(1 << 19)
#define PORTB_DIR_P20	(1 << 20)
#define PORTB_DIR_P21	(1 << 21)
#define PORTB_DIR_P22	(1 << 22)
#define PORTB_DIR_P23	(1 << 23)
#define PORTB_DIR_P24	(1 << 24)
#define PORTB_DIR_P25	(1 << 25)
#define PORTB_DIR_P26	(1 << 26)
#define PORTB_DIR_P27	(1 << 27)
#define PORTB_DIR_P28	(1 << 28)
#define PORTB_DIR_P29	(1 << 29)
#define PORTB_DIR_P30	(1 << 30)
#define PORTB_DIR_P31	(1 << 31)

#define PORTB_DIR_s    MMIO_REG(0x41004480, struct __struct_PORTB_DIR)
struct __struct_PORTB_DIR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_DIRCLR	MMIO_REG(0x41004484, uint32_t)
#define PORTB_DIRCLR_P0	(1 << 0)
#define PORTB_DIRCLR_P1	(1 << 1)
#define PORTB_DIRCLR_P2	(1 << 2)
#define PORTB_DIRCLR_P3	(1 << 3)
#define PORTB_DIRCLR_P4	(1 << 4)
#define PORTB_DIRCLR_P5	(1 << 5)
#define PORTB_DIRCLR_P6	(1 << 6)
#define PORTB_DIRCLR_P7	(1 << 7)
#define PORTB_DIRCLR_P8	(1 << 8)
#define PORTB_DIRCLR_P9	(1 << 9)
#define PORTB_DIRCLR_P10	(1 << 10)
#define PORTB_DIRCLR_P11	(1 << 11)
#define PORTB_DIRCLR_P12	(1 << 12)
#define PORTB_DIRCLR_P13	(1 << 13)
#define PORTB_DIRCLR_P14	(1 << 14)
#define PORTB_DIRCLR_P15	(1 << 15)
#define PORTB_DIRCLR_P16	(1 << 16)
#define PORTB_DIRCLR_P17	(1 << 17)
#define PORTB_DIRCLR_P18	(1 << 18)
#define PORTB_DIRCLR_P19	(1 << 19)
#define PORTB_DIRCLR_P20	(1 << 20)
#define PORTB_DIRCLR_P21	(1 << 21)
#define PORTB_DIRCLR_P22	(1 << 22)
#define PORTB_DIRCLR_P23	(1 << 23)
#define PORTB_DIRCLR_P24	(1 << 24)
#define PORTB_DIRCLR_P25	(1 << 25)
#define PORTB_DIRCLR_P26	(1 << 26)
#define PORTB_DIRCLR_P27	(1 << 27)
#define PORTB_DIRCLR_P28	(1 << 28)
#define PORTB_DIRCLR_P29	(1 << 29)
#define PORTB_DIRCLR_P30	(1 << 30)
#define PORTB_DIRCLR_P31	(1 << 31)

#define PORTB_DIRCLR_s    MMIO_REG(0x41004484, struct __struct_PORTB_DIRCLR)
struct __struct_PORTB_DIRCLR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_DIRSET	MMIO_REG(0x41004488, uint32_t)
#define PORTB_DIRSET_P0	(1 << 0)
#define PORTB_DIRSET_P1	(1 << 1)
#define PORTB_DIRSET_P2	(1 << 2)
#define PORTB_DIRSET_P3	(1 << 3)
#define PORTB_DIRSET_P4	(1 << 4)
#define PORTB_DIRSET_P5	(1 << 5)
#define PORTB_DIRSET_P6	(1 << 6)
#define PORTB_DIRSET_P7	(1 << 7)
#define PORTB_DIRSET_P8	(1 << 8)
#define PORTB_DIRSET_P9	(1 << 9)
#define PORTB_DIRSET_P10	(1 << 10)
#define PORTB_DIRSET_P11	(1 << 11)
#define PORTB_DIRSET_P12	(1 << 12)
#define PORTB_DIRSET_P13	(1 << 13)
#define PORTB_DIRSET_P14	(1 << 14)
#define PORTB_DIRSET_P15	(1 << 15)
#define PORTB_DIRSET_P16	(1 << 16)
#define PORTB_DIRSET_P17	(1 << 17)
#define PORTB_DIRSET_P18	(1 << 18)
#define PORTB_DIRSET_P19	(1 << 19)
#define PORTB_DIRSET_P20	(1 << 20)
#define PORTB_DIRSET_P21	(1 << 21)
#define PORTB_DIRSET_P22	(1 << 22)
#define PORTB_DIRSET_P23	(1 << 23)
#define PORTB_DIRSET_P24	(1 << 24)
#define PORTB_DIRSET_P25	(1 << 25)
#define PORTB_DIRSET_P26	(1 << 26)
#define PORTB_DIRSET_P27	(1 << 27)
#define PORTB_DIRSET_P28	(1 << 28)
#define PORTB_DIRSET_P29	(1 << 29)
#define PORTB_DIRSET_P30	(1 << 30)
#define PORTB_DIRSET_P31	(1 << 31)

