1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define PORTB_OUTTGL	MMIO_REG(0x4100449c, uint32_t)
#define PORTB_OUTTGL_P0	(1 << 0)
#define PORTB_OUTTGL_P1	(1 << 1)
#define PORTB_OUTTGL_P2	(1 << 2)
#define PORTB_OUTTGL_P3	(1 << 3)
#define PORTB_OUTTGL_P4	(1 << 4)
#define PORTB_OUTTGL_P5	(1 << 5)
#define PORTB_OUTTGL_P6	(1 << 6)
#define PORTB_OUTTGL_P7	(1 << 7)
#define PORTB_OUTTGL_P8	(1 << 8)
#define PORTB_OUTTGL_P9	(1 << 9)
#define PORTB_OUTTGL_P10	(1 << 10)
#define PORTB_OUTTGL_P11	(1 << 11)
#define PORTB_OUTTGL_P12	(1 << 12)
#define PORTB_OUTTGL_P13	(1 << 13)
#define PORTB_OUTTGL_P14	(1 << 14)
#define PORTB_OUTTGL_P15	(1 << 15)
#define PORTB_OUTTGL_P16	(1 << 16)
#define PORTB_OUTTGL_P17	(1 << 17)
#define PORTB_OUTTGL_P18	(1 << 18)
#define PORTB_OUTTGL_P19	(1 << 19)
#define PORTB_OUTTGL_P20	(1 << 20)
#define PORTB_OUTTGL_P21	(1 << 21)
#define PORTB_OUTTGL_P22	(1 << 22)
#define PORTB_OUTTGL_P23	(1 << 23)
#define PORTB_OUTTGL_P24	(1 << 24)
#define PORTB_OUTTGL_P25	(1 << 25)
#define PORTB_OUTTGL_P26	(1 << 26)
#define PORTB_OUTTGL_P27	(1 << 27)
#define PORTB_OUTTGL_P28	(1 << 28)
#define PORTB_OUTTGL_P29	(1 << 29)
#define PORTB_OUTTGL_P30	(1 << 30)
#define PORTB_OUTTGL_P31	(1 << 31)

#define PORTB_OUTTGL_s    MMIO_REG(0x4100449c, struct __struct_PORTB_OUTTGL)
struct __struct_PORTB_OUTTGL
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_IN	MMIO_REG(0x410044a0, uint32_t)
#define PORTB_IN_P0	(1 << 0)
#define PORTB_IN_P1	(1 << 1)
#define PORTB_IN_P2	(1 << 2)
#define PORTB_IN_P3	(1 << 3)
#define PORTB_IN_P4	(1 << 4)
#define PORTB_IN_P5	(1 << 5)
#define PORTB_IN_P6	(1 << 6)
#define PORTB_IN_P7	(1 << 7)
#define PORTB_IN_P8	(1 << 8)
#define PORTB_IN_P9	(1 << 9)
#define PORTB_IN_P10	(1 << 10)
#define PORTB_IN_P11	(1 << 11)
#define PORTB_IN_P12	(1 << 12)
#define PORTB_IN_P13	(1 << 13)
#define PORTB_IN_P14	(1 << 14)
#define PORTB_IN_P15	(1 << 15)
#define PORTB_IN_P16	(1 << 16)
#define PORTB_IN_P17	(1 << 17)
#define PORTB_IN_P18	(1 << 18)
#define PORTB_IN_P19	(1 << 19)
#define PORTB_IN_P20	(1 << 20)
#define PORTB_IN_P21	(1 << 21)
#define PORTB_IN_P22	(1 << 22)
#define PORTB_IN_P23	(1 << 23)
#define PORTB_IN_P24	(1 << 24)
#define PORTB_IN_P25	(1 << 25)
#define PORTB_IN_P26	(1 << 26)
#define PORTB_IN_P27	(1 << 27)
#define PORTB_IN_P28	(1 << 28)
#define PORTB_IN_P29	(1 << 29)
#define PORTB_IN_P30	(1 << 30)
#define PORTB_IN_P31	(1 << 31)

#define PORTB_IN_s    MMIO_REG(0x410044a0, struct __struct_PORTB_IN)
struct __struct_PORTB_IN
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_CTRL	MMIO_REG(0x410044a4, uint32_t)

#define PORTB_WRCONFIG	MMIO_REG(0x410044a8, uint32_t)
#define PORTB_WRCONFIG_PINMASK(x)	((x) << 0)
#define PORTB_WRCONFIG_PINMASK_MSK	0x0000ffff
#define PORTB_WRCONFIG_PINMASK_VAL(x)	(((x) >> 0) & 0xffff)
#define PORTB_WRCONFIG_PMUXEN	(1 << 16)
#define PORTB_WRCONFIG_INEN	(1 << 17)
#define PORTB_WRCONFIG_PULLEN	(1 << 18)
#define PORTB_WRCONFIG_PMUX(x)	((x) << 24)
#define PORTB_WRCONFIG_PMUX_MSK	0x0f000000
#define PORTB_WRCONFIG_PMUX_VAL(x)	(((x) >> 24) & 0xf)
#define PORTB_WRCONFIG_WRPMUX	(1 << 28)
#define PORTB_WRCONFIG_WRPINCFG	(1 << 30)
#define PORTB_WRCONFIG_HWSEL	(1 << 31)

#define PORTB_WRCONFIG_s    MMIO_REG(0x410044a8, struct __struct_PORTB_WRCONFIG)
struct __struct_PORTB_WRCONFIG
{
  uint32_t pinmask : 16;
  uint32_t pmuxen : 1;
  uint32_t inen : 1;
  uint32_t pullen : 1;
  uint32_t  : 5;
  uint32_t pmux : 4;
  uint32_t wrpmux : 1;
  uint32_t  : 1;
  uint32_t wrpincfg : 1;
  uint32_t hwsel : 1;
};

#define PORTB_PMUX0	MMIO_REG(0x410044b0, uint8_t)
#define PORTB_PMUX0_PMUXE(x)	((x) << 0)
#define PORTB_PMUX0_PMUXE_MSK	0x0000000f
#define PORTB_PMUX0_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX0_PMUXO(x)	((x) << 4)
#define PORTB_PMUX0_PMUXO_MSK	0x000000f0
#define PORTB_PMUX0_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX0_s    MMIO_REG(0x410044b0, struct __struct_PORTB_PMUX0)
struct __struct_PORTB_PMUX0
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX1	MMIO_REG(0x410044b1, uint8_t)
#define PORTB_PMUX1_PMUXE(x)	((x) << 0)
#define PORTB_PMUX1_PMUXE_MSK	0x0000000f
#define PORTB_PMUX1_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX1_PMUXO(x)	((x) << 4)
#define PORTB_PMUX1_PMUXO_MSK	0x000000f0
#define PORTB_PMUX1_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX1_s    MMIO_REG(0x410044b1, struct __struct_PORTB_PMUX1)
struct __struct_PORTB_PMUX1
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX2	MMIO_REG(0x410044b2, uint8_t)
#define PORTB_PMUX2_PMUXE(x)	((x) << 0)
#define PORTB_PMUX2_PMUXE_MSK	0x0000000f
#define PORTB_PMUX2_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX2_PMUXO(x)	((x) << 4)
#define PORTB_PMUX2_PMUXO_MSK	0x000000f0
#define PORTB_PMUX2_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX2_s    MMIO_REG(0x410044b2, struct __struct_PORTB_PMUX2)
struct __struct_PORTB_PMUX2
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX3	MMIO_REG(0x410044b3, uint8_t)
#define PORTB_PMUX3_PMUXE(x)	((x) << 0)
#define PORTB_PMUX3_PMUXE_MSK	0x0000000f
#define PORTB_PMUX3_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX3_PMUXO(x)	((x) << 4)
#define PORTB_PMUX3_PMUXO_MSK	0x000000f0
#define PORTB_PMUX3_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX3_s    MMIO_REG(0x410044b3, struct __struct_PORTB_PMUX3)
struct __struct_PORTB_PMUX3
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX4	MMIO_REG(0x410044b4, uint8_t)
#define PORTB_PMUX4_PMUXE(x)	((x) << 0)
#define PORTB_PMUX4_PMUXE_MSK	0x0000000f
#define PORTB_PMUX4_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX4_PMUXO(x)	((x) << 4)
#define PORTB_PMUX4_PMUXO_MSK	0x000000f0
#define PORTB_PMUX4_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX4_s    MMIO_REG(0x410044b4, struct __struct_PORTB_PMUX4)
struct __struct_PORTB_PMUX4
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX5	MMIO_REG(0x410044b5, uint8_t)
#define PORTB_PMUX5_PMUXE(x)	((x) << 0)
#define PORTB_PMUX5_PMUXE_MSK	0x0000000f
#define PORTB_PMUX5_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX5_PMUXO(x)	((x) << 4)
#define PORTB_PMUX5_PMUXO_MSK	0x000000f0
#define PORTB_PMUX5_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

