1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define PORTB_PMUX5_s    MMIO_REG(0x410044b5, struct __struct_PORTB_PMUX5)
struct __struct_PORTB_PMUX5
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX6	MMIO_REG(0x410044b6, uint8_t)
#define PORTB_PMUX6_PMUXE(x)	((x) << 0)
#define PORTB_PMUX6_PMUXE_MSK	0x0000000f
#define PORTB_PMUX6_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX6_PMUXO(x)	((x) << 4)
#define PORTB_PMUX6_PMUXO_MSK	0x000000f0
#define PORTB_PMUX6_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX6_s    MMIO_REG(0x410044b6, struct __struct_PORTB_PMUX6)
struct __struct_PORTB_PMUX6
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX7	MMIO_REG(0x410044b7, uint8_t)
#define PORTB_PMUX7_PMUXE(x)	((x) << 0)
#define PORTB_PMUX7_PMUXE_MSK	0x0000000f
#define PORTB_PMUX7_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX7_PMUXO(x)	((x) << 4)
#define PORTB_PMUX7_PMUXO_MSK	0x000000f0
#define PORTB_PMUX7_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX7_s    MMIO_REG(0x410044b7, struct __struct_PORTB_PMUX7)
struct __struct_PORTB_PMUX7
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX8	MMIO_REG(0x410044b8, uint8_t)
#define PORTB_PMUX8_PMUXE(x)	((x) << 0)
#define PORTB_PMUX8_PMUXE_MSK	0x0000000f
#define PORTB_PMUX8_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX8_PMUXO(x)	((x) << 4)
#define PORTB_PMUX8_PMUXO_MSK	0x000000f0
#define PORTB_PMUX8_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX8_s    MMIO_REG(0x410044b8, struct __struct_PORTB_PMUX8)
struct __struct_PORTB_PMUX8
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX9	MMIO_REG(0x410044b9, uint8_t)
#define PORTB_PMUX9_PMUXE(x)	((x) << 0)
#define PORTB_PMUX9_PMUXE_MSK	0x0000000f
#define PORTB_PMUX9_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX9_PMUXO(x)	((x) << 4)
#define PORTB_PMUX9_PMUXO_MSK	0x000000f0
#define PORTB_PMUX9_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX9_s    MMIO_REG(0x410044b9, struct __struct_PORTB_PMUX9)
struct __struct_PORTB_PMUX9
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX10	MMIO_REG(0x410044ba, uint8_t)
#define PORTB_PMUX10_PMUXE(x)	((x) << 0)
#define PORTB_PMUX10_PMUXE_MSK	0x0000000f
#define PORTB_PMUX10_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX10_PMUXO(x)	((x) << 4)
#define PORTB_PMUX10_PMUXO_MSK	0x000000f0
#define PORTB_PMUX10_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX10_s    MMIO_REG(0x410044ba, struct __struct_PORTB_PMUX10)
struct __struct_PORTB_PMUX10
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX11	MMIO_REG(0x410044bb, uint8_t)
#define PORTB_PMUX11_PMUXE(x)	((x) << 0)
#define PORTB_PMUX11_PMUXE_MSK	0x0000000f
#define PORTB_PMUX11_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX11_PMUXO(x)	((x) << 4)
#define PORTB_PMUX11_PMUXO_MSK	0x000000f0
#define PORTB_PMUX11_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX11_s    MMIO_REG(0x410044bb, struct __struct_PORTB_PMUX11)
struct __struct_PORTB_PMUX11
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX12	MMIO_REG(0x410044bc, uint8_t)
#define PORTB_PMUX12_PMUXE(x)	((x) << 0)
#define PORTB_PMUX12_PMUXE_MSK	0x0000000f
#define PORTB_PMUX12_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX12_PMUXO(x)	((x) << 4)
#define PORTB_PMUX12_PMUXO_MSK	0x000000f0
#define PORTB_PMUX12_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX12_s    MMIO_REG(0x410044bc, struct __struct_PORTB_PMUX12)
struct __struct_PORTB_PMUX12
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX13	MMIO_REG(0x410044bd, uint8_t)
#define PORTB_PMUX13_PMUXE(x)	((x) << 0)
#define PORTB_PMUX13_PMUXE_MSK	0x0000000f
#define PORTB_PMUX13_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX13_PMUXO(x)	((x) << 4)
#define PORTB_PMUX13_PMUXO_MSK	0x000000f0
#define PORTB_PMUX13_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX13_s    MMIO_REG(0x410044bd, struct __struct_PORTB_PMUX13)
struct __struct_PORTB_PMUX13
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX14	MMIO_REG(0x410044be, uint8_t)
#define PORTB_PMUX14_PMUXE(x)	((x) << 0)
#define PORTB_PMUX14_PMUXE_MSK	0x0000000f
#define PORTB_PMUX14_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX14_PMUXO(x)	((x) << 4)
#define PORTB_PMUX14_PMUXO_MSK	0x000000f0
#define PORTB_PMUX14_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX14_s    MMIO_REG(0x410044be, struct __struct_PORTB_PMUX14)
struct __struct_PORTB_PMUX14
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX15	MMIO_REG(0x410044bf, uint8_t)
#define PORTB_PMUX15_PMUXE(x)	((x) << 0)
#define PORTB_PMUX15_PMUXE_MSK	0x0000000f
#define PORTB_PMUX15_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX15_PMUXO(x)	((x) << 4)
#define PORTB_PMUX15_PMUXO_MSK	0x000000f0
#define PORTB_PMUX15_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX15_s    MMIO_REG(0x410044bf, struct __struct_PORTB_PMUX15)
struct __struct_PORTB_PMUX15
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PINCFG0	MMIO_REG(0x410044c0, uint8_t)
#define PORTB_PINCFG0_PMUXEN	(1 << 0)
#define PORTB_PINCFG0_INEN	(1 << 1)
#define PORTB_PINCFG0_PULLEN	(1 << 2)

#define PORTB_PINCFG0_s    MMIO_REG(0x410044c0, struct __struct_PORTB_PINCFG0)
struct __struct_PORTB_PINCFG0
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG1	MMIO_REG(0x410044c1, uint8_t)
#define PORTB_PINCFG1_PMUXEN	(1 << 0)
#define PORTB_PINCFG1_INEN	(1 << 1)
#define PORTB_PINCFG1_PULLEN	(1 << 2)

#define PORTB_PINCFG1_s    MMIO_REG(0x410044c1, struct __struct_PORTB_PINCFG1)
struct __struct_PORTB_PINCFG1
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG2	MMIO_REG(0x410044c2, uint8_t)
#define PORTB_PINCFG2_PMUXEN	(1 << 0)
#define PORTB_PINCFG2_INEN	(1 << 1)
#define PORTB_PINCFG2_PULLEN	(1 << 2)

#define PORTB_PINCFG2_s    MMIO_REG(0x410044c2, struct __struct_PORTB_PINCFG2)
struct __struct_PORTB_PINCFG2
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG3	MMIO_REG(0x410044c3, uint8_t)
#define PORTB_PINCFG3_PMUXEN	(1 << 0)
#define PORTB_PINCFG3_INEN	(1 << 1)
#define PORTB_PINCFG3_PULLEN	(1 << 2)

#define PORTB_PINCFG3_s    MMIO_REG(0x410044c3, struct __struct_PORTB_PINCFG3)
struct __struct_PORTB_PINCFG3
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG4	MMIO_REG(0x410044c4, uint8_t)
#define PORTB_PINCFG4_PMUXEN	(1 << 0)
#define PORTB_PINCFG4_INEN	(1 << 1)
#define PORTB_PINCFG4_PULLEN	(1 << 2)

#define PORTB_PINCFG4_s    MMIO_REG(0x410044c4, struct __struct_PORTB_PINCFG4)
struct __struct_PORTB_PINCFG4
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG5	MMIO_REG(0x410044c5, uint8_t)
#define PORTB_PINCFG5_PMUXEN	(1 << 0)
#define PORTB_PINCFG5_INEN	(1 << 1)
#define PORTB_PINCFG5_PULLEN	(1 << 2)

