1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define PORTB_PINCFG5_s    MMIO_REG(0x410044c5, struct __struct_PORTB_PINCFG5)
struct __struct_PORTB_PINCFG5
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG6	MMIO_REG(0x410044c6, uint8_t)
#define PORTB_PINCFG6_PMUXEN	(1 << 0)
#define PORTB_PINCFG6_INEN	(1 << 1)
#define PORTB_PINCFG6_PULLEN	(1 << 2)

#define PORTB_PINCFG6_s    MMIO_REG(0x410044c6, struct __struct_PORTB_PINCFG6)
struct __struct_PORTB_PINCFG6
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG7	MMIO_REG(0x410044c7, uint8_t)
#define PORTB_PINCFG7_PMUXEN	(1 << 0)
#define PORTB_PINCFG7_INEN	(1 << 1)
#define PORTB_PINCFG7_PULLEN	(1 << 2)

#define PORTB_PINCFG7_s    MMIO_REG(0x410044c7, struct __struct_PORTB_PINCFG7)
struct __struct_PORTB_PINCFG7
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG8	MMIO_REG(0x410044c8, uint8_t)
#define PORTB_PINCFG8_PMUXEN	(1 << 0)
#define PORTB_PINCFG8_INEN	(1 << 1)
#define PORTB_PINCFG8_PULLEN	(1 << 2)

#define PORTB_PINCFG8_s    MMIO_REG(0x410044c8, struct __struct_PORTB_PINCFG8)
struct __struct_PORTB_PINCFG8
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG9	MMIO_REG(0x410044c9, uint8_t)
#define PORTB_PINCFG9_PMUXEN	(1 << 0)
#define PORTB_PINCFG9_INEN	(1 << 1)
#define PORTB_PINCFG9_PULLEN	(1 << 2)

#define PORTB_PINCFG9_s    MMIO_REG(0x410044c9, struct __struct_PORTB_PINCFG9)
struct __struct_PORTB_PINCFG9
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG10	MMIO_REG(0x410044ca, uint8_t)
#define PORTB_PINCFG10_PMUXEN	(1 << 0)
#define PORTB_PINCFG10_INEN	(1 << 1)
#define PORTB_PINCFG10_PULLEN	(1 << 2)

#define PORTB_PINCFG10_s    MMIO_REG(0x410044ca, struct __struct_PORTB_PINCFG10)
struct __struct_PORTB_PINCFG10
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG11	MMIO_REG(0x410044cb, uint8_t)
#define PORTB_PINCFG11_PMUXEN	(1 << 0)
#define PORTB_PINCFG11_INEN	(1 << 1)
#define PORTB_PINCFG11_PULLEN	(1 << 2)

#define PORTB_PINCFG11_s    MMIO_REG(0x410044cb, struct __struct_PORTB_PINCFG11)
struct __struct_PORTB_PINCFG11
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG12	MMIO_REG(0x410044cc, uint8_t)
#define PORTB_PINCFG12_PMUXEN	(1 << 0)
#define PORTB_PINCFG12_INEN	(1 << 1)
#define PORTB_PINCFG12_PULLEN	(1 << 2)

#define PORTB_PINCFG12_s    MMIO_REG(0x410044cc, struct __struct_PORTB_PINCFG12)
struct __struct_PORTB_PINCFG12
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG13	MMIO_REG(0x410044cd, uint8_t)
#define PORTB_PINCFG13_PMUXEN	(1 << 0)
#define PORTB_PINCFG13_INEN	(1 << 1)
#define PORTB_PINCFG13_PULLEN	(1 << 2)

#define PORTB_PINCFG13_s    MMIO_REG(0x410044cd, struct __struct_PORTB_PINCFG13)
struct __struct_PORTB_PINCFG13
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG14	MMIO_REG(0x410044ce, uint8_t)
#define PORTB_PINCFG14_PMUXEN	(1 << 0)
#define PORTB_PINCFG14_INEN	(1 << 1)
#define PORTB_PINCFG14_PULLEN	(1 << 2)

#define PORTB_PINCFG14_s    MMIO_REG(0x410044ce, struct __struct_PORTB_PINCFG14)
struct __struct_PORTB_PINCFG14
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG15	MMIO_REG(0x410044cf, uint8_t)
#define PORTB_PINCFG15_PMUXEN	(1 << 0)
#define PORTB_PINCFG15_INEN	(1 << 1)
#define PORTB_PINCFG15_PULLEN	(1 << 2)

#define PORTB_PINCFG15_s    MMIO_REG(0x410044cf, struct __struct_PORTB_PINCFG15)
struct __struct_PORTB_PINCFG15
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG16	MMIO_REG(0x410044d0, uint8_t)
#define PORTB_PINCFG16_PMUXEN	(1 << 0)
#define PORTB_PINCFG16_INEN	(1 << 1)
#define PORTB_PINCFG16_PULLEN	(1 << 2)

#define PORTB_PINCFG16_s    MMIO_REG(0x410044d0, struct __struct_PORTB_PINCFG16)
struct __struct_PORTB_PINCFG16
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG17	MMIO_REG(0x410044d1, uint8_t)
#define PORTB_PINCFG17_PMUXEN	(1 << 0)
#define PORTB_PINCFG17_INEN	(1 << 1)
#define PORTB_PINCFG17_PULLEN	(1 << 2)

#define PORTB_PINCFG17_s    MMIO_REG(0x410044d1, struct __struct_PORTB_PINCFG17)
struct __struct_PORTB_PINCFG17
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG18	MMIO_REG(0x410044d2, uint8_t)
#define PORTB_PINCFG18_PMUXEN	(1 << 0)
#define PORTB_PINCFG18_INEN	(1 << 1)
#define PORTB_PINCFG18_PULLEN	(1 << 2)

#define PORTB_PINCFG18_s    MMIO_REG(0x410044d2, struct __struct_PORTB_PINCFG18)
struct __struct_PORTB_PINCFG18
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG19	MMIO_REG(0x410044d3, uint8_t)
#define PORTB_PINCFG19_PMUXEN	(1 << 0)
#define PORTB_PINCFG19_INEN	(1 << 1)
#define PORTB_PINCFG19_PULLEN	(1 << 2)

#define PORTB_PINCFG19_s    MMIO_REG(0x410044d3, struct __struct_PORTB_PINCFG19)
struct __struct_PORTB_PINCFG19
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG20	MMIO_REG(0x410044d4, uint8_t)
#define PORTB_PINCFG20_PMUXEN	(1 << 0)
#define PORTB_PINCFG20_INEN	(1 << 1)
#define PORTB_PINCFG20_PULLEN	(1 << 2)

#define PORTB_PINCFG20_s    MMIO_REG(0x410044d4, struct __struct_PORTB_PINCFG20)
struct __struct_PORTB_PINCFG20
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG21	MMIO_REG(0x410044d5, uint8_t)
#define PORTB_PINCFG21_PMUXEN	(1 << 0)
#define PORTB_PINCFG21_INEN	(1 << 1)
#define PORTB_PINCFG21_PULLEN	(1 << 2)

#define PORTB_PINCFG21_s    MMIO_REG(0x410044d5, struct __struct_PORTB_PINCFG21)
struct __struct_PORTB_PINCFG21
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG22	MMIO_REG(0x410044d6, uint8_t)
#define PORTB_PINCFG22_PMUXEN	(1 << 0)
#define PORTB_PINCFG22_INEN	(1 << 1)
#define PORTB_PINCFG22_PULLEN	(1 << 2)

#define PORTB_PINCFG22_s    MMIO_REG(0x410044d6, struct __struct_PORTB_PINCFG22)
struct __struct_PORTB_PINCFG22
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG23	MMIO_REG(0x410044d7, uint8_t)
#define PORTB_PINCFG23_PMUXEN	(1 << 0)
#define PORTB_PINCFG23_INEN	(1 << 1)
#define PORTB_PINCFG23_PULLEN	(1 << 2)

#define PORTB_PINCFG23_s    MMIO_REG(0x410044d7, struct __struct_PORTB_PINCFG23)
struct __struct_PORTB_PINCFG23
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG24	MMIO_REG(0x410044d8, uint8_t)
#define PORTB_PINCFG24_PMUXEN	(1 << 0)
#define PORTB_PINCFG24_INEN	(1 << 1)
#define PORTB_PINCFG24_PULLEN	(1 << 2)

#define PORTB_PINCFG24_s    MMIO_REG(0x410044d8, struct __struct_PORTB_PINCFG24)
struct __struct_PORTB_PINCFG24
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG25	MMIO_REG(0x410044d9, uint8_t)
#define PORTB_PINCFG25_PMUXEN	(1 << 0)
#define PORTB_PINCFG25_INEN	(1 << 1)
#define PORTB_PINCFG25_PULLEN	(1 << 2)

#define PORTB_PINCFG25_s    MMIO_REG(0x410044d9, struct __struct_PORTB_PINCFG25)
struct __struct_PORTB_PINCFG25
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

