1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define PORTB_PINCFG26	MMIO_REG(0x410044da, uint8_t)
#define PORTB_PINCFG26_PMUXEN	(1 << 0)
#define PORTB_PINCFG26_INEN	(1 << 1)
#define PORTB_PINCFG26_PULLEN	(1 << 2)

#define PORTB_PINCFG26_s    MMIO_REG(0x410044da, struct __struct_PORTB_PINCFG26)
struct __struct_PORTB_PINCFG26
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG27	MMIO_REG(0x410044db, uint8_t)
#define PORTB_PINCFG27_PMUXEN	(1 << 0)
#define PORTB_PINCFG27_INEN	(1 << 1)
#define PORTB_PINCFG27_PULLEN	(1 << 2)

#define PORTB_PINCFG27_s    MMIO_REG(0x410044db, struct __struct_PORTB_PINCFG27)
struct __struct_PORTB_PINCFG27
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG28	MMIO_REG(0x410044dc, uint8_t)
#define PORTB_PINCFG28_PMUXEN	(1 << 0)
#define PORTB_PINCFG28_INEN	(1 << 1)
#define PORTB_PINCFG28_PULLEN	(1 << 2)

#define PORTB_PINCFG28_s    MMIO_REG(0x410044dc, struct __struct_PORTB_PINCFG28)
struct __struct_PORTB_PINCFG28
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG29	MMIO_REG(0x410044dd, uint8_t)
#define PORTB_PINCFG29_PMUXEN	(1 << 0)
#define PORTB_PINCFG29_INEN	(1 << 1)
#define PORTB_PINCFG29_PULLEN	(1 << 2)

#define PORTB_PINCFG29_s    MMIO_REG(0x410044dd, struct __struct_PORTB_PINCFG29)
struct __struct_PORTB_PINCFG29
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG30	MMIO_REG(0x410044de, uint8_t)
#define PORTB_PINCFG30_PMUXEN	(1 << 0)
#define PORTB_PINCFG30_INEN	(1 << 1)
#define PORTB_PINCFG30_PULLEN	(1 << 2)

#define PORTB_PINCFG30_s    MMIO_REG(0x410044de, struct __struct_PORTB_PINCFG30)
struct __struct_PORTB_PINCFG30
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG31	MMIO_REG(0x410044df, uint8_t)
#define PORTB_PINCFG31_PMUXEN	(1 << 0)
#define PORTB_PINCFG31_INEN	(1 << 1)
#define PORTB_PINCFG31_PULLEN	(1 << 2)

#define PORTB_PINCFG31_s    MMIO_REG(0x410044df, struct __struct_PORTB_PINCFG31)
struct __struct_PORTB_PINCFG31
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

// 0x42000000 PAC2

#define PAC2_WPCLR	MMIO_REG(0x42000000, uint32_t)
#define PAC2_WPCLR_EVSYS	(1 << 1)
#define PAC2_WPCLR_SERCOM0	(1 << 2)
#define PAC2_WPCLR_SERCOM1	(1 << 3)
#define PAC2_WPCLR_SERCOM2	(1 << 4)
#define PAC2_WPCLR_SERCOM3	(1 << 5)
#define PAC2_WPCLR_SERCOM4	(1 << 6)
#define PAC2_WPCLR_SERCOM5	(1 << 7)
#define PAC2_WPCLR_TC0	(1 << 8)
#define PAC2_WPCLR_TC1	(1 << 9)
#define PAC2_WPCLR_TC2	(1 << 10)
#define PAC2_WPCLR_TC3	(1 << 11)
#define PAC2_WPCLR_TC4	(1 << 12)
#define PAC2_WPCLR_TC5	(1 << 13)
#define PAC2_WPCLR_TC6	(1 << 14)
#define PAC2_WPCLR_TC7	(1 << 15)
#define PAC2_WPCLR_ADC	(1 << 16)
#define PAC2_WPCLR_AC	(1 << 17)
#define PAC2_WPCLR_DAC	(1 << 18)
#define PAC2_WPCLR_PTC	(1 << 19)

#define PAC2_WPCLR_s    MMIO_REG(0x42000000, struct __struct_PAC2_WPCLR)
struct __struct_PAC2_WPCLR
{
  uint32_t  : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tc0 : 1;
  uint32_t tc1 : 1;
  uint32_t tc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t  : 12;
};

#define PAC2_WPSET	MMIO_REG(0x42000004, uint32_t)
#define PAC2_WPSET_EVSYS	(1 << 1)
#define PAC2_WPSET_SERCOM0	(1 << 2)
#define PAC2_WPSET_SERCOM1	(1 << 3)
#define PAC2_WPSET_SERCOM2	(1 << 4)
#define PAC2_WPSET_SERCOM3	(1 << 5)
#define PAC2_WPSET_SERCOM4	(1 << 6)
#define PAC2_WPSET_SERCOM5	(1 << 7)
#define PAC2_WPSET_TC0	(1 << 8)
#define PAC2_WPSET_TC1	(1 << 9)
#define PAC2_WPSET_TC2	(1 << 10)
#define PAC2_WPSET_TC3	(1 << 11)
#define PAC2_WPSET_TC4	(1 << 12)
#define PAC2_WPSET_TC5	(1 << 13)
#define PAC2_WPSET_TC6	(1 << 14)
#define PAC2_WPSET_TC7	(1 << 15)
#define PAC2_WPSET_ADC	(1 << 16)
#define PAC2_WPSET_AC	(1 << 17)
#define PAC2_WPSET_DAC	(1 << 18)
#define PAC2_WPSET_PTC	(1 << 19)

#define PAC2_WPSET_s    MMIO_REG(0x42000004, struct __struct_PAC2_WPSET)
struct __struct_PAC2_WPSET
{
  uint32_t  : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tc0 : 1;
  uint32_t tc1 : 1;
  uint32_t tc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t  : 12;
};

// 0x42000400 EVSYS

#define EVSYS_CTRL	MMIO_REG(0x42000400, uint8_t)
#define EVSYS_CTRL_SWRST	(1 << 0)
#define EVSYS_CTRL_GCLKREQ	(1 << 4)

#define EVSYS_CTRL_s    MMIO_REG(0x42000400, struct __struct_EVSYS_CTRL)
struct __struct_EVSYS_CTRL
{
  uint8_t swrst : 1;
  uint8_t  : 3;
  uint8_t gclkreq : 1;
  uint8_t  : 3;
};

#define EVSYS_CHANNEL	MMIO_REG(0x42000404, uint32_t)
#define EVSYS_CHANNEL_CHANNEL(x)	((x) << 0)
#define EVSYS_CHANNEL_CHANNEL_MSK	0x000000ff
#define EVSYS_CHANNEL_CHANNEL_VAL(x)	(((x) >> 0) & 0xff)
#define EVSYS_CHANNEL_SWEVT	(1 << 8)
#define EVSYS_CHANNEL_EVGEN(x)	((x) << 16)
#define EVSYS_CHANNEL_EVGEN_MSK	0x00ff0000
#define EVSYS_CHANNEL_EVGEN_VAL(x)	(((x) >> 16) & 0xff)
#define EVSYS_CHANNEL_PATH(x)	((x) << 24)
#define EVSYS_CHANNEL_PATH_MSK	0x03000000
#define EVSYS_CHANNEL_PATH_VAL(x)	(((x) >> 24) & 0x3)
#define EVSYS_CHANNEL_EDGSEL(x)	((x) << 26)
#define EVSYS_CHANNEL_EDGSEL_MSK	0x0c000000
#define EVSYS_CHANNEL_EDGSEL_VAL(x)	(((x) >> 26) & 0x3)

#define EVSYS_CHANNEL_s    MMIO_REG(0x42000404, struct __struct_EVSYS_CHANNEL)
struct __struct_EVSYS_CHANNEL
{
  uint32_t channel : 8;
  uint32_t swevt : 1;
  uint32_t  : 7;
  uint32_t evgen : 8;
  uint32_t path : 2;
  uint32_t edgsel : 2;
  uint32_t  : 4;
};

#define EVSYS_USER	MMIO_REG(0x42000408, uint16_t)
#define EVSYS_USER_USER(x)	((x) << 0)
#define EVSYS_USER_USER_MSK	0x000000ff
#define EVSYS_USER_USER_VAL(x)	(((x) >> 0) & 0xff)
#define EVSYS_USER_CHANNEL(x)	((x) << 8)
#define EVSYS_USER_CHANNEL_MSK	0x0000ff00
#define EVSYS_USER_CHANNEL_VAL(x)	(((x) >> 8) & 0xff)

