1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define EVSYS_USER_s    MMIO_REG(0x42000408, struct __struct_EVSYS_USER)
struct __struct_EVSYS_USER
{
  uint16_t user : 8;
  uint16_t channel : 8;
};

#define EVSYS_CHSTATUS	MMIO_REG(0x4200040c, uint32_t)
#define EVSYS_CHSTATUS_USRRDY0	(1 << 0)
#define EVSYS_CHSTATUS_USRRDY1	(1 << 1)
#define EVSYS_CHSTATUS_USRRDY2	(1 << 2)
#define EVSYS_CHSTATUS_USRRDY3	(1 << 3)
#define EVSYS_CHSTATUS_USRRDY4	(1 << 4)
#define EVSYS_CHSTATUS_USRRDY5	(1 << 5)
#define EVSYS_CHSTATUS_USRRDY6	(1 << 6)
#define EVSYS_CHSTATUS_USRRDY7	(1 << 7)
#define EVSYS_CHSTATUS_CHBUSY0	(1 << 8)
#define EVSYS_CHSTATUS_CHBUSY1	(1 << 9)
#define EVSYS_CHSTATUS_CHBUSY2	(1 << 10)
#define EVSYS_CHSTATUS_CHBUSY3	(1 << 11)
#define EVSYS_CHSTATUS_CHBUSY4	(1 << 12)
#define EVSYS_CHSTATUS_CHBUSY5	(1 << 13)
#define EVSYS_CHSTATUS_CHBUSY6	(1 << 14)
#define EVSYS_CHSTATUS_CHBUSY7	(1 << 15)

#define EVSYS_CHSTATUS_s    MMIO_REG(0x4200040c, struct __struct_EVSYS_CHSTATUS)
struct __struct_EVSYS_CHSTATUS
{
  uint32_t usrrdy0 : 1;
  uint32_t usrrdy1 : 1;
  uint32_t usrrdy2 : 1;
  uint32_t usrrdy3 : 1;
  uint32_t usrrdy4 : 1;
  uint32_t usrrdy5 : 1;
  uint32_t usrrdy6 : 1;
  uint32_t usrrdy7 : 1;
  uint32_t chbusy0 : 1;
  uint32_t chbusy1 : 1;
  uint32_t chbusy2 : 1;
  uint32_t chbusy3 : 1;
  uint32_t chbusy4 : 1;
  uint32_t chbusy5 : 1;
  uint32_t chbusy6 : 1;
  uint32_t chbusy7 : 1;
  uint32_t  : 16;
};

#define EVSYS_INTENCLR	MMIO_REG(0x42000410, uint32_t)
#define EVSYS_INTENCLR_OVR0	(1 << 0)
#define EVSYS_INTENCLR_OVR1	(1 << 1)
#define EVSYS_INTENCLR_OVR2	(1 << 2)
#define EVSYS_INTENCLR_OVR3	(1 << 3)
#define EVSYS_INTENCLR_OVR4	(1 << 4)
#define EVSYS_INTENCLR_OVR5	(1 << 5)
#define EVSYS_INTENCLR_OVR6	(1 << 6)
#define EVSYS_INTENCLR_OVR7	(1 << 7)
#define EVSYS_INTENCLR_EVD0	(1 << 8)
#define EVSYS_INTENCLR_EVD1	(1 << 9)
#define EVSYS_INTENCLR_EVD2	(1 << 10)
#define EVSYS_INTENCLR_EVD3	(1 << 11)
#define EVSYS_INTENCLR_EVD4	(1 << 12)
#define EVSYS_INTENCLR_EVD5	(1 << 13)
#define EVSYS_INTENCLR_EVD6	(1 << 14)
#define EVSYS_INTENCLR_EVD7	(1 << 15)

#define EVSYS_INTENCLR_s    MMIO_REG(0x42000410, struct __struct_EVSYS_INTENCLR)
struct __struct_EVSYS_INTENCLR
{
  uint32_t ovr0 : 1;
  uint32_t ovr1 : 1;
  uint32_t ovr2 : 1;
  uint32_t ovr3 : 1;
  uint32_t ovr4 : 1;
  uint32_t ovr5 : 1;
  uint32_t ovr6 : 1;
  uint32_t ovr7 : 1;
  uint32_t evd0 : 1;
  uint32_t evd1 : 1;
  uint32_t evd2 : 1;
  uint32_t evd3 : 1;
  uint32_t evd4 : 1;
  uint32_t evd5 : 1;
  uint32_t evd6 : 1;
  uint32_t evd7 : 1;
  uint32_t  : 16;
};

#define EVSYS_INTENSET	MMIO_REG(0x42000414, uint32_t)
#define EVSYS_INTENSET_OVR0	(1 << 0)
#define EVSYS_INTENSET_OVR1	(1 << 1)
#define EVSYS_INTENSET_OVR2	(1 << 2)
#define EVSYS_INTENSET_OVR3	(1 << 3)
#define EVSYS_INTENSET_OVR4	(1 << 4)
#define EVSYS_INTENSET_OVR5	(1 << 5)
#define EVSYS_INTENSET_OVR6	(1 << 6)
#define EVSYS_INTENSET_OVR7	(1 << 7)
#define EVSYS_INTENSET_EVD0	(1 << 8)
#define EVSYS_INTENSET_EVD1	(1 << 9)
#define EVSYS_INTENSET_EVD2	(1 << 10)
#define EVSYS_INTENSET_EVD3	(1 << 11)
#define EVSYS_INTENSET_EVD4	(1 << 12)
#define EVSYS_INTENSET_EVD5	(1 << 13)
#define EVSYS_INTENSET_EVD6	(1 << 14)
#define EVSYS_INTENSET_EVD7	(1 << 15)

#define EVSYS_INTENSET_s    MMIO_REG(0x42000414, struct __struct_EVSYS_INTENSET)
struct __struct_EVSYS_INTENSET
{
  uint32_t ovr0 : 1;
  uint32_t ovr1 : 1;
  uint32_t ovr2 : 1;
  uint32_t ovr3 : 1;
  uint32_t ovr4 : 1;
  uint32_t ovr5 : 1;
  uint32_t ovr6 : 1;
  uint32_t ovr7 : 1;
  uint32_t evd0 : 1;
  uint32_t evd1 : 1;
  uint32_t evd2 : 1;
  uint32_t evd3 : 1;
  uint32_t evd4 : 1;
  uint32_t evd5 : 1;
  uint32_t evd6 : 1;
  uint32_t evd7 : 1;
  uint32_t  : 16;
};

#define EVSYS_INTFLAG	MMIO_REG(0x42000418, uint32_t)
#define EVSYS_INTFLAG_OVR0	(1 << 0)
#define EVSYS_INTFLAG_OVR1	(1 << 1)
#define EVSYS_INTFLAG_OVR2	(1 << 2)
#define EVSYS_INTFLAG_OVR3	(1 << 3)
#define EVSYS_INTFLAG_OVR4	(1 << 4)
#define EVSYS_INTFLAG_OVR5	(1 << 5)
#define EVSYS_INTFLAG_OVR6	(1 << 6)
#define EVSYS_INTFLAG_OVR7	(1 << 7)
#define EVSYS_INTFLAG_EVD0	(1 << 8)
#define EVSYS_INTFLAG_EVD1	(1 << 9)
#define EVSYS_INTFLAG_EVD2	(1 << 10)
#define EVSYS_INTFLAG_EVD3	(1 << 11)
#define EVSYS_INTFLAG_EVD4	(1 << 12)
#define EVSYS_INTFLAG_EVD5	(1 << 13)
#define EVSYS_INTFLAG_EVD6	(1 << 14)
#define EVSYS_INTFLAG_EVD7	(1 << 15)

#define EVSYS_INTFLAG_s    MMIO_REG(0x42000418, struct __struct_EVSYS_INTFLAG)
struct __struct_EVSYS_INTFLAG
{
  uint32_t ovr0 : 1;
  uint32_t ovr1 : 1;
  uint32_t ovr2 : 1;
  uint32_t ovr3 : 1;
  uint32_t ovr4 : 1;
  uint32_t ovr5 : 1;
  uint32_t ovr6 : 1;
  uint32_t ovr7 : 1;
  uint32_t evd0 : 1;
  uint32_t evd1 : 1;
  uint32_t evd2 : 1;
  uint32_t evd3 : 1;
  uint32_t evd4 : 1;
  uint32_t evd5 : 1;
  uint32_t evd6 : 1;
  uint32_t evd7 : 1;
  uint32_t  : 16;
};

// 0x42000800 SC0_USART

#define SC0_USART_CTRLA	MMIO_REG(0x42000800, uint32_t)
#define SC0_USART_CTRLA_SWRST	(1 << 0)
#define SC0_USART_CTRLA_ENABLE	(1 << 1)
#define SC0_USART_CTRLA_MODE(x)	((x) << 2)
#define SC0_USART_CTRLA_MODE_MSK	0x0000001c
#define SC0_USART_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC0_USART_CTRLA_RUNSTDBY	(1 << 7)
#define SC0_USART_CTRLA_TXPO	(1 << 16)
#define SC0_USART_CTRLA_RXPO(x)	((x) << 20)
#define SC0_USART_CTRLA_RXPO_MSK	0x00300000
#define SC0_USART_CTRLA_RXPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC0_USART_CTRLA_FORM(x)	((x) << 24)
#define SC0_USART_CTRLA_FORM_MSK	0x0f000000
#define SC0_USART_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC0_USART_CTRLA_CMODE	(1 << 28)
#define SC0_USART_CTRLA_CPOL	(1 << 29)
#define SC0_USART_CTRLA_DORD	(1 << 30)

#define SC0_USART_CTRLA_s    MMIO_REG(0x42000800, struct __struct_SC0_USART_CTRLA)
struct __struct_SC0_USART_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t txpo : 1;
  uint32_t  : 3;
  uint32_t rxpo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cmode : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC0_USART_CTRLB	MMIO_REG(0x42000804, uint32_t)
#define SC0_USART_CTRLB_CHSIZE(x)	((x) << 0)
#define SC0_USART_CTRLB_CHSIZE_MSK	0x00000007
#define SC0_USART_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC0_USART_CTRLB_SBMODE	(1 << 6)
#define SC0_USART_CTRLB_PMODE	(1 << 13)
#define SC0_USART_CTRLB_TXEN	(1 << 16)
#define SC0_USART_CTRLB_RXEN	(1 << 17)

