1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define SC0_USART_CTRLB_s    MMIO_REG(0x42000804, struct __struct_SC0_USART_CTRLB)
struct __struct_SC0_USART_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t sbmode : 1;
  uint32_t  : 6;
  uint32_t pmode : 1;
  uint32_t  : 2;
  uint32_t txen : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC0_USART_DBGCTRL	MMIO_REG(0x42000808, uint8_t)
#define SC0_USART_DBGCTRL_DBGSTOP	(1 << 0)

#define SC0_USART_DBGCTRL_s    MMIO_REG(0x42000808, struct __struct_SC0_USART_DBGCTRL)
struct __struct_SC0_USART_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC0_USART_BAUD	MMIO_REG(0x4200080a, uint16_t)
#define SC0_USART_BAUD_BAUD(x)	((x) << 0)
#define SC0_USART_BAUD_BAUD_MSK	0x0000ffff
#define SC0_USART_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xffff)

#define SC0_USART_BAUD_s    MMIO_REG(0x4200080a, struct __struct_SC0_USART_BAUD)
struct __struct_SC0_USART_BAUD
{
  uint16_t baud : 16;
};

#define SC0_USART_INTENCLR	MMIO_REG(0x4200080c, uint8_t)
#define SC0_USART_INTENCLR_DRE	(1 << 0)
#define SC0_USART_INTENCLR_TXC	(1 << 1)
#define SC0_USART_INTENCLR_RXC	(1 << 2)

#define SC0_USART_INTENCLR_s    MMIO_REG(0x4200080c, struct __struct_SC0_USART_INTENCLR)
struct __struct_SC0_USART_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC0_USART_INTENSET	MMIO_REG(0x4200080d, uint8_t)
#define SC0_USART_INTENSET_DRE	(1 << 0)
#define SC0_USART_INTENSET_TXC	(1 << 1)
#define SC0_USART_INTENSET_RXC	(1 << 2)

#define SC0_USART_INTENSET_s    MMIO_REG(0x4200080d, struct __struct_SC0_USART_INTENSET)
struct __struct_SC0_USART_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC0_USART_INTFLAG	MMIO_REG(0x4200080e, uint8_t)
#define SC0_USART_INTFLAG_DRE	(1 << 0)
#define SC0_USART_INTFLAG_TXC	(1 << 1)
#define SC0_USART_INTFLAG_RXC	(1 << 2)

#define SC0_USART_INTFLAG_s    MMIO_REG(0x4200080e, struct __struct_SC0_USART_INTFLAG)
struct __struct_SC0_USART_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC0_USART_STATUS	MMIO_REG(0x42000810, uint16_t)
#define SC0_USART_STATUS_PERR	(1 << 0)
#define SC0_USART_STATUS_FERR	(1 << 1)
#define SC0_USART_STATUS_BUFOVF	(1 << 2)
#define SC0_USART_STATUS_SYNCBUSY	(1 << 15)

#define SC0_USART_STATUS_s    MMIO_REG(0x42000810, struct __struct_SC0_USART_STATUS)
struct __struct_SC0_USART_STATUS
{
  uint16_t perr : 1;
  uint16_t ferr : 1;
  uint16_t bufovf : 1;
  uint16_t  : 12;
  uint16_t syncbusy : 1;
};

#define SC0_USART_DATA	MMIO_REG(0x42000818, uint16_t)
#define SC0_USART_DATA_DATA(x)	((x) << 0)
#define SC0_USART_DATA_DATA_MSK	0x000001ff
#define SC0_USART_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC0_USART_DATA_s    MMIO_REG(0x42000818, struct __struct_SC0_USART_DATA)
struct __struct_SC0_USART_DATA
{
  uint16_t data : 9;
  uint16_t  : 7;
};

// 0x42000800 SC0_SPI

#define SC0_SPI_CTRLA	MMIO_REG(0x42000800, uint32_t)
#define SC0_SPI_CTRLA_SWRST	(1 << 0)
#define SC0_SPI_CTRLA_ENABLE	(1 << 1)
#define SC0_SPI_CTRLA_MODE(x)	((x) << 2)
#define SC0_SPI_CTRLA_MODE_MSK	0x0000001c
#define SC0_SPI_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC0_SPI_CTRLA_RUNSTDBY	(1 << 7)
#define SC0_SPI_CTRLA_DOPO	(1 << 16)
#define SC0_SPI_CTRLA_DIPO(x)	((x) << 20)
#define SC0_SPI_CTRLA_DIPO_MSK	0x00300000
#define SC0_SPI_CTRLA_DIPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC0_SPI_CTRLA_FORM(x)	((x) << 24)
#define SC0_SPI_CTRLA_FORM_MSK	0x0f000000
#define SC0_SPI_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC0_SPI_CTRLA_CPHA	(1 << 28)
#define SC0_SPI_CTRLA_CPOL	(1 << 29)
#define SC0_SPI_CTRLA_DORD	(1 << 30)

#define SC0_SPI_CTRLA_s    MMIO_REG(0x42000800, struct __struct_SC0_SPI_CTRLA)
struct __struct_SC0_SPI_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t dopo : 1;
  uint32_t  : 3;
  uint32_t dipo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cpha : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC0_SPI_CTRLB	MMIO_REG(0x42000804, uint32_t)
#define SC0_SPI_CTRLB_CHSIZE(x)	((x) << 0)
#define SC0_SPI_CTRLB_CHSIZE_MSK	0x00000007
#define SC0_SPI_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC0_SPI_CTRLB_PLOADEN	(1 << 6)
#define SC0_SPI_CTRLB_AMODE(x)	((x) << 14)
#define SC0_SPI_CTRLB_AMODE_MSK	0x0000c000
#define SC0_SPI_CTRLB_AMODE_VAL(x)	(((x) >> 14) & 0x3)
#define SC0_SPI_CTRLB_RXEN	(1 << 17)

#define SC0_SPI_CTRLB_s    MMIO_REG(0x42000804, struct __struct_SC0_SPI_CTRLB)
struct __struct_SC0_SPI_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t ploaden : 1;
  uint32_t  : 7;
  uint32_t amode : 2;
  uint32_t  : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC0_SPI_DBGCTRL	MMIO_REG(0x42000808, uint8_t)
#define SC0_SPI_DBGCTRL_DBGSTOP	(1 << 0)

#define SC0_SPI_DBGCTRL_s    MMIO_REG(0x42000808, struct __struct_SC0_SPI_DBGCTRL)
struct __struct_SC0_SPI_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC0_SPI_BAUD	MMIO_REG(0x4200080a, uint8_t)
#define SC0_SPI_BAUD_BAUD(x)	((x) << 0)
#define SC0_SPI_BAUD_BAUD_MSK	0x000000ff
#define SC0_SPI_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_SPI_BAUD_s    MMIO_REG(0x4200080a, struct __struct_SC0_SPI_BAUD)
struct __struct_SC0_SPI_BAUD
{
  uint8_t baud : 8;
};

#define SC0_SPI_INTENCLR	MMIO_REG(0x4200080c, uint8_t)
#define SC0_SPI_INTENCLR_DRE	(1 << 0)
#define SC0_SPI_INTENCLR_TXC	(1 << 1)
#define SC0_SPI_INTENCLR_RXC	(1 << 2)

#define SC0_SPI_INTENCLR_s    MMIO_REG(0x4200080c, struct __struct_SC0_SPI_INTENCLR)
struct __struct_SC0_SPI_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC0_SPI_INTENSET	MMIO_REG(0x4200080d, uint8_t)
#define SC0_SPI_INTENSET_DRE	(1 << 0)
#define SC0_SPI_INTENSET_TXC	(1 << 1)
#define SC0_SPI_INTENSET_RXC	(1 << 2)

#define SC0_SPI_INTENSET_s    MMIO_REG(0x4200080d, struct __struct_SC0_SPI_INTENSET)
struct __struct_SC0_SPI_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

