1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define SC0_SPI_INTFLAG	MMIO_REG(0x4200080e, uint8_t)
#define SC0_SPI_INTFLAG_DRE	(1 << 0)
#define SC0_SPI_INTFLAG_TXC	(1 << 1)
#define SC0_SPI_INTFLAG_RXC	(1 << 2)

#define SC0_SPI_INTFLAG_s    MMIO_REG(0x4200080e, struct __struct_SC0_SPI_INTFLAG)
struct __struct_SC0_SPI_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC0_SPI_STATUS	MMIO_REG(0x42000810, uint16_t)
#define SC0_SPI_STATUS_BUFOVF	(1 << 2)
#define SC0_SPI_STATUS_SYNCBUSY	(1 << 15)

#define SC0_SPI_STATUS_s    MMIO_REG(0x42000810, struct __struct_SC0_SPI_STATUS)
struct __struct_SC0_SPI_STATUS
{
  uint16_t  : 2;
  uint16_t bufovf : 1;
  uint16_t  : 12;
  uint16_t syncbusy : 1;
};

#define SC0_SPI_ADDR	MMIO_REG(0x42000814, uint32_t)
#define SC0_SPI_ADDR_ADDR(x)	((x) << 0)
#define SC0_SPI_ADDR_ADDR_MSK	0x000000ff
#define SC0_SPI_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)
#define SC0_SPI_ADDR_ADDRMASK(x)	((x) << 16)
#define SC0_SPI_ADDR_ADDRMASK_MSK	0x00ff0000
#define SC0_SPI_ADDR_ADDRMASK_VAL(x)	(((x) >> 16) & 0xff)

#define SC0_SPI_ADDR_s    MMIO_REG(0x42000814, struct __struct_SC0_SPI_ADDR)
struct __struct_SC0_SPI_ADDR
{
  uint32_t addr : 8;
  uint32_t  : 8;
  uint32_t addrmask : 8;
  uint32_t  : 8;
};

#define SC0_SPI_DATA	MMIO_REG(0x42000818, uint16_t)
#define SC0_SPI_DATA_DATA(x)	((x) << 0)
#define SC0_SPI_DATA_DATA_MSK	0x000001ff
#define SC0_SPI_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC0_SPI_DATA_s    MMIO_REG(0x42000818, struct __struct_SC0_SPI_DATA)
struct __struct_SC0_SPI_DATA
{
  uint16_t data : 9;
  uint16_t  : 7;
};

// 0x42000800 SC0_I2C_S

#define SC0_I2C_S_CTRLA	MMIO_REG(0x42000800, uint32_t)
#define SC0_I2C_S_CTRLA_SWRST	(1 << 0)
#define SC0_I2C_S_CTRLA_ENABLE	(1 << 1)
#define SC0_I2C_S_CTRLA_MODE(x)	((x) << 2)
#define SC0_I2C_S_CTRLA_MODE_MSK	0x0000001c
#define SC0_I2C_S_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC0_I2C_S_CTRLA_RUNSTDBY	(1 << 7)
#define SC0_I2C_S_CTRLA_PINOUT	(1 << 16)
#define SC0_I2C_S_CTRLA_SDAHOLD(x)	((x) << 20)
#define SC0_I2C_S_CTRLA_SDAHOLD_MSK	0x00300000
#define SC0_I2C_S_CTRLA_SDAHOLD_VAL(x)	(((x) >> 20) & 0x3)
#define SC0_I2C_S_CTRLA_LOWTOUT	(1 << 30)

#define SC0_I2C_S_CTRLA_s    MMIO_REG(0x42000800, struct __struct_SC0_I2C_S_CTRLA)
struct __struct_SC0_I2C_S_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t pinout : 1;
  uint32_t  : 3;
  uint32_t sdahold : 2;
  uint32_t  : 8;
  uint32_t lowtout : 1;
  uint32_t  : 1;
};

#define SC0_I2C_S_CTRLB	MMIO_REG(0x42000804, uint32_t)
#define SC0_I2C_S_CTRLB_SMEN	(1 << 8)
#define SC0_I2C_S_CTRLB_AMODE(x)	((x) << 14)
#define SC0_I2C_S_CTRLB_AMODE_MSK	0x0000c000
#define SC0_I2C_S_CTRLB_AMODE_VAL(x)	(((x) >> 14) & 0x3)
#define SC0_I2C_S_CTRLB_CMD(x)	((x) << 16)
#define SC0_I2C_S_CTRLB_CMD_MSK	0x00030000
#define SC0_I2C_S_CTRLB_CMD_VAL(x)	(((x) >> 16) & 0x3)
#define SC0_I2C_S_CTRLB_ACKACT	(1 << 18)

#define SC0_I2C_S_CTRLB_s    MMIO_REG(0x42000804, struct __struct_SC0_I2C_S_CTRLB)
struct __struct_SC0_I2C_S_CTRLB
{
  uint32_t  : 8;
  uint32_t smen : 1;
  uint32_t  : 5;
  uint32_t amode : 2;
  uint32_t cmd : 2;
  uint32_t ackact : 1;
  uint32_t  : 13;
};

#define SC0_I2C_S_INTENCLR	MMIO_REG(0x4200080c, uint8_t)
#define SC0_I2C_S_INTENCLR_PREC	(1 << 0)
#define SC0_I2C_S_INTENCLR_AMATCH	(1 << 1)
#define SC0_I2C_S_INTENCLR_DRDY	(1 << 2)

#define SC0_I2C_S_INTENCLR_s    MMIO_REG(0x4200080c, struct __struct_SC0_I2C_S_INTENCLR)
struct __struct_SC0_I2C_S_INTENCLR
{
  uint8_t prec : 1;
  uint8_t amatch : 1;
  uint8_t drdy : 1;
  uint8_t  : 5;
};

#define SC0_I2C_S_INTENSET	MMIO_REG(0x4200080d, uint8_t)
#define SC0_I2C_S_INTENSET_PREC	(1 << 0)
#define SC0_I2C_S_INTENSET_AMATCH	(1 << 1)
#define SC0_I2C_S_INTENSET_DRDY	(1 << 2)

#define SC0_I2C_S_INTENSET_s    MMIO_REG(0x4200080d, struct __struct_SC0_I2C_S_INTENSET)
struct __struct_SC0_I2C_S_INTENSET
{
  uint8_t prec : 1;
  uint8_t amatch : 1;
  uint8_t drdy : 1;
  uint8_t  : 5;
};

#define SC0_I2C_S_INTFLAG	MMIO_REG(0x4200080e, uint8_t)
#define SC0_I2C_S_INTFLAG_PREC	(1 << 0)
#define SC0_I2C_S_INTFLAG_AMATCH	(1 << 1)
#define SC0_I2C_S_INTFLAG_DRDY	(1 << 2)

#define SC0_I2C_S_INTFLAG_s    MMIO_REG(0x4200080e, struct __struct_SC0_I2C_S_INTFLAG)
struct __struct_SC0_I2C_S_INTFLAG
{
  uint8_t prec : 1;
  uint8_t amatch : 1;
  uint8_t drdy : 1;
  uint8_t  : 5;
};

#define SC0_I2C_S_STATUS	MMIO_REG(0x42000810, uint16_t)
#define SC0_I2C_S_STATUS_BUSERR	(1 << 0)
#define SC0_I2C_S_STATUS_COLL	(1 << 1)
#define SC0_I2C_S_STATUS_RXNACK	(1 << 2)
#define SC0_I2C_S_STATUS_DIR	(1 << 3)
#define SC0_I2C_S_STATUS_SR	(1 << 4)
#define SC0_I2C_S_STATUS_LOWTOUT	(1 << 6)
#define SC0_I2C_S_STATUS_CLKHOLD	(1 << 7)
#define SC0_I2C_S_STATUS_SYNCBUSY	(1 << 15)

#define SC0_I2C_S_STATUS_s    MMIO_REG(0x42000810, struct __struct_SC0_I2C_S_STATUS)
struct __struct_SC0_I2C_S_STATUS
{
  uint16_t buserr : 1;
  uint16_t coll : 1;
  uint16_t rxnack : 1;
  uint16_t dir : 1;
  uint16_t sr : 1;
  uint16_t  : 1;
  uint16_t lowtout : 1;
  uint16_t clkhold : 1;
  uint16_t  : 7;
  uint16_t syncbusy : 1;
};

#define SC0_I2C_S_ADDR	MMIO_REG(0x42000814, uint32_t)
#define SC0_I2C_S_ADDR_GENCEN	(1 << 0)
#define SC0_I2C_S_ADDR_ADDR(x)	((x) << 1)
#define SC0_I2C_S_ADDR_ADDR_MSK	0x000000fe
#define SC0_I2C_S_ADDR_ADDR_VAL(x)	(((x) >> 1) & 0x7f)
#define SC0_I2C_S_ADDR_ADDRMASK(x)	((x) << 17)
#define SC0_I2C_S_ADDR_ADDRMASK_MSK	0x00fe0000
#define SC0_I2C_S_ADDR_ADDRMASK_VAL(x)	(((x) >> 17) & 0x7f)

#define SC0_I2C_S_ADDR_s    MMIO_REG(0x42000814, struct __struct_SC0_I2C_S_ADDR)
struct __struct_SC0_I2C_S_ADDR
{
  uint32_t gencen : 1;
  uint32_t addr : 7;
  uint32_t  : 9;
  uint32_t addrmask : 7;
  uint32_t  : 8;
};

#define SC0_I2C_S_DATA	MMIO_REG(0x42000818, uint16_t)
#define SC0_I2C_S_DATA_DATA(x)	((x) << 0)
#define SC0_I2C_S_DATA_DATA_MSK	0x000000ff
#define SC0_I2C_S_DATA_DATA_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_I2C_S_DATA_s    MMIO_REG(0x42000818, struct __struct_SC0_I2C_S_DATA)
struct __struct_SC0_I2C_S_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

