1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
// 0x42000800 SC0_I2C_M

#define SC0_I2C_M_CTRLA	MMIO_REG(0x42000800, uint32_t)
#define SC0_I2C_M_CTRLA_SWRST	(1 << 0)
#define SC0_I2C_M_CTRLA_ENABLE	(1 << 1)
#define SC0_I2C_M_CTRLA_MODE(x)	((x) << 2)
#define SC0_I2C_M_CTRLA_MODE_MSK	0x0000001c
#define SC0_I2C_M_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC0_I2C_M_CTRLA_RUNSTDBY	(1 << 7)
#define SC0_I2C_M_CTRLA_PINOUT	(1 << 16)
#define SC0_I2C_M_CTRLA_SDAHOLD(x)	((x) << 20)
#define SC0_I2C_M_CTRLA_SDAHOLD_MSK	0x00300000
#define SC0_I2C_M_CTRLA_SDAHOLD_VAL(x)	(((x) >> 20) & 0x3)
#define SC0_I2C_M_CTRLA_INACTOUT(x)	((x) << 28)
#define SC0_I2C_M_CTRLA_INACTOUT_MSK	0x30000000
#define SC0_I2C_M_CTRLA_INACTOUT_VAL(x)	(((x) >> 28) & 0x3)
#define SC0_I2C_M_CTRLA_LOWTOUT	(1 << 30)

#define SC0_I2C_M_CTRLA_s    MMIO_REG(0x42000800, struct __struct_SC0_I2C_M_CTRLA)
struct __struct_SC0_I2C_M_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t pinout : 1;
  uint32_t  : 3;
  uint32_t sdahold : 2;
  uint32_t  : 6;
  uint32_t inactout : 2;
  uint32_t lowtout : 1;
  uint32_t  : 1;
};

#define SC0_I2C_M_CTRLB	MMIO_REG(0x42000804, uint32_t)
#define SC0_I2C_M_CTRLB_SMEN	(1 << 8)
#define SC0_I2C_M_CTRLB_QCEN	(1 << 9)
#define SC0_I2C_M_CTRLB_CMD(x)	((x) << 16)
#define SC0_I2C_M_CTRLB_CMD_MSK	0x00030000
#define SC0_I2C_M_CTRLB_CMD_VAL(x)	(((x) >> 16) & 0x3)
#define SC0_I2C_M_CTRLB_ACKACT	(1 << 18)

#define SC0_I2C_M_CTRLB_s    MMIO_REG(0x42000804, struct __struct_SC0_I2C_M_CTRLB)
struct __struct_SC0_I2C_M_CTRLB
{
  uint32_t  : 8;
  uint32_t smen : 1;
  uint32_t qcen : 1;
  uint32_t  : 6;
  uint32_t cmd : 2;
  uint32_t ackact : 1;
  uint32_t  : 13;
};

#define SC0_I2C_M_DBGCTRL	MMIO_REG(0x42000808, uint8_t)
#define SC0_I2C_M_DBGCTRL_DBGSTOP	(1 << 0)

#define SC0_I2C_M_DBGCTRL_s    MMIO_REG(0x42000808, struct __struct_SC0_I2C_M_DBGCTRL)
struct __struct_SC0_I2C_M_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC0_I2C_M_BAUD	MMIO_REG(0x4200080a, uint16_t)
#define SC0_I2C_M_BAUD_BAUD(x)	((x) << 0)
#define SC0_I2C_M_BAUD_BAUD_MSK	0x000000ff
#define SC0_I2C_M_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)
#define SC0_I2C_M_BAUD_BAUDLOW(x)	((x) << 8)
#define SC0_I2C_M_BAUD_BAUDLOW_MSK	0x0000ff00
#define SC0_I2C_M_BAUD_BAUDLOW_VAL(x)	(((x) >> 8) & 0xff)

#define SC0_I2C_M_BAUD_s    MMIO_REG(0x4200080a, struct __struct_SC0_I2C_M_BAUD)
struct __struct_SC0_I2C_M_BAUD
{
  uint16_t baud : 8;
  uint16_t baudlow : 8;
};

#define SC0_I2C_M_INTENCLR	MMIO_REG(0x4200080c, uint8_t)
#define SC0_I2C_M_INTENCLR_MB	(1 << 0)
#define SC0_I2C_M_INTENCLR_SB	(1 << 1)

#define SC0_I2C_M_INTENCLR_s    MMIO_REG(0x4200080c, struct __struct_SC0_I2C_M_INTENCLR)
struct __struct_SC0_I2C_M_INTENCLR
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC0_I2C_M_INTENSET	MMIO_REG(0x4200080d, uint8_t)
#define SC0_I2C_M_INTENSET_MB	(1 << 0)
#define SC0_I2C_M_INTENSET_SB	(1 << 1)

#define SC0_I2C_M_INTENSET_s    MMIO_REG(0x4200080d, struct __struct_SC0_I2C_M_INTENSET)
struct __struct_SC0_I2C_M_INTENSET
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC0_I2C_M_INTFLAG	MMIO_REG(0x4200080e, uint8_t)
#define SC0_I2C_M_INTFLAG_MB	(1 << 0)
#define SC0_I2C_M_INTFLAG_SB	(1 << 1)

#define SC0_I2C_M_INTFLAG_s    MMIO_REG(0x4200080e, struct __struct_SC0_I2C_M_INTFLAG)
struct __struct_SC0_I2C_M_INTFLAG
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC0_I2C_M_STATUS	MMIO_REG(0x42000810, uint16_t)
#define SC0_I2C_M_STATUS_BUSERR	(1 << 0)
#define SC0_I2C_M_STATUS_ARBLOST	(1 << 1)
#define SC0_I2C_M_STATUS_RXNACK	(1 << 2)
#define SC0_I2C_M_STATUS_BUSSTATE(x)	((x) << 4)
#define SC0_I2C_M_STATUS_BUSSTATE_MSK	0x00000030
#define SC0_I2C_M_STATUS_BUSSTATE_VAL(x)	(((x) >> 4) & 0x3)
#define SC0_I2C_M_STATUS_LOWTOUT	(1 << 6)
#define SC0_I2C_M_STATUS_CLKHOLD	(1 << 7)
#define SC0_I2C_M_STATUS_SYNCBUSY	(1 << 15)

#define SC0_I2C_M_STATUS_s    MMIO_REG(0x42000810, struct __struct_SC0_I2C_M_STATUS)
struct __struct_SC0_I2C_M_STATUS
{
  uint16_t buserr : 1;
  uint16_t arblost : 1;
  uint16_t rxnack : 1;
  uint16_t  : 1;
  uint16_t busstate : 2;
  uint16_t lowtout : 1;
  uint16_t clkhold : 1;
  uint16_t  : 7;
  uint16_t syncbusy : 1;
};

#define SC0_I2C_M_ADDR	MMIO_REG(0x42000814, uint16_t)
#define SC0_I2C_M_ADDR_ADDR(x)	((x) << 0)
#define SC0_I2C_M_ADDR_ADDR_MSK	0x000000ff
#define SC0_I2C_M_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_I2C_M_ADDR_s    MMIO_REG(0x42000814, struct __struct_SC0_I2C_M_ADDR)
struct __struct_SC0_I2C_M_ADDR
{
  uint16_t addr : 8;
  uint16_t  : 8;
};

#define SC0_I2C_M_DATA	MMIO_REG(0x42000818, uint16_t)
#define SC0_I2C_M_DATA_DATA(x)	((x) << 0)
#define SC0_I2C_M_DATA_DATA_MSK	0x000000ff
#define SC0_I2C_M_DATA_DATA_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_I2C_M_DATA_s    MMIO_REG(0x42000818, struct __struct_SC0_I2C_M_DATA)
struct __struct_SC0_I2C_M_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

// 0x42000c00 SC1_USART

#define SC1_USART_CTRLA	MMIO_REG(0x42000c00, uint32_t)
#define SC1_USART_CTRLA_SWRST	(1 << 0)
#define SC1_USART_CTRLA_ENABLE	(1 << 1)
#define SC1_USART_CTRLA_MODE(x)	((x) << 2)
#define SC1_USART_CTRLA_MODE_MSK	0x0000001c
#define SC1_USART_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC1_USART_CTRLA_RUNSTDBY	(1 << 7)
#define SC1_USART_CTRLA_TXPO	(1 << 16)
#define SC1_USART_CTRLA_RXPO(x)	((x) << 20)
#define SC1_USART_CTRLA_RXPO_MSK	0x00300000
#define SC1_USART_CTRLA_RXPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC1_USART_CTRLA_FORM(x)	((x) << 24)
#define SC1_USART_CTRLA_FORM_MSK	0x0f000000
#define SC1_USART_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC1_USART_CTRLA_CMODE	(1 << 28)
#define SC1_USART_CTRLA_CPOL	(1 << 29)
#define SC1_USART_CTRLA_DORD	(1 << 30)

#define SC1_USART_CTRLA_s    MMIO_REG(0x42000c00, struct __struct_SC1_USART_CTRLA)
struct __struct_SC1_USART_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t txpo : 1;
  uint32_t  : 3;
  uint32_t rxpo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cmode : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

