1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define SC4_I2C_M_INTENCLR_s    MMIO_REG(0x4200180c, struct __struct_SC4_I2C_M_INTENCLR)
struct __struct_SC4_I2C_M_INTENCLR
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC4_I2C_M_INTENSET	MMIO_REG(0x4200180d, uint8_t)
#define SC4_I2C_M_INTENSET_MB	(1 << 0)
#define SC4_I2C_M_INTENSET_SB	(1 << 1)

#define SC4_I2C_M_INTENSET_s    MMIO_REG(0x4200180d, struct __struct_SC4_I2C_M_INTENSET)
struct __struct_SC4_I2C_M_INTENSET
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC4_I2C_M_INTFLAG	MMIO_REG(0x4200180e, uint8_t)
#define SC4_I2C_M_INTFLAG_MB	(1 << 0)
#define SC4_I2C_M_INTFLAG_SB	(1 << 1)

#define SC4_I2C_M_INTFLAG_s    MMIO_REG(0x4200180e, struct __struct_SC4_I2C_M_INTFLAG)
struct __struct_SC4_I2C_M_INTFLAG
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC4_I2C_M_STATUS	MMIO_REG(0x42001810, uint16_t)
#define SC4_I2C_M_STATUS_BUSERR	(1 << 0)
#define SC4_I2C_M_STATUS_ARBLOST	(1 << 1)
#define SC4_I2C_M_STATUS_RXNACK	(1 << 2)
#define SC4_I2C_M_STATUS_BUSSTATE(x)	((x) << 4)
#define SC4_I2C_M_STATUS_BUSSTATE_MSK	0x00000030
#define SC4_I2C_M_STATUS_BUSSTATE_VAL(x)	(((x) >> 4) & 0x3)
#define SC4_I2C_M_STATUS_LOWTOUT	(1 << 6)
#define SC4_I2C_M_STATUS_CLKHOLD	(1 << 7)
#define SC4_I2C_M_STATUS_SYNCBUSY	(1 << 15)

#define SC4_I2C_M_STATUS_s    MMIO_REG(0x42001810, struct __struct_SC4_I2C_M_STATUS)
struct __struct_SC4_I2C_M_STATUS
{
  uint16_t buserr : 1;
  uint16_t arblost : 1;
  uint16_t rxnack : 1;
  uint16_t  : 1;
  uint16_t busstate : 2;
  uint16_t lowtout : 1;
  uint16_t clkhold : 1;
  uint16_t  : 7;
  uint16_t syncbusy : 1;
};

#define SC4_I2C_M_ADDR	MMIO_REG(0x42001814, uint16_t)
#define SC4_I2C_M_ADDR_ADDR(x)	((x) << 0)
#define SC4_I2C_M_ADDR_ADDR_MSK	0x000000ff
#define SC4_I2C_M_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)

#define SC4_I2C_M_ADDR_s    MMIO_REG(0x42001814, struct __struct_SC4_I2C_M_ADDR)
struct __struct_SC4_I2C_M_ADDR
{
  uint16_t addr : 8;
  uint16_t  : 8;
};

#define SC4_I2C_M_DATA	MMIO_REG(0x42001818, uint16_t)
#define SC4_I2C_M_DATA_DATA(x)	((x) << 0)
#define SC4_I2C_M_DATA_DATA_MSK	0x000000ff
#define SC4_I2C_M_DATA_DATA_VAL(x)	(((x) >> 0) & 0xff)

#define SC4_I2C_M_DATA_s    MMIO_REG(0x42001818, struct __struct_SC4_I2C_M_DATA)
struct __struct_SC4_I2C_M_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

// 0x42001c00 SC5_USART

#define SC5_USART_CTRLA	MMIO_REG(0x42001c00, uint32_t)
#define SC5_USART_CTRLA_SWRST	(1 << 0)
#define SC5_USART_CTRLA_ENABLE	(1 << 1)
#define SC5_USART_CTRLA_MODE(x)	((x) << 2)
#define SC5_USART_CTRLA_MODE_MSK	0x0000001c
#define SC5_USART_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC5_USART_CTRLA_RUNSTDBY	(1 << 7)
#define SC5_USART_CTRLA_TXPO	(1 << 16)
#define SC5_USART_CTRLA_RXPO(x)	((x) << 20)
#define SC5_USART_CTRLA_RXPO_MSK	0x00300000
#define SC5_USART_CTRLA_RXPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC5_USART_CTRLA_FORM(x)	((x) << 24)
#define SC5_USART_CTRLA_FORM_MSK	0x0f000000
#define SC5_USART_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC5_USART_CTRLA_CMODE	(1 << 28)
#define SC5_USART_CTRLA_CPOL	(1 << 29)
#define SC5_USART_CTRLA_DORD	(1 << 30)

#define SC5_USART_CTRLA_s    MMIO_REG(0x42001c00, struct __struct_SC5_USART_CTRLA)
struct __struct_SC5_USART_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t txpo : 1;
  uint32_t  : 3;
  uint32_t rxpo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cmode : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC5_USART_CTRLB	MMIO_REG(0x42001c04, uint32_t)
#define SC5_USART_CTRLB_CHSIZE(x)	((x) << 0)
#define SC5_USART_CTRLB_CHSIZE_MSK	0x00000007
#define SC5_USART_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC5_USART_CTRLB_SBMODE	(1 << 6)
#define SC5_USART_CTRLB_PMODE	(1 << 13)
#define SC5_USART_CTRLB_TXEN	(1 << 16)
#define SC5_USART_CTRLB_RXEN	(1 << 17)

#define SC5_USART_CTRLB_s    MMIO_REG(0x42001c04, struct __struct_SC5_USART_CTRLB)
struct __struct_SC5_USART_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t sbmode : 1;
  uint32_t  : 6;
  uint32_t pmode : 1;
  uint32_t  : 2;
  uint32_t txen : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC5_USART_DBGCTRL	MMIO_REG(0x42001c08, uint8_t)
#define SC5_USART_DBGCTRL_DBGSTOP	(1 << 0)

#define SC5_USART_DBGCTRL_s    MMIO_REG(0x42001c08, struct __struct_SC5_USART_DBGCTRL)
struct __struct_SC5_USART_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC5_USART_BAUD	MMIO_REG(0x42001c0a, uint16_t)
#define SC5_USART_BAUD_BAUD(x)	((x) << 0)
#define SC5_USART_BAUD_BAUD_MSK	0x0000ffff
#define SC5_USART_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xffff)

#define SC5_USART_BAUD_s    MMIO_REG(0x42001c0a, struct __struct_SC5_USART_BAUD)
struct __struct_SC5_USART_BAUD
{
  uint16_t baud : 16;
};

#define SC5_USART_INTENCLR	MMIO_REG(0x42001c0c, uint8_t)
#define SC5_USART_INTENCLR_DRE	(1 << 0)
#define SC5_USART_INTENCLR_TXC	(1 << 1)
#define SC5_USART_INTENCLR_RXC	(1 << 2)

#define SC5_USART_INTENCLR_s    MMIO_REG(0x42001c0c, struct __struct_SC5_USART_INTENCLR)
struct __struct_SC5_USART_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC5_USART_INTENSET	MMIO_REG(0x42001c0d, uint8_t)
#define SC5_USART_INTENSET_DRE	(1 << 0)
#define SC5_USART_INTENSET_TXC	(1 << 1)
#define SC5_USART_INTENSET_RXC	(1 << 2)

#define SC5_USART_INTENSET_s    MMIO_REG(0x42001c0d, struct __struct_SC5_USART_INTENSET)
struct __struct_SC5_USART_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC5_USART_INTFLAG	MMIO_REG(0x42001c0e, uint8_t)
#define SC5_USART_INTFLAG_DRE	(1 << 0)
#define SC5_USART_INTFLAG_TXC	(1 << 1)
#define SC5_USART_INTFLAG_RXC	(1 << 2)

#define SC5_USART_INTFLAG_s    MMIO_REG(0x42001c0e, struct __struct_SC5_USART_INTFLAG)
struct __struct_SC5_USART_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC5_USART_STATUS	MMIO_REG(0x42001c10, uint16_t)
#define SC5_USART_STATUS_PERR	(1 << 0)
#define SC5_USART_STATUS_FERR	(1 << 1)
#define SC5_USART_STATUS_BUFOVF	(1 << 2)
#define SC5_USART_STATUS_SYNCBUSY	(1 << 15)

#define SC5_USART_STATUS_s    MMIO_REG(0x42001c10, struct __struct_SC5_USART_STATUS)
struct __struct_SC5_USART_STATUS
{
  uint16_t perr : 1;
  uint16_t ferr : 1;
  uint16_t bufovf : 1;
  uint16_t  : 12;
  uint16_t syncbusy : 1;
};

#define SC5_USART_DATA	MMIO_REG(0x42001c18, uint16_t)
#define SC5_USART_DATA_DATA(x)	((x) << 0)
#define SC5_USART_DATA_DATA_MSK	0x000001ff
#define SC5_USART_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC5_USART_DATA_s    MMIO_REG(0x42001c18, struct __struct_SC5_USART_DATA)
struct __struct_SC5_USART_DATA
{
  uint16_t data : 9;
  uint16_t  : 7;
};

