1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
// 0x42001c00 SC5_SPI

#define SC5_SPI_CTRLA	MMIO_REG(0x42001c00, uint32_t)
#define SC5_SPI_CTRLA_SWRST	(1 << 0)
#define SC5_SPI_CTRLA_ENABLE	(1 << 1)
#define SC5_SPI_CTRLA_MODE(x)	((x) << 2)
#define SC5_SPI_CTRLA_MODE_MSK	0x0000001c
#define SC5_SPI_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC5_SPI_CTRLA_RUNSTDBY	(1 << 7)
#define SC5_SPI_CTRLA_DOPO	(1 << 16)
#define SC5_SPI_CTRLA_DIPO(x)	((x) << 20)
#define SC5_SPI_CTRLA_DIPO_MSK	0x00300000
#define SC5_SPI_CTRLA_DIPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC5_SPI_CTRLA_FORM(x)	((x) << 24)
#define SC5_SPI_CTRLA_FORM_MSK	0x0f000000
#define SC5_SPI_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC5_SPI_CTRLA_CPHA	(1 << 28)
#define SC5_SPI_CTRLA_CPOL	(1 << 29)
#define SC5_SPI_CTRLA_DORD	(1 << 30)

#define SC5_SPI_CTRLA_s    MMIO_REG(0x42001c00, struct __struct_SC5_SPI_CTRLA)
struct __struct_SC5_SPI_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t dopo : 1;
  uint32_t  : 3;
  uint32_t dipo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cpha : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC5_SPI_CTRLB	MMIO_REG(0x42001c04, uint32_t)
#define SC5_SPI_CTRLB_CHSIZE(x)	((x) << 0)
#define SC5_SPI_CTRLB_CHSIZE_MSK	0x00000007
#define SC5_SPI_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC5_SPI_CTRLB_PLOADEN	(1 << 6)
#define SC5_SPI_CTRLB_AMODE(x)	((x) << 14)
#define SC5_SPI_CTRLB_AMODE_MSK	0x0000c000
#define SC5_SPI_CTRLB_AMODE_VAL(x)	(((x) >> 14) & 0x3)
#define SC5_SPI_CTRLB_RXEN	(1 << 17)

#define SC5_SPI_CTRLB_s    MMIO_REG(0x42001c04, struct __struct_SC5_SPI_CTRLB)
struct __struct_SC5_SPI_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t ploaden : 1;
  uint32_t  : 7;
  uint32_t amode : 2;
  uint32_t  : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC5_SPI_DBGCTRL	MMIO_REG(0x42001c08, uint8_t)
#define SC5_SPI_DBGCTRL_DBGSTOP	(1 << 0)

#define SC5_SPI_DBGCTRL_s    MMIO_REG(0x42001c08, struct __struct_SC5_SPI_DBGCTRL)
struct __struct_SC5_SPI_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC5_SPI_BAUD	MMIO_REG(0x42001c0a, uint8_t)
#define SC5_SPI_BAUD_BAUD(x)	((x) << 0)
#define SC5_SPI_BAUD_BAUD_MSK	0x000000ff
#define SC5_SPI_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)

#define SC5_SPI_BAUD_s    MMIO_REG(0x42001c0a, struct __struct_SC5_SPI_BAUD)
struct __struct_SC5_SPI_BAUD
{
  uint8_t baud : 8;
};

#define SC5_SPI_INTENCLR	MMIO_REG(0x42001c0c, uint8_t)
#define SC5_SPI_INTENCLR_DRE	(1 << 0)
#define SC5_SPI_INTENCLR_TXC	(1 << 1)
#define SC5_SPI_INTENCLR_RXC	(1 << 2)

#define SC5_SPI_INTENCLR_s    MMIO_REG(0x42001c0c, struct __struct_SC5_SPI_INTENCLR)
struct __struct_SC5_SPI_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC5_SPI_INTENSET	MMIO_REG(0x42001c0d, uint8_t)
#define SC5_SPI_INTENSET_DRE	(1 << 0)
#define SC5_SPI_INTENSET_TXC	(1 << 1)
#define SC5_SPI_INTENSET_RXC	(1 << 2)

#define SC5_SPI_INTENSET_s    MMIO_REG(0x42001c0d, struct __struct_SC5_SPI_INTENSET)
struct __struct_SC5_SPI_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC5_SPI_INTFLAG	MMIO_REG(0x42001c0e, uint8_t)
#define SC5_SPI_INTFLAG_DRE	(1 << 0)
#define SC5_SPI_INTFLAG_TXC	(1 << 1)
#define SC5_SPI_INTFLAG_RXC	(1 << 2)

#define SC5_SPI_INTFLAG_s    MMIO_REG(0x42001c0e, struct __struct_SC5_SPI_INTFLAG)
struct __struct_SC5_SPI_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t  : 5;
};

#define SC5_SPI_STATUS	MMIO_REG(0x42001c10, uint16_t)
#define SC5_SPI_STATUS_BUFOVF	(1 << 2)
#define SC5_SPI_STATUS_SYNCBUSY	(1 << 15)

#define SC5_SPI_STATUS_s    MMIO_REG(0x42001c10, struct __struct_SC5_SPI_STATUS)
struct __struct_SC5_SPI_STATUS
{
  uint16_t  : 2;
  uint16_t bufovf : 1;
  uint16_t  : 12;
  uint16_t syncbusy : 1;
};

#define SC5_SPI_ADDR	MMIO_REG(0x42001c14, uint32_t)
#define SC5_SPI_ADDR_ADDR(x)	((x) << 0)
#define SC5_SPI_ADDR_ADDR_MSK	0x000000ff
#define SC5_SPI_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)
#define SC5_SPI_ADDR_ADDRMASK(x)	((x) << 16)
#define SC5_SPI_ADDR_ADDRMASK_MSK	0x00ff0000
#define SC5_SPI_ADDR_ADDRMASK_VAL(x)	(((x) >> 16) & 0xff)

#define SC5_SPI_ADDR_s    MMIO_REG(0x42001c14, struct __struct_SC5_SPI_ADDR)
struct __struct_SC5_SPI_ADDR
{
  uint32_t addr : 8;
  uint32_t  : 8;
  uint32_t addrmask : 8;
  uint32_t  : 8;
};

#define SC5_SPI_DATA	MMIO_REG(0x42001c18, uint16_t)
#define SC5_SPI_DATA_DATA(x)	((x) << 0)
#define SC5_SPI_DATA_DATA_MSK	0x000001ff
#define SC5_SPI_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC5_SPI_DATA_s    MMIO_REG(0x42001c18, struct __struct_SC5_SPI_DATA)
struct __struct_SC5_SPI_DATA
{
  uint16_t data : 9;
  uint16_t  : 7;
};

// 0x42001c00 SC5_I2C_S

#define SC5_I2C_S_CTRLA	MMIO_REG(0x42001c00, uint32_t)
#define SC5_I2C_S_CTRLA_SWRST	(1 << 0)
#define SC5_I2C_S_CTRLA_ENABLE	(1 << 1)
#define SC5_I2C_S_CTRLA_MODE(x)	((x) << 2)
#define SC5_I2C_S_CTRLA_MODE_MSK	0x0000001c
#define SC5_I2C_S_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC5_I2C_S_CTRLA_RUNSTDBY	(1 << 7)
#define SC5_I2C_S_CTRLA_PINOUT	(1 << 16)
#define SC5_I2C_S_CTRLA_SDAHOLD(x)	((x) << 20)
#define SC5_I2C_S_CTRLA_SDAHOLD_MSK	0x00300000
#define SC5_I2C_S_CTRLA_SDAHOLD_VAL(x)	(((x) >> 20) & 0x3)
#define SC5_I2C_S_CTRLA_LOWTOUT	(1 << 30)

#define SC5_I2C_S_CTRLA_s    MMIO_REG(0x42001c00, struct __struct_SC5_I2C_S_CTRLA)
struct __struct_SC5_I2C_S_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t pinout : 1;
  uint32_t  : 3;
  uint32_t sdahold : 2;
  uint32_t  : 8;
  uint32_t lowtout : 1;
  uint32_t  : 1;
};

#define SC5_I2C_S_CTRLB	MMIO_REG(0x42001c04, uint32_t)
#define SC5_I2C_S_CTRLB_SMEN	(1 << 8)
#define SC5_I2C_S_CTRLB_AMODE(x)	((x) << 14)
#define SC5_I2C_S_CTRLB_AMODE_MSK	0x0000c000
#define SC5_I2C_S_CTRLB_AMODE_VAL(x)	(((x) >> 14) & 0x3)
#define SC5_I2C_S_CTRLB_CMD(x)	((x) << 16)
#define SC5_I2C_S_CTRLB_CMD_MSK	0x00030000
#define SC5_I2C_S_CTRLB_CMD_VAL(x)	(((x) >> 16) & 0x3)
#define SC5_I2C_S_CTRLB_ACKACT	(1 << 18)

