1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define SC5_I2C_S_CTRLB_s    MMIO_REG(0x42001c04, struct __struct_SC5_I2C_S_CTRLB)
struct __struct_SC5_I2C_S_CTRLB
{
  uint32_t  : 8;
  uint32_t smen : 1;
  uint32_t  : 5;
  uint32_t amode : 2;
  uint32_t cmd : 2;
  uint32_t ackact : 1;
  uint32_t  : 13;
};

#define SC5_I2C_S_INTENCLR	MMIO_REG(0x42001c0c, uint8_t)
#define SC5_I2C_S_INTENCLR_PREC	(1 << 0)
#define SC5_I2C_S_INTENCLR_AMATCH	(1 << 1)
#define SC5_I2C_S_INTENCLR_DRDY	(1 << 2)

#define SC5_I2C_S_INTENCLR_s    MMIO_REG(0x42001c0c, struct __struct_SC5_I2C_S_INTENCLR)
struct __struct_SC5_I2C_S_INTENCLR
{
  uint8_t prec : 1;
  uint8_t amatch : 1;
  uint8_t drdy : 1;
  uint8_t  : 5;
};

#define SC5_I2C_S_INTENSET	MMIO_REG(0x42001c0d, uint8_t)
#define SC5_I2C_S_INTENSET_PREC	(1 << 0)
#define SC5_I2C_S_INTENSET_AMATCH	(1 << 1)
#define SC5_I2C_S_INTENSET_DRDY	(1 << 2)

#define SC5_I2C_S_INTENSET_s    MMIO_REG(0x42001c0d, struct __struct_SC5_I2C_S_INTENSET)
struct __struct_SC5_I2C_S_INTENSET
{
  uint8_t prec : 1;
  uint8_t amatch : 1;
  uint8_t drdy : 1;
  uint8_t  : 5;
};

#define SC5_I2C_S_INTFLAG	MMIO_REG(0x42001c0e, uint8_t)
#define SC5_I2C_S_INTFLAG_PREC	(1 << 0)
#define SC5_I2C_S_INTFLAG_AMATCH	(1 << 1)
#define SC5_I2C_S_INTFLAG_DRDY	(1 << 2)

#define SC5_I2C_S_INTFLAG_s    MMIO_REG(0x42001c0e, struct __struct_SC5_I2C_S_INTFLAG)
struct __struct_SC5_I2C_S_INTFLAG
{
  uint8_t prec : 1;
  uint8_t amatch : 1;
  uint8_t drdy : 1;
  uint8_t  : 5;
};

#define SC5_I2C_S_STATUS	MMIO_REG(0x42001c10, uint16_t)
#define SC5_I2C_S_STATUS_BUSERR	(1 << 0)
#define SC5_I2C_S_STATUS_COLL	(1 << 1)
#define SC5_I2C_S_STATUS_RXNACK	(1 << 2)
#define SC5_I2C_S_STATUS_DIR	(1 << 3)
#define SC5_I2C_S_STATUS_SR	(1 << 4)
#define SC5_I2C_S_STATUS_LOWTOUT	(1 << 6)
#define SC5_I2C_S_STATUS_CLKHOLD	(1 << 7)
#define SC5_I2C_S_STATUS_SYNCBUSY	(1 << 15)

#define SC5_I2C_S_STATUS_s    MMIO_REG(0x42001c10, struct __struct_SC5_I2C_S_STATUS)
struct __struct_SC5_I2C_S_STATUS
{
  uint16_t buserr : 1;
  uint16_t coll : 1;
  uint16_t rxnack : 1;
  uint16_t dir : 1;
  uint16_t sr : 1;
  uint16_t  : 1;
  uint16_t lowtout : 1;
  uint16_t clkhold : 1;
  uint16_t  : 7;
  uint16_t syncbusy : 1;
};

#define SC5_I2C_S_ADDR	MMIO_REG(0x42001c14, uint32_t)
#define SC5_I2C_S_ADDR_GENCEN	(1 << 0)
#define SC5_I2C_S_ADDR_ADDR(x)	((x) << 1)
#define SC5_I2C_S_ADDR_ADDR_MSK	0x000000fe
#define SC5_I2C_S_ADDR_ADDR_VAL(x)	(((x) >> 1) & 0x7f)
#define SC5_I2C_S_ADDR_ADDRMASK(x)	((x) << 17)
#define SC5_I2C_S_ADDR_ADDRMASK_MSK	0x00fe0000
#define SC5_I2C_S_ADDR_ADDRMASK_VAL(x)	(((x) >> 17) & 0x7f)

#define SC5_I2C_S_ADDR_s    MMIO_REG(0x42001c14, struct __struct_SC5_I2C_S_ADDR)
struct __struct_SC5_I2C_S_ADDR
{
  uint32_t gencen : 1;
  uint32_t addr : 7;
  uint32_t  : 9;
  uint32_t addrmask : 7;
  uint32_t  : 8;
};

#define SC5_I2C_S_DATA	MMIO_REG(0x42001c18, uint16_t)
#define SC5_I2C_S_DATA_DATA(x)	((x) << 0)
#define SC5_I2C_S_DATA_DATA_MSK	0x000000ff
#define SC5_I2C_S_DATA_DATA_VAL(x)	(((x) >> 0) & 0xff)

#define SC5_I2C_S_DATA_s    MMIO_REG(0x42001c18, struct __struct_SC5_I2C_S_DATA)
struct __struct_SC5_I2C_S_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

// 0x42001c00 SC5_I2C_M

#define SC5_I2C_M_CTRLA	MMIO_REG(0x42001c00, uint32_t)
#define SC5_I2C_M_CTRLA_SWRST	(1 << 0)
#define SC5_I2C_M_CTRLA_ENABLE	(1 << 1)
#define SC5_I2C_M_CTRLA_MODE(x)	((x) << 2)
#define SC5_I2C_M_CTRLA_MODE_MSK	0x0000001c
#define SC5_I2C_M_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC5_I2C_M_CTRLA_RUNSTDBY	(1 << 7)
#define SC5_I2C_M_CTRLA_PINOUT	(1 << 16)
#define SC5_I2C_M_CTRLA_SDAHOLD(x)	((x) << 20)
#define SC5_I2C_M_CTRLA_SDAHOLD_MSK	0x00300000
#define SC5_I2C_M_CTRLA_SDAHOLD_VAL(x)	(((x) >> 20) & 0x3)
#define SC5_I2C_M_CTRLA_INACTOUT(x)	((x) << 28)
#define SC5_I2C_M_CTRLA_INACTOUT_MSK	0x30000000
#define SC5_I2C_M_CTRLA_INACTOUT_VAL(x)	(((x) >> 28) & 0x3)
#define SC5_I2C_M_CTRLA_LOWTOUT	(1 << 30)

#define SC5_I2C_M_CTRLA_s    MMIO_REG(0x42001c00, struct __struct_SC5_I2C_M_CTRLA)
struct __struct_SC5_I2C_M_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t pinout : 1;
  uint32_t  : 3;
  uint32_t sdahold : 2;
  uint32_t  : 6;
  uint32_t inactout : 2;
  uint32_t lowtout : 1;
  uint32_t  : 1;
};

#define SC5_I2C_M_CTRLB	MMIO_REG(0x42001c04, uint32_t)
#define SC5_I2C_M_CTRLB_SMEN	(1 << 8)
#define SC5_I2C_M_CTRLB_QCEN	(1 << 9)
#define SC5_I2C_M_CTRLB_CMD(x)	((x) << 16)
#define SC5_I2C_M_CTRLB_CMD_MSK	0x00030000
#define SC5_I2C_M_CTRLB_CMD_VAL(x)	(((x) >> 16) & 0x3)
#define SC5_I2C_M_CTRLB_ACKACT	(1 << 18)

#define SC5_I2C_M_CTRLB_s    MMIO_REG(0x42001c04, struct __struct_SC5_I2C_M_CTRLB)
struct __struct_SC5_I2C_M_CTRLB
{
  uint32_t  : 8;
  uint32_t smen : 1;
  uint32_t qcen : 1;
  uint32_t  : 6;
  uint32_t cmd : 2;
  uint32_t ackact : 1;
  uint32_t  : 13;
};

#define SC5_I2C_M_DBGCTRL	MMIO_REG(0x42001c08, uint8_t)
#define SC5_I2C_M_DBGCTRL_DBGSTOP	(1 << 0)

#define SC5_I2C_M_DBGCTRL_s    MMIO_REG(0x42001c08, struct __struct_SC5_I2C_M_DBGCTRL)
struct __struct_SC5_I2C_M_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC5_I2C_M_BAUD	MMIO_REG(0x42001c0a, uint16_t)
#define SC5_I2C_M_BAUD_BAUD(x)	((x) << 0)
#define SC5_I2C_M_BAUD_BAUD_MSK	0x000000ff
#define SC5_I2C_M_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)
#define SC5_I2C_M_BAUD_BAUDLOW(x)	((x) << 8)
#define SC5_I2C_M_BAUD_BAUDLOW_MSK	0x0000ff00
#define SC5_I2C_M_BAUD_BAUDLOW_VAL(x)	(((x) >> 8) & 0xff)

#define SC5_I2C_M_BAUD_s    MMIO_REG(0x42001c0a, struct __struct_SC5_I2C_M_BAUD)
struct __struct_SC5_I2C_M_BAUD
{
  uint16_t baud : 8;
  uint16_t baudlow : 8;
};

#define SC5_I2C_M_INTENCLR	MMIO_REG(0x42001c0c, uint8_t)
#define SC5_I2C_M_INTENCLR_MB	(1 << 0)
#define SC5_I2C_M_INTENCLR_SB	(1 << 1)

#define SC5_I2C_M_INTENCLR_s    MMIO_REG(0x42001c0c, struct __struct_SC5_I2C_M_INTENCLR)
struct __struct_SC5_I2C_M_INTENCLR
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC5_I2C_M_INTENSET	MMIO_REG(0x42001c0d, uint8_t)
#define SC5_I2C_M_INTENSET_MB	(1 << 0)
#define SC5_I2C_M_INTENSET_SB	(1 << 1)

