1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define SC5_I2C_M_INTENSET_s    MMIO_REG(0x42001c0d, struct __struct_SC5_I2C_M_INTENSET)
struct __struct_SC5_I2C_M_INTENSET
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC5_I2C_M_INTFLAG	MMIO_REG(0x42001c0e, uint8_t)
#define SC5_I2C_M_INTFLAG_MB	(1 << 0)
#define SC5_I2C_M_INTFLAG_SB	(1 << 1)

#define SC5_I2C_M_INTFLAG_s    MMIO_REG(0x42001c0e, struct __struct_SC5_I2C_M_INTFLAG)
struct __struct_SC5_I2C_M_INTFLAG
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 6;
};

#define SC5_I2C_M_STATUS	MMIO_REG(0x42001c10, uint16_t)
#define SC5_I2C_M_STATUS_BUSERR	(1 << 0)
#define SC5_I2C_M_STATUS_ARBLOST	(1 << 1)
#define SC5_I2C_M_STATUS_RXNACK	(1 << 2)
#define SC5_I2C_M_STATUS_BUSSTATE(x)	((x) << 4)
#define SC5_I2C_M_STATUS_BUSSTATE_MSK	0x00000030
#define SC5_I2C_M_STATUS_BUSSTATE_VAL(x)	(((x) >> 4) & 0x3)
#define SC5_I2C_M_STATUS_LOWTOUT	(1 << 6)
#define SC5_I2C_M_STATUS_CLKHOLD	(1 << 7)
#define SC5_I2C_M_STATUS_SYNCBUSY	(1 << 15)

#define SC5_I2C_M_STATUS_s    MMIO_REG(0x42001c10, struct __struct_SC5_I2C_M_STATUS)
struct __struct_SC5_I2C_M_STATUS
{
  uint16_t buserr : 1;
  uint16_t arblost : 1;
  uint16_t rxnack : 1;
  uint16_t  : 1;
  uint16_t busstate : 2;
  uint16_t lowtout : 1;
  uint16_t clkhold : 1;
  uint16_t  : 7;
  uint16_t syncbusy : 1;
};

#define SC5_I2C_M_ADDR	MMIO_REG(0x42001c14, uint16_t)
#define SC5_I2C_M_ADDR_ADDR(x)	((x) << 0)
#define SC5_I2C_M_ADDR_ADDR_MSK	0x000000ff
#define SC5_I2C_M_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)

#define SC5_I2C_M_ADDR_s    MMIO_REG(0x42001c14, struct __struct_SC5_I2C_M_ADDR)
struct __struct_SC5_I2C_M_ADDR
{
  uint16_t addr : 8;
  uint16_t  : 8;
};

#define SC5_I2C_M_DATA	MMIO_REG(0x42001c18, uint16_t)
#define SC5_I2C_M_DATA_DATA(x)	((x) << 0)
#define SC5_I2C_M_DATA_DATA_MSK	0x000000ff
#define SC5_I2C_M_DATA_DATA_VAL(x)	(((x) >> 0) & 0xff)

#define SC5_I2C_M_DATA_s    MMIO_REG(0x42001c18, struct __struct_SC5_I2C_M_DATA)
struct __struct_SC5_I2C_M_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

// 0x42002000 TC0_8

#define TC0_8_CTRLA	MMIO_REG(0x42002000, uint16_t)
#define TC0_8_CTRLA_SWRST	(1 << 0)
#define TC0_8_CTRLA_ENABLE	(1 << 1)
#define TC0_8_CTRLA_MODE(x)	((x) << 2)
#define TC0_8_CTRLA_MODE_MSK	0x0000000c
#define TC0_8_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x3)
#define TC0_8_CTRLA_WAVEGEN(x)	((x) << 5)
#define TC0_8_CTRLA_WAVEGEN_MSK	0x00000060
#define TC0_8_CTRLA_WAVEGEN_VAL(x)	(((x) >> 5) & 0x3)
#define TC0_8_CTRLA_PRESCALER(x)	((x) << 8)
#define TC0_8_CTRLA_PRESCALER_MSK	0x00000700
#define TC0_8_CTRLA_PRESCALER_VAL(x)	(((x) >> 8) & 0x7)
#define TC0_8_CTRLA_RUNSTDBY	(1 << 11)
#define TC0_8_CTRLA_PRESCSYNC(x)	((x) << 12)
#define TC0_8_CTRLA_PRESCSYNC_MSK	0x00003000
#define TC0_8_CTRLA_PRESCSYNC_VAL(x)	(((x) >> 12) & 0x3)

#define TC0_8_CTRLA_s    MMIO_REG(0x42002000, struct __struct_TC0_8_CTRLA)
struct __struct_TC0_8_CTRLA
{
  uint16_t swrst : 1;
  uint16_t enable : 1;
  uint16_t mode : 2;
  uint16_t  : 1;
  uint16_t wavegen : 2;
  uint16_t  : 1;
  uint16_t prescaler : 3;
  uint16_t runstdby : 1;
  uint16_t prescsync : 2;
  uint16_t  : 2;
};

#define TC0_8_READREQ	MMIO_REG(0x42002002, uint16_t)
#define TC0_8_READREQ_ADDR(x)	((x) << 0)
#define TC0_8_READREQ_ADDR_MSK	0x0000001f
#define TC0_8_READREQ_ADDR_VAL(x)	(((x) >> 0) & 0x1f)
#define TC0_8_READREQ_RCONT	(1 << 14)
#define TC0_8_READREQ_RREQ	(1 << 15)

#define TC0_8_READREQ_s    MMIO_REG(0x42002002, struct __struct_TC0_8_READREQ)
struct __struct_TC0_8_READREQ
{
  uint16_t addr : 5;
  uint16_t  : 9;
  uint16_t rcont : 1;
  uint16_t rreq : 1;
};

#define TC0_8_CTRLBCLR	MMIO_REG(0x42002004, uint8_t)
#define TC0_8_CTRLBCLR_DIR	(1 << 0)
#define TC0_8_CTRLBCLR_ONESHOT	(1 << 2)
#define TC0_8_CTRLBCLR_CMD(x)	((x) << 6)
#define TC0_8_CTRLBCLR_CMD_MSK	0x000000c0
#define TC0_8_CTRLBCLR_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC0_8_CTRLBCLR_s    MMIO_REG(0x42002004, struct __struct_TC0_8_CTRLBCLR)
struct __struct_TC0_8_CTRLBCLR
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC0_8_CTRLBSET	MMIO_REG(0x42002005, uint8_t)
#define TC0_8_CTRLBSET_DIR	(1 << 0)
#define TC0_8_CTRLBSET_ONESHOT	(1 << 2)
#define TC0_8_CTRLBSET_CMD(x)	((x) << 6)
#define TC0_8_CTRLBSET_CMD_MSK	0x000000c0
#define TC0_8_CTRLBSET_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC0_8_CTRLBSET_s    MMIO_REG(0x42002005, struct __struct_TC0_8_CTRLBSET)
struct __struct_TC0_8_CTRLBSET
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC0_8_CTRLC	MMIO_REG(0x42002006, uint8_t)
#define TC0_8_CTRLC_INVEN0	(1 << 0)
#define TC0_8_CTRLC_INVEN1	(1 << 1)
#define TC0_8_CTRLC_CPTEN0	(1 << 4)
#define TC0_8_CTRLC_CPTEN1	(1 << 5)

#define TC0_8_CTRLC_s    MMIO_REG(0x42002006, struct __struct_TC0_8_CTRLC)
struct __struct_TC0_8_CTRLC
{
  uint8_t inven0 : 1;
  uint8_t inven1 : 1;
  uint8_t  : 2;
  uint8_t cpten0 : 1;
  uint8_t cpten1 : 1;
  uint8_t  : 2;
};

#define TC0_8_DBGCTRL	MMIO_REG(0x42002008, uint8_t)
#define TC0_8_DBGCTRL_DBGRUN	(1 << 0)

#define TC0_8_DBGCTRL_s    MMIO_REG(0x42002008, struct __struct_TC0_8_DBGCTRL)
struct __struct_TC0_8_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

#define TC0_8_EVCTRL	MMIO_REG(0x4200200a, uint16_t)
#define TC0_8_EVCTRL_EVACT(x)	((x) << 0)
#define TC0_8_EVCTRL_EVACT_MSK	0x00000007
#define TC0_8_EVCTRL_EVACT_VAL(x)	(((x) >> 0) & 0x7)
#define TC0_8_EVCTRL_TCINV	(1 << 4)
#define TC0_8_EVCTRL_TCEI	(1 << 5)
#define TC0_8_EVCTRL_OVFEO	(1 << 8)
#define TC0_8_EVCTRL_MCEO0	(1 << 12)
#define TC0_8_EVCTRL_MCEO1	(1 << 13)

#define TC0_8_EVCTRL_s    MMIO_REG(0x4200200a, struct __struct_TC0_8_EVCTRL)
struct __struct_TC0_8_EVCTRL
{
  uint16_t evact : 3;
  uint16_t  : 1;
  uint16_t tcinv : 1;
  uint16_t tcei : 1;
  uint16_t  : 2;
  uint16_t ovfeo : 1;
  uint16_t  : 3;
  uint16_t mceo0 : 1;
  uint16_t mceo1 : 1;
  uint16_t  : 2;
};

#define TC0_8_INTENCLR	MMIO_REG(0x4200200c, uint8_t)
#define TC0_8_INTENCLR_OVF	(1 << 0)
#define TC0_8_INTENCLR_ERR	(1 << 1)
#define TC0_8_INTENCLR_SYNCRDY	(1 << 3)
#define TC0_8_INTENCLR_MC0	(1 << 4)
#define TC0_8_INTENCLR_MC1	(1 << 5)

#define TC0_8_INTENCLR_s    MMIO_REG(0x4200200c, struct __struct_TC0_8_INTENCLR)
struct __struct_TC0_8_INTENCLR
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC0_8_INTENSET	MMIO_REG(0x4200200d, uint8_t)
#define TC0_8_INTENSET_OVF	(1 << 0)
#define TC0_8_INTENSET_ERR	(1 << 1)
#define TC0_8_INTENSET_SYNCRDY	(1 << 3)
#define TC0_8_INTENSET_MC0	(1 << 4)
#define TC0_8_INTENSET_MC1	(1 << 5)

#define TC0_8_INTENSET_s    MMIO_REG(0x4200200d, struct __struct_TC0_8_INTENSET)
struct __struct_TC0_8_INTENSET
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

