1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define TC4_16_CTRLBCLR	MMIO_REG(0x42003004, uint8_t)
#define TC4_16_CTRLBCLR_DIR	(1 << 0)
#define TC4_16_CTRLBCLR_ONESHOT	(1 << 2)
#define TC4_16_CTRLBCLR_CMD(x)	((x) << 6)
#define TC4_16_CTRLBCLR_CMD_MSK	0x000000c0
#define TC4_16_CTRLBCLR_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC4_16_CTRLBCLR_s    MMIO_REG(0x42003004, struct __struct_TC4_16_CTRLBCLR)
struct __struct_TC4_16_CTRLBCLR
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC4_16_CTRLBSET	MMIO_REG(0x42003005, uint8_t)
#define TC4_16_CTRLBSET_DIR	(1 << 0)
#define TC4_16_CTRLBSET_ONESHOT	(1 << 2)
#define TC4_16_CTRLBSET_CMD(x)	((x) << 6)
#define TC4_16_CTRLBSET_CMD_MSK	0x000000c0
#define TC4_16_CTRLBSET_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC4_16_CTRLBSET_s    MMIO_REG(0x42003005, struct __struct_TC4_16_CTRLBSET)
struct __struct_TC4_16_CTRLBSET
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC4_16_CTRLC	MMIO_REG(0x42003006, uint8_t)
#define TC4_16_CTRLC_INVEN0	(1 << 0)
#define TC4_16_CTRLC_INVEN1	(1 << 1)
#define TC4_16_CTRLC_CPTEN0	(1 << 4)
#define TC4_16_CTRLC_CPTEN1	(1 << 5)

#define TC4_16_CTRLC_s    MMIO_REG(0x42003006, struct __struct_TC4_16_CTRLC)
struct __struct_TC4_16_CTRLC
{
  uint8_t inven0 : 1;
  uint8_t inven1 : 1;
  uint8_t  : 2;
  uint8_t cpten0 : 1;
  uint8_t cpten1 : 1;
  uint8_t  : 2;
};

#define TC4_16_DBGCTRL	MMIO_REG(0x42003008, uint8_t)
#define TC4_16_DBGCTRL_DBGRUN	(1 << 0)

#define TC4_16_DBGCTRL_s    MMIO_REG(0x42003008, struct __struct_TC4_16_DBGCTRL)
struct __struct_TC4_16_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

#define TC4_16_EVCTRL	MMIO_REG(0x4200300a, uint16_t)
#define TC4_16_EVCTRL_EVACT(x)	((x) << 0)
#define TC4_16_EVCTRL_EVACT_MSK	0x00000007
#define TC4_16_EVCTRL_EVACT_VAL(x)	(((x) >> 0) & 0x7)
#define TC4_16_EVCTRL_TCINV	(1 << 4)
#define TC4_16_EVCTRL_TCEI	(1 << 5)
#define TC4_16_EVCTRL_OVFEO	(1 << 8)
#define TC4_16_EVCTRL_MCEO0	(1 << 12)
#define TC4_16_EVCTRL_MCEO1	(1 << 13)

#define TC4_16_EVCTRL_s    MMIO_REG(0x4200300a, struct __struct_TC4_16_EVCTRL)
struct __struct_TC4_16_EVCTRL
{
  uint16_t evact : 3;
  uint16_t  : 1;
  uint16_t tcinv : 1;
  uint16_t tcei : 1;
  uint16_t  : 2;
  uint16_t ovfeo : 1;
  uint16_t  : 3;
  uint16_t mceo0 : 1;
  uint16_t mceo1 : 1;
  uint16_t  : 2;
};

#define TC4_16_INTENCLR	MMIO_REG(0x4200300c, uint8_t)
#define TC4_16_INTENCLR_OVF	(1 << 0)
#define TC4_16_INTENCLR_ERR	(1 << 1)
#define TC4_16_INTENCLR_SYNCRDY	(1 << 3)
#define TC4_16_INTENCLR_MC0	(1 << 4)
#define TC4_16_INTENCLR_MC1	(1 << 5)

#define TC4_16_INTENCLR_s    MMIO_REG(0x4200300c, struct __struct_TC4_16_INTENCLR)
struct __struct_TC4_16_INTENCLR
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC4_16_INTENSET	MMIO_REG(0x4200300d, uint8_t)
#define TC4_16_INTENSET_OVF	(1 << 0)
#define TC4_16_INTENSET_ERR	(1 << 1)
#define TC4_16_INTENSET_SYNCRDY	(1 << 3)
#define TC4_16_INTENSET_MC0	(1 << 4)
#define TC4_16_INTENSET_MC1	(1 << 5)

#define TC4_16_INTENSET_s    MMIO_REG(0x4200300d, struct __struct_TC4_16_INTENSET)
struct __struct_TC4_16_INTENSET
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC4_16_INTFLAG	MMIO_REG(0x4200300e, uint8_t)
#define TC4_16_INTFLAG_OVF	(1 << 0)
#define TC4_16_INTFLAG_ERR	(1 << 1)
#define TC4_16_INTFLAG_SYNCRDY	(1 << 3)
#define TC4_16_INTFLAG_MC0	(1 << 4)
#define TC4_16_INTFLAG_MC1	(1 << 5)

#define TC4_16_INTFLAG_s    MMIO_REG(0x4200300e, struct __struct_TC4_16_INTFLAG)
struct __struct_TC4_16_INTFLAG
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC4_16_STATUS	MMIO_REG(0x4200300f, uint8_t)
#define TC4_16_STATUS_STOP	(1 << 3)
#define TC4_16_STATUS_SLAVE	(1 << 4)
#define TC4_16_STATUS_SYNCBUSY	(1 << 7)

#define TC4_16_STATUS_s    MMIO_REG(0x4200300f, struct __struct_TC4_16_STATUS)
struct __struct_TC4_16_STATUS
{
  uint8_t  : 3;
  uint8_t stop : 1;
  uint8_t slave : 1;
  uint8_t  : 2;
  uint8_t syncbusy : 1;
};

#define TC4_16_COUNT	MMIO_REG(0x42003010, uint16_t)
#define TC4_16_COUNT_COUNT(x)	((x) << 0)
#define TC4_16_COUNT_COUNT_MSK	0x0000ffff
#define TC4_16_COUNT_COUNT_VAL(x)	(((x) >> 0) & 0xffff)

#define TC4_16_COUNT_s    MMIO_REG(0x42003010, struct __struct_TC4_16_COUNT)
struct __struct_TC4_16_COUNT
{
  uint16_t count : 16;
};

#define TC4_16_CC0	MMIO_REG(0x42003018, uint16_t)
#define TC4_16_CC0_CC(x)	((x) << 0)
#define TC4_16_CC0_CC_MSK	0x0000ffff
#define TC4_16_CC0_CC_VAL(x)	(((x) >> 0) & 0xffff)

#define TC4_16_CC0_s    MMIO_REG(0x42003018, struct __struct_TC4_16_CC0)
struct __struct_TC4_16_CC0
{
  uint16_t cc : 16;
};

#define TC4_16_CC1	MMIO_REG(0x4200301a, uint16_t)
#define TC4_16_CC1_CC(x)	((x) << 0)
#define TC4_16_CC1_CC_MSK	0x0000ffff
#define TC4_16_CC1_CC_VAL(x)	(((x) >> 0) & 0xffff)

#define TC4_16_CC1_s    MMIO_REG(0x4200301a, struct __struct_TC4_16_CC1)
struct __struct_TC4_16_CC1
{
  uint16_t cc : 16;
};

// 0x42003000 TC4_32

#define TC4_32_CTRLA	MMIO_REG(0x42003000, uint16_t)
#define TC4_32_CTRLA_SWRST	(1 << 0)
#define TC4_32_CTRLA_ENABLE	(1 << 1)
#define TC4_32_CTRLA_MODE(x)	((x) << 2)
#define TC4_32_CTRLA_MODE_MSK	0x0000000c
#define TC4_32_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x3)
#define TC4_32_CTRLA_WAVEGEN(x)	((x) << 5)
#define TC4_32_CTRLA_WAVEGEN_MSK	0x00000060
#define TC4_32_CTRLA_WAVEGEN_VAL(x)	(((x) >> 5) & 0x3)
#define TC4_32_CTRLA_PRESCALER(x)	((x) << 8)
#define TC4_32_CTRLA_PRESCALER_MSK	0x00000700
#define TC4_32_CTRLA_PRESCALER_VAL(x)	(((x) >> 8) & 0x7)
#define TC4_32_CTRLA_RUNSTDBY	(1 << 11)
#define TC4_32_CTRLA_PRESCSYNC(x)	((x) << 12)
#define TC4_32_CTRLA_PRESCSYNC_MSK	0x00003000
#define TC4_32_CTRLA_PRESCSYNC_VAL(x)	(((x) >> 12) & 0x3)

#define TC4_32_CTRLA_s    MMIO_REG(0x42003000, struct __struct_TC4_32_CTRLA)
struct __struct_TC4_32_CTRLA
{
  uint16_t swrst : 1;
  uint16_t enable : 1;
  uint16_t mode : 2;
  uint16_t  : 1;
  uint16_t wavegen : 2;
  uint16_t  : 1;
  uint16_t prescaler : 3;
  uint16_t runstdby : 1;
  uint16_t prescsync : 2;
  uint16_t  : 2;
};

#define TC4_32_READREQ	MMIO_REG(0x42003002, uint16_t)
#define TC4_32_READREQ_ADDR(x)	((x) << 0)
#define TC4_32_READREQ_ADDR_MSK	0x0000001f
#define TC4_32_READREQ_ADDR_VAL(x)	(((x) >> 0) & 0x1f)
#define TC4_32_READREQ_RCONT	(1 << 14)
#define TC4_32_READREQ_RREQ	(1 << 15)

#define TC4_32_READREQ_s    MMIO_REG(0x42003002, struct __struct_TC4_32_READREQ)
struct __struct_TC4_32_READREQ
{
  uint16_t addr : 5;
  uint16_t  : 9;
  uint16_t rcont : 1;
  uint16_t rreq : 1;
};

