1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define TC5_32_CTRLBCLR_s    MMIO_REG(0x42003404, struct __struct_TC5_32_CTRLBCLR)
struct __struct_TC5_32_CTRLBCLR
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC5_32_CTRLBSET	MMIO_REG(0x42003405, uint8_t)
#define TC5_32_CTRLBSET_DIR	(1 << 0)
#define TC5_32_CTRLBSET_ONESHOT	(1 << 2)
#define TC5_32_CTRLBSET_CMD(x)	((x) << 6)
#define TC5_32_CTRLBSET_CMD_MSK	0x000000c0
#define TC5_32_CTRLBSET_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC5_32_CTRLBSET_s    MMIO_REG(0x42003405, struct __struct_TC5_32_CTRLBSET)
struct __struct_TC5_32_CTRLBSET
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC5_32_CTRLC	MMIO_REG(0x42003406, uint8_t)
#define TC5_32_CTRLC_INVEN0	(1 << 0)
#define TC5_32_CTRLC_INVEN1	(1 << 1)
#define TC5_32_CTRLC_CPTEN0	(1 << 4)
#define TC5_32_CTRLC_CPTEN1	(1 << 5)

#define TC5_32_CTRLC_s    MMIO_REG(0x42003406, struct __struct_TC5_32_CTRLC)
struct __struct_TC5_32_CTRLC
{
  uint8_t inven0 : 1;
  uint8_t inven1 : 1;
  uint8_t  : 2;
  uint8_t cpten0 : 1;
  uint8_t cpten1 : 1;
  uint8_t  : 2;
};

#define TC5_32_DBGCTRL	MMIO_REG(0x42003408, uint8_t)
#define TC5_32_DBGCTRL_DBGRUN	(1 << 0)

#define TC5_32_DBGCTRL_s    MMIO_REG(0x42003408, struct __struct_TC5_32_DBGCTRL)
struct __struct_TC5_32_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

#define TC5_32_EVCTRL	MMIO_REG(0x4200340a, uint16_t)
#define TC5_32_EVCTRL_EVACT(x)	((x) << 0)
#define TC5_32_EVCTRL_EVACT_MSK	0x00000007
#define TC5_32_EVCTRL_EVACT_VAL(x)	(((x) >> 0) & 0x7)
#define TC5_32_EVCTRL_TCINV	(1 << 4)
#define TC5_32_EVCTRL_TCEI	(1 << 5)
#define TC5_32_EVCTRL_OVFEO	(1 << 8)
#define TC5_32_EVCTRL_MCEO0	(1 << 12)
#define TC5_32_EVCTRL_MCEO1	(1 << 13)

#define TC5_32_EVCTRL_s    MMIO_REG(0x4200340a, struct __struct_TC5_32_EVCTRL)
struct __struct_TC5_32_EVCTRL
{
  uint16_t evact : 3;
  uint16_t  : 1;
  uint16_t tcinv : 1;
  uint16_t tcei : 1;
  uint16_t  : 2;
  uint16_t ovfeo : 1;
  uint16_t  : 3;
  uint16_t mceo0 : 1;
  uint16_t mceo1 : 1;
  uint16_t  : 2;
};

#define TC5_32_INTENCLR	MMIO_REG(0x4200340c, uint8_t)
#define TC5_32_INTENCLR_OVF	(1 << 0)
#define TC5_32_INTENCLR_ERR	(1 << 1)
#define TC5_32_INTENCLR_SYNCRDY	(1 << 3)
#define TC5_32_INTENCLR_MC0	(1 << 4)
#define TC5_32_INTENCLR_MC1	(1 << 5)

#define TC5_32_INTENCLR_s    MMIO_REG(0x4200340c, struct __struct_TC5_32_INTENCLR)
struct __struct_TC5_32_INTENCLR
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC5_32_INTENSET	MMIO_REG(0x4200340d, uint8_t)
#define TC5_32_INTENSET_OVF	(1 << 0)
#define TC5_32_INTENSET_ERR	(1 << 1)
#define TC5_32_INTENSET_SYNCRDY	(1 << 3)
#define TC5_32_INTENSET_MC0	(1 << 4)
#define TC5_32_INTENSET_MC1	(1 << 5)

#define TC5_32_INTENSET_s    MMIO_REG(0x4200340d, struct __struct_TC5_32_INTENSET)
struct __struct_TC5_32_INTENSET
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC5_32_INTFLAG	MMIO_REG(0x4200340e, uint8_t)
#define TC5_32_INTFLAG_OVF	(1 << 0)
#define TC5_32_INTFLAG_ERR	(1 << 1)
#define TC5_32_INTFLAG_SYNCRDY	(1 << 3)
#define TC5_32_INTFLAG_MC0	(1 << 4)
#define TC5_32_INTFLAG_MC1	(1 << 5)

#define TC5_32_INTFLAG_s    MMIO_REG(0x4200340e, struct __struct_TC5_32_INTFLAG)
struct __struct_TC5_32_INTFLAG
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC5_32_STATUS	MMIO_REG(0x4200340f, uint8_t)
#define TC5_32_STATUS_STOP	(1 << 3)
#define TC5_32_STATUS_SLAVE	(1 << 4)
#define TC5_32_STATUS_SYNCBUSY	(1 << 7)

#define TC5_32_STATUS_s    MMIO_REG(0x4200340f, struct __struct_TC5_32_STATUS)
struct __struct_TC5_32_STATUS
{
  uint8_t  : 3;
  uint8_t stop : 1;
  uint8_t slave : 1;
  uint8_t  : 2;
  uint8_t syncbusy : 1;
};

#define TC5_32_COUNT	MMIO_REG(0x42003410, uint32_t)
#define TC5_32_COUNT_COUNT(x)	((x) << 0)
#define TC5_32_COUNT_COUNT_MSK	0xffffffff
#define TC5_32_COUNT_COUNT_VAL(x)	(((x) >> 0) & 0xffffffff)

#define TC5_32_COUNT_s    MMIO_REG(0x42003410, struct __struct_TC5_32_COUNT)
struct __struct_TC5_32_COUNT
{
  uint32_t count : 32;
};

#define TC5_32_CC0	MMIO_REG(0x42003418, uint32_t)
#define TC5_32_CC0_CC(x)	((x) << 0)
#define TC5_32_CC0_CC_MSK	0xffffffff
#define TC5_32_CC0_CC_VAL(x)	(((x) >> 0) & 0xffffffff)

#define TC5_32_CC0_s    MMIO_REG(0x42003418, struct __struct_TC5_32_CC0)
struct __struct_TC5_32_CC0
{
  uint32_t cc : 32;
};

#define TC5_32_CC1	MMIO_REG(0x4200341c, uint32_t)
#define TC5_32_CC1_CC(x)	((x) << 0)
#define TC5_32_CC1_CC_MSK	0xffffffff
#define TC5_32_CC1_CC_VAL(x)	(((x) >> 0) & 0xffffffff)

#define TC5_32_CC1_s    MMIO_REG(0x4200341c, struct __struct_TC5_32_CC1)
struct __struct_TC5_32_CC1
{
  uint32_t cc : 32;
};

// 0x42003800 TC6_8

#define TC6_8_CTRLA	MMIO_REG(0x42003800, uint16_t)
#define TC6_8_CTRLA_SWRST	(1 << 0)
#define TC6_8_CTRLA_ENABLE	(1 << 1)
#define TC6_8_CTRLA_MODE(x)	((x) << 2)
#define TC6_8_CTRLA_MODE_MSK	0x0000000c
#define TC6_8_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x3)
#define TC6_8_CTRLA_WAVEGEN(x)	((x) << 5)
#define TC6_8_CTRLA_WAVEGEN_MSK	0x00000060
#define TC6_8_CTRLA_WAVEGEN_VAL(x)	(((x) >> 5) & 0x3)
#define TC6_8_CTRLA_PRESCALER(x)	((x) << 8)
#define TC6_8_CTRLA_PRESCALER_MSK	0x00000700
#define TC6_8_CTRLA_PRESCALER_VAL(x)	(((x) >> 8) & 0x7)
#define TC6_8_CTRLA_RUNSTDBY	(1 << 11)
#define TC6_8_CTRLA_PRESCSYNC(x)	((x) << 12)
#define TC6_8_CTRLA_PRESCSYNC_MSK	0x00003000
#define TC6_8_CTRLA_PRESCSYNC_VAL(x)	(((x) >> 12) & 0x3)

#define TC6_8_CTRLA_s    MMIO_REG(0x42003800, struct __struct_TC6_8_CTRLA)
struct __struct_TC6_8_CTRLA
{
  uint16_t swrst : 1;
  uint16_t enable : 1;
  uint16_t mode : 2;
  uint16_t  : 1;
  uint16_t wavegen : 2;
  uint16_t  : 1;
  uint16_t prescaler : 3;
  uint16_t runstdby : 1;
  uint16_t prescsync : 2;
  uint16_t  : 2;
};

#define TC6_8_READREQ	MMIO_REG(0x42003802, uint16_t)
#define TC6_8_READREQ_ADDR(x)	((x) << 0)
#define TC6_8_READREQ_ADDR_MSK	0x0000001f
#define TC6_8_READREQ_ADDR_VAL(x)	(((x) >> 0) & 0x1f)
#define TC6_8_READREQ_RCONT	(1 << 14)
#define TC6_8_READREQ_RREQ	(1 << 15)

#define TC6_8_READREQ_s    MMIO_REG(0x42003802, struct __struct_TC6_8_READREQ)
struct __struct_TC6_8_READREQ
{
  uint16_t addr : 5;
  uint16_t  : 9;
  uint16_t rcont : 1;
  uint16_t rreq : 1;
};

#define TC6_8_CTRLBCLR	MMIO_REG(0x42003804, uint8_t)
#define TC6_8_CTRLBCLR_DIR	(1 << 0)
#define TC6_8_CTRLBCLR_ONESHOT	(1 << 2)
#define TC6_8_CTRLBCLR_CMD(x)	((x) << 6)
#define TC6_8_CTRLBCLR_CMD_MSK	0x000000c0
#define TC6_8_CTRLBCLR_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC6_8_CTRLBCLR_s    MMIO_REG(0x42003804, struct __struct_TC6_8_CTRLBCLR)
struct __struct_TC6_8_CTRLBCLR
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC6_8_CTRLBSET	MMIO_REG(0x42003805, uint8_t)
#define TC6_8_CTRLBSET_DIR	(1 << 0)
#define TC6_8_CTRLBSET_ONESHOT	(1 << 2)
#define TC6_8_CTRLBSET_CMD(x)	((x) << 6)
#define TC6_8_CTRLBSET_CMD_MSK	0x000000c0
#define TC6_8_CTRLBSET_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC6_8_CTRLBSET_s    MMIO_REG(0x42003805, struct __struct_TC6_8_CTRLBSET)
struct __struct_TC6_8_CTRLBSET
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC6_8_CTRLC	MMIO_REG(0x42003806, uint8_t)
#define TC6_8_CTRLC_INVEN0	(1 << 0)
#define TC6_8_CTRLC_INVEN1	(1 << 1)
#define TC6_8_CTRLC_CPTEN0	(1 << 4)
#define TC6_8_CTRLC_CPTEN1	(1 << 5)

