1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define TC7_8_INTENSET	MMIO_REG(0x42003c0d, uint8_t)
#define TC7_8_INTENSET_OVF	(1 << 0)
#define TC7_8_INTENSET_ERR	(1 << 1)
#define TC7_8_INTENSET_SYNCRDY	(1 << 3)
#define TC7_8_INTENSET_MC0	(1 << 4)
#define TC7_8_INTENSET_MC1	(1 << 5)

#define TC7_8_INTENSET_s    MMIO_REG(0x42003c0d, struct __struct_TC7_8_INTENSET)
struct __struct_TC7_8_INTENSET
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC7_8_INTFLAG	MMIO_REG(0x42003c0e, uint8_t)
#define TC7_8_INTFLAG_OVF	(1 << 0)
#define TC7_8_INTFLAG_ERR	(1 << 1)
#define TC7_8_INTFLAG_SYNCRDY	(1 << 3)
#define TC7_8_INTFLAG_MC0	(1 << 4)
#define TC7_8_INTFLAG_MC1	(1 << 5)

#define TC7_8_INTFLAG_s    MMIO_REG(0x42003c0e, struct __struct_TC7_8_INTFLAG)
struct __struct_TC7_8_INTFLAG
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC7_8_STATUS	MMIO_REG(0x42003c0f, uint8_t)
#define TC7_8_STATUS_STOP	(1 << 3)
#define TC7_8_STATUS_SLAVE	(1 << 4)
#define TC7_8_STATUS_SYNCBUSY	(1 << 7)

#define TC7_8_STATUS_s    MMIO_REG(0x42003c0f, struct __struct_TC7_8_STATUS)
struct __struct_TC7_8_STATUS
{
  uint8_t  : 3;
  uint8_t stop : 1;
  uint8_t slave : 1;
  uint8_t  : 2;
  uint8_t syncbusy : 1;
};

#define TC7_8_COUNT	MMIO_REG(0x42003c10, uint8_t)
#define TC7_8_COUNT_COUNT(x)	((x) << 0)
#define TC7_8_COUNT_COUNT_MSK	0x000000ff
#define TC7_8_COUNT_COUNT_VAL(x)	(((x) >> 0) & 0xff)

#define TC7_8_COUNT_s    MMIO_REG(0x42003c10, struct __struct_TC7_8_COUNT)
struct __struct_TC7_8_COUNT
{
  uint8_t count : 8;
};

#define TC7_8_PER	MMIO_REG(0x42003c14, uint8_t)
#define TC7_8_PER_PER(x)	((x) << 0)
#define TC7_8_PER_PER_MSK	0x000000ff
#define TC7_8_PER_PER_VAL(x)	(((x) >> 0) & 0xff)

#define TC7_8_PER_s    MMIO_REG(0x42003c14, struct __struct_TC7_8_PER)
struct __struct_TC7_8_PER
{
  uint8_t per : 8;
};

#define TC7_8_CC0	MMIO_REG(0x42003c18, uint8_t)
#define TC7_8_CC0_CC(x)	((x) << 0)
#define TC7_8_CC0_CC_MSK	0x000000ff
#define TC7_8_CC0_CC_VAL(x)	(((x) >> 0) & 0xff)

#define TC7_8_CC0_s    MMIO_REG(0x42003c18, struct __struct_TC7_8_CC0)
struct __struct_TC7_8_CC0
{
  uint8_t cc : 8;
};

#define TC7_8_CC1	MMIO_REG(0x42003c19, uint8_t)
#define TC7_8_CC1_CC(x)	((x) << 0)
#define TC7_8_CC1_CC_MSK	0x000000ff
#define TC7_8_CC1_CC_VAL(x)	(((x) >> 0) & 0xff)

#define TC7_8_CC1_s    MMIO_REG(0x42003c19, struct __struct_TC7_8_CC1)
struct __struct_TC7_8_CC1
{
  uint8_t cc : 8;
};

// 0x42003c00 TC7_16

#define TC7_16_CTRLA	MMIO_REG(0x42003c00, uint16_t)
#define TC7_16_CTRLA_SWRST	(1 << 0)
#define TC7_16_CTRLA_ENABLE	(1 << 1)
#define TC7_16_CTRLA_MODE(x)	((x) << 2)
#define TC7_16_CTRLA_MODE_MSK	0x0000000c
#define TC7_16_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x3)
#define TC7_16_CTRLA_WAVEGEN(x)	((x) << 5)
#define TC7_16_CTRLA_WAVEGEN_MSK	0x00000060
#define TC7_16_CTRLA_WAVEGEN_VAL(x)	(((x) >> 5) & 0x3)
#define TC7_16_CTRLA_PRESCALER(x)	((x) << 8)
#define TC7_16_CTRLA_PRESCALER_MSK	0x00000700
#define TC7_16_CTRLA_PRESCALER_VAL(x)	(((x) >> 8) & 0x7)
#define TC7_16_CTRLA_RUNSTDBY	(1 << 11)
#define TC7_16_CTRLA_PRESCSYNC(x)	((x) << 12)
#define TC7_16_CTRLA_PRESCSYNC_MSK	0x00003000
#define TC7_16_CTRLA_PRESCSYNC_VAL(x)	(((x) >> 12) & 0x3)

#define TC7_16_CTRLA_s    MMIO_REG(0x42003c00, struct __struct_TC7_16_CTRLA)
struct __struct_TC7_16_CTRLA
{
  uint16_t swrst : 1;
  uint16_t enable : 1;
  uint16_t mode : 2;
  uint16_t  : 1;
  uint16_t wavegen : 2;
  uint16_t  : 1;
  uint16_t prescaler : 3;
  uint16_t runstdby : 1;
  uint16_t prescsync : 2;
  uint16_t  : 2;
};

#define TC7_16_READREQ	MMIO_REG(0x42003c02, uint16_t)
#define TC7_16_READREQ_ADDR(x)	((x) << 0)
#define TC7_16_READREQ_ADDR_MSK	0x0000001f
#define TC7_16_READREQ_ADDR_VAL(x)	(((x) >> 0) & 0x1f)
#define TC7_16_READREQ_RCONT	(1 << 14)
#define TC7_16_READREQ_RREQ	(1 << 15)

#define TC7_16_READREQ_s    MMIO_REG(0x42003c02, struct __struct_TC7_16_READREQ)
struct __struct_TC7_16_READREQ
{
  uint16_t addr : 5;
  uint16_t  : 9;
  uint16_t rcont : 1;
  uint16_t rreq : 1;
};

#define TC7_16_CTRLBCLR	MMIO_REG(0x42003c04, uint8_t)
#define TC7_16_CTRLBCLR_DIR	(1 << 0)
#define TC7_16_CTRLBCLR_ONESHOT	(1 << 2)
#define TC7_16_CTRLBCLR_CMD(x)	((x) << 6)
#define TC7_16_CTRLBCLR_CMD_MSK	0x000000c0
#define TC7_16_CTRLBCLR_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC7_16_CTRLBCLR_s    MMIO_REG(0x42003c04, struct __struct_TC7_16_CTRLBCLR)
struct __struct_TC7_16_CTRLBCLR
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC7_16_CTRLBSET	MMIO_REG(0x42003c05, uint8_t)
#define TC7_16_CTRLBSET_DIR	(1 << 0)
#define TC7_16_CTRLBSET_ONESHOT	(1 << 2)
#define TC7_16_CTRLBSET_CMD(x)	((x) << 6)
#define TC7_16_CTRLBSET_CMD_MSK	0x000000c0
#define TC7_16_CTRLBSET_CMD_VAL(x)	(((x) >> 6) & 0x3)

#define TC7_16_CTRLBSET_s    MMIO_REG(0x42003c05, struct __struct_TC7_16_CTRLBSET)
struct __struct_TC7_16_CTRLBSET
{
  uint8_t dir : 1;
  uint8_t  : 1;
  uint8_t oneshot : 1;
  uint8_t  : 3;
  uint8_t cmd : 2;
};

#define TC7_16_CTRLC	MMIO_REG(0x42003c06, uint8_t)
#define TC7_16_CTRLC_INVEN0	(1 << 0)
#define TC7_16_CTRLC_INVEN1	(1 << 1)
#define TC7_16_CTRLC_CPTEN0	(1 << 4)
#define TC7_16_CTRLC_CPTEN1	(1 << 5)

#define TC7_16_CTRLC_s    MMIO_REG(0x42003c06, struct __struct_TC7_16_CTRLC)
struct __struct_TC7_16_CTRLC
{
  uint8_t inven0 : 1;
  uint8_t inven1 : 1;
  uint8_t  : 2;
  uint8_t cpten0 : 1;
  uint8_t cpten1 : 1;
  uint8_t  : 2;
};

#define TC7_16_DBGCTRL	MMIO_REG(0x42003c08, uint8_t)
#define TC7_16_DBGCTRL_DBGRUN	(1 << 0)

#define TC7_16_DBGCTRL_s    MMIO_REG(0x42003c08, struct __struct_TC7_16_DBGCTRL)
struct __struct_TC7_16_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

#define TC7_16_EVCTRL	MMIO_REG(0x42003c0a, uint16_t)
#define TC7_16_EVCTRL_EVACT(x)	((x) << 0)
#define TC7_16_EVCTRL_EVACT_MSK	0x00000007
#define TC7_16_EVCTRL_EVACT_VAL(x)	(((x) >> 0) & 0x7)
#define TC7_16_EVCTRL_TCINV	(1 << 4)
#define TC7_16_EVCTRL_TCEI	(1 << 5)
#define TC7_16_EVCTRL_OVFEO	(1 << 8)
#define TC7_16_EVCTRL_MCEO0	(1 << 12)
#define TC7_16_EVCTRL_MCEO1	(1 << 13)

#define TC7_16_EVCTRL_s    MMIO_REG(0x42003c0a, struct __struct_TC7_16_EVCTRL)
struct __struct_TC7_16_EVCTRL
{
  uint16_t evact : 3;
  uint16_t  : 1;
  uint16_t tcinv : 1;
  uint16_t tcei : 1;
  uint16_t  : 2;
  uint16_t ovfeo : 1;
  uint16_t  : 3;
  uint16_t mceo0 : 1;
  uint16_t mceo1 : 1;
  uint16_t  : 2;
};

#define TC7_16_INTENCLR	MMIO_REG(0x42003c0c, uint8_t)
#define TC7_16_INTENCLR_OVF	(1 << 0)
#define TC7_16_INTENCLR_ERR	(1 << 1)
#define TC7_16_INTENCLR_SYNCRDY	(1 << 3)
#define TC7_16_INTENCLR_MC0	(1 << 4)
#define TC7_16_INTENCLR_MC1	(1 << 5)

#define TC7_16_INTENCLR_s    MMIO_REG(0x42003c0c, struct __struct_TC7_16_INTENCLR)
struct __struct_TC7_16_INTENCLR
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC7_16_INTENSET	MMIO_REG(0x42003c0d, uint8_t)
#define TC7_16_INTENSET_OVF	(1 << 0)
#define TC7_16_INTENSET_ERR	(1 << 1)
#define TC7_16_INTENSET_SYNCRDY	(1 << 3)
#define TC7_16_INTENSET_MC0	(1 << 4)
#define TC7_16_INTENSET_MC1	(1 << 5)

