1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define ADC_INTENSET_s    MMIO_REG(0x42004017, struct __struct_ADC_INTENSET)
struct __struct_ADC_INTENSET
{
  uint8_t resrdy : 1;
  uint8_t overrun : 1;
  uint8_t winmon : 1;
  uint8_t syncrdy : 1;
  uint8_t  : 4;
};

#define ADC_INTFLAG	MMIO_REG(0x42004018, uint8_t)
#define ADC_INTFLAG_RESRDY	(1 << 0)
#define ADC_INTFLAG_OVERRUN	(1 << 1)
#define ADC_INTFLAG_WINMON	(1 << 2)
#define ADC_INTFLAG_SYNCRDY	(1 << 3)

#define ADC_INTFLAG_s    MMIO_REG(0x42004018, struct __struct_ADC_INTFLAG)
struct __struct_ADC_INTFLAG
{
  uint8_t resrdy : 1;
  uint8_t overrun : 1;
  uint8_t winmon : 1;
  uint8_t syncrdy : 1;
  uint8_t  : 4;
};

#define ADC_STATUS	MMIO_REG(0x42004019, uint8_t)
#define ADC_STATUS_SYNCBUSY	(1 << 7)

#define ADC_STATUS_s    MMIO_REG(0x42004019, struct __struct_ADC_STATUS)
struct __struct_ADC_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define ADC_RESULT	MMIO_REG(0x4200401a, uint16_t)
#define ADC_RESULT_RESULT(x)	((x) << 0)
#define ADC_RESULT_RESULT_MSK	0x0000ffff
#define ADC_RESULT_RESULT_VAL(x)	(((x) >> 0) & 0xffff)

#define ADC_RESULT_s    MMIO_REG(0x4200401a, struct __struct_ADC_RESULT)
struct __struct_ADC_RESULT
{
  uint16_t result : 16;
};

#define ADC_WINLT	MMIO_REG(0x4200401c, uint16_t)
#define ADC_WINLT_WINLT(x)	((x) << 0)
#define ADC_WINLT_WINLT_MSK	0x0000ffff
#define ADC_WINLT_WINLT_VAL(x)	(((x) >> 0) & 0xffff)

#define ADC_WINLT_s    MMIO_REG(0x4200401c, struct __struct_ADC_WINLT)
struct __struct_ADC_WINLT
{
  uint16_t winlt : 16;
};

#define ADC_WINUT	MMIO_REG(0x42004020, uint16_t)
#define ADC_WINUT_WINUT(x)	((x) << 0)
#define ADC_WINUT_WINUT_MSK	0x0000ffff
#define ADC_WINUT_WINUT_VAL(x)	(((x) >> 0) & 0xffff)

#define ADC_WINUT_s    MMIO_REG(0x42004020, struct __struct_ADC_WINUT)
struct __struct_ADC_WINUT
{
  uint16_t winut : 16;
};

#define ADC_GAINCORR	MMIO_REG(0x42004024, uint16_t)
#define ADC_GAINCORR_GAINCORR(x)	((x) << 0)
#define ADC_GAINCORR_GAINCORR_MSK	0x00000fff
#define ADC_GAINCORR_GAINCORR_VAL(x)	(((x) >> 0) & 0xfff)

#define ADC_GAINCORR_s    MMIO_REG(0x42004024, struct __struct_ADC_GAINCORR)
struct __struct_ADC_GAINCORR
{
  uint16_t gaincorr : 12;
  uint16_t  : 4;
};

#define ADC_OFFSETCORR	MMIO_REG(0x42004026, uint16_t)
#define ADC_OFFSETCORR_OFFSETCORR(x)	((x) << 0)
#define ADC_OFFSETCORR_OFFSETCORR_MSK	0x00000fff
#define ADC_OFFSETCORR_OFFSETCORR_VAL(x)	(((x) >> 0) & 0xfff)

#define ADC_OFFSETCORR_s    MMIO_REG(0x42004026, struct __struct_ADC_OFFSETCORR)
struct __struct_ADC_OFFSETCORR
{
  uint16_t offsetcorr : 12;
  uint16_t  : 4;
};

#define ADC_CALIB	MMIO_REG(0x42004028, uint16_t)
#define ADC_CALIB_LINEARITY_CAL(x)	((x) << 0)
#define ADC_CALIB_LINEARITY_CAL_MSK	0x000000ff
#define ADC_CALIB_LINEARITY_CAL_VAL(x)	(((x) >> 0) & 0xff)
#define ADC_CALIB_BIAS_CAL(x)	((x) << 8)
#define ADC_CALIB_BIAS_CAL_MSK	0x00000700
#define ADC_CALIB_BIAS_CAL_VAL(x)	(((x) >> 8) & 0x7)

#define ADC_CALIB_s    MMIO_REG(0x42004028, struct __struct_ADC_CALIB)
struct __struct_ADC_CALIB
{
  uint16_t linearity_cal : 8;
  uint16_t bias_cal : 3;
  uint16_t  : 5;
};

#define ADC_DBGCTRL	MMIO_REG(0x4200402a, uint8_t)
#define ADC_DBGCTRL_DBGRUN	(1 << 0)

#define ADC_DBGCTRL_s    MMIO_REG(0x4200402a, struct __struct_ADC_DBGCTRL)
struct __struct_ADC_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

// 0x42004400 AC

#define AC_CTRLA	MMIO_REG(0x42004400, uint8_t)
#define AC_CTRLA_SWRST	(1 << 0)
#define AC_CTRLA_ENABLE	(1 << 1)
#define AC_CTRLA_RUNSTDBY	(1 << 2)

#define AC_CTRLA_s    MMIO_REG(0x42004400, struct __struct_AC_CTRLA)
struct __struct_AC_CTRLA
{
  uint8_t swrst : 1;
  uint8_t enable : 1;
  uint8_t runstdby : 1;
  uint8_t  : 5;
};

#define AC_CTRLB	MMIO_REG(0x42004401, uint8_t)
#define AC_CTRLB_START0	(1 << 0)
#define AC_CTRLB_START1	(1 << 1)

#define AC_CTRLB_s    MMIO_REG(0x42004401, struct __struct_AC_CTRLB)
struct __struct_AC_CTRLB
{
  uint8_t start0 : 1;
  uint8_t start1 : 1;
  uint8_t  : 6;
};

#define AC_EVCTRL	MMIO_REG(0x42004402, uint16_t)
#define AC_EVCTRL_COMPEO0	(1 << 0)
#define AC_EVCTRL_COMPEO1	(1 << 1)
#define AC_EVCTRL_WINEO0	(1 << 4)
#define AC_EVCTRL_COMPEI0	(1 << 8)
#define AC_EVCTRL_COMPEI1	(1 << 9)

#define AC_EVCTRL_s    MMIO_REG(0x42004402, struct __struct_AC_EVCTRL)
struct __struct_AC_EVCTRL
{
  uint16_t compeo0 : 1;
  uint16_t compeo1 : 1;
  uint16_t  : 2;
  uint16_t wineo0 : 1;
  uint16_t  : 3;
  uint16_t compei0 : 1;
  uint16_t compei1 : 1;
  uint16_t  : 6;
};

#define AC_INTENCLR	MMIO_REG(0x42004404, uint8_t)
#define AC_INTENCLR_COMP0	(1 << 0)
#define AC_INTENCLR_COMP1	(1 << 1)
#define AC_INTENCLR_WIN	(1 << 4)

#define AC_INTENCLR_s    MMIO_REG(0x42004404, struct __struct_AC_INTENCLR)
struct __struct_AC_INTENCLR
{
  uint8_t comp0 : 1;
  uint8_t comp1 : 1;
  uint8_t  : 2;
  uint8_t win : 1;
  uint8_t  : 3;
};

#define AC_INTENSET	MMIO_REG(0x42004405, uint8_t)
#define AC_INTENSET_COMP0	(1 << 0)
#define AC_INTENSET_COMP1	(1 << 1)
#define AC_INTENSET_WIN	(1 << 4)

#define AC_INTENSET_s    MMIO_REG(0x42004405, struct __struct_AC_INTENSET)
struct __struct_AC_INTENSET
{
  uint8_t comp0 : 1;
  uint8_t comp1 : 1;
  uint8_t  : 2;
  uint8_t win : 1;
  uint8_t  : 3;
};

#define AC_INTFLAG	MMIO_REG(0x42004406, uint8_t)
#define AC_INTFLAG_COMP0	(1 << 0)
#define AC_INTFLAG_COMP1	(1 << 1)
#define AC_INTFLAG_WIN	(1 << 4)

#define AC_INTFLAG_s    MMIO_REG(0x42004406, struct __struct_AC_INTFLAG)
struct __struct_AC_INTFLAG
{
  uint8_t comp0 : 1;
  uint8_t comp1 : 1;
  uint8_t  : 2;
  uint8_t win : 1;
  uint8_t  : 3;
};

#define AC_STATUSA	MMIO_REG(0x42004408, uint8_t)
#define AC_STATUSA_STATE0	(1 << 0)
#define AC_STATUSA_STATE1	(1 << 1)
#define AC_STATUSA_WSTATE0(x)	((x) << 4)
#define AC_STATUSA_WSTATE0_MSK	0x00000030
#define AC_STATUSA_WSTATE0_VAL(x)	(((x) >> 4) & 0x3)

#define AC_STATUSA_s    MMIO_REG(0x42004408, struct __struct_AC_STATUSA)
struct __struct_AC_STATUSA
{
  uint8_t state0 : 1;
  uint8_t state1 : 1;
  uint8_t  : 2;
  uint8_t wstate0 : 2;
  uint8_t  : 2;
};

#define AC_STATUSB	MMIO_REG(0x42004409, uint8_t)
#define AC_STATUSB_READY0	(1 << 0)
#define AC_STATUSB_READY1	(1 << 1)
#define AC_STATUSB_SYNCBUSY	(1 << 7)

