1847123212/avr_light_wight_mesh_network/hal/atsamd20/inc/atsamd20.h
#define SCB_ICSR_s    MMIO_REG(0xe000ed04, struct __struct_SCB_ICSR)
struct __struct_SCB_ICSR
{
  uint32_t vectactive : 9;
  uint32_t  : 3;
  uint32_t vectpending : 9;
  uint32_t  : 1;
  uint32_t isrpending : 1;
  uint32_t isrpreempt : 1;
  uint32_t  : 1;
  uint32_t pendstclr : 1;
  uint32_t pendstset : 1;
  uint32_t pendsvclr : 1;
  uint32_t pendsvset : 1;
  uint32_t  : 2;
  uint32_t nmipendset : 1;
};

#define SCB_VTOR	MMIO_REG(0xe000ed08, uint32_t)
#define SCB_VTOR_TBLOFF(x)	((x) << 7)
#define SCB_VTOR_TBLOFF_MSK	0xffffff80
#define SCB_VTOR_TBLOFF_VAL(x)	(((x) >> 7) & 0x1ffffff)

#define SCB_VTOR_s    MMIO_REG(0xe000ed08, struct __struct_SCB_VTOR)
struct __struct_SCB_VTOR
{
  uint32_t  : 7;
  uint32_t tbloff : 25;
};

#define SCB_AIRCR	MMIO_REG(0xe000ed0c, uint32_t)
#define SCB_AIRCR_VECTCLRACTIVE	(1 << 1)
#define SCB_AIRCR_SYSRESETREQ	(1 << 2)
#define SCB_AIRCR_ENDIANESS	(1 << 15)
#define SCB_AIRCR_VECTKEY(x)	((x) << 16)
#define SCB_AIRCR_VECTKEY_MSK	0xffff0000
#define SCB_AIRCR_VECTKEY_VAL(x)	(((x) >> 16) & 0xffff)

#define SCB_AIRCR_s    MMIO_REG(0xe000ed0c, struct __struct_SCB_AIRCR)
struct __struct_SCB_AIRCR
{
  uint32_t  : 1;
  uint32_t vectclractive : 1;
  uint32_t sysresetreq : 1;
  uint32_t  : 12;
  uint32_t endianess : 1;
  uint32_t vectkey : 16;
};

#define SCB_SCR	MMIO_REG(0xe000ed10, uint32_t)
#define SCB_SCR_SLEEPONEXIT	(1 << 1)
#define SCB_SCR_SLEEPDEEP	(1 << 2)
#define SCB_SCR_SEVONPEND	(1 << 4)

#define SCB_SCR_s    MMIO_REG(0xe000ed10, struct __struct_SCB_SCR)
struct __struct_SCB_SCR
{
  uint32_t  : 1;
  uint32_t sleeponexit : 1;
  uint32_t sleepdeep : 1;
  uint32_t  : 1;
  uint32_t sevonpend : 1;
  uint32_t  : 27;
};

#define SCB_CCR	MMIO_REG(0xe000ed14, uint32_t)
#define SCB_CCR_UNALIGN_TRP	(1 << 3)
#define SCB_CCR_STKALIGN	(1 << 9)

#define SCB_CCR_s    MMIO_REG(0xe000ed14, struct __struct_SCB_CCR)
struct __struct_SCB_CCR
{
  uint32_t  : 3;
  uint32_t unalign_trp : 1;
  uint32_t  : 5;
  uint32_t stkalign : 1;
  uint32_t  : 22;
};

#define SCB_SHPR2	MMIO_REG(0xe000ed1c, uint32_t)
#define SCB_SHPR2_PRI_11(x)	((x) << 30)
#define SCB_SHPR2_PRI_11_MSK	0xc0000000
#define SCB_SHPR2_PRI_11_VAL(x)	(((x) >> 30) & 0x3)

#define SCB_SHPR2_s    MMIO_REG(0xe000ed1c, struct __struct_SCB_SHPR2)
struct __struct_SCB_SHPR2
{
  uint32_t  : 30;
  uint32_t pri_11 : 2;
};

#define SCB_SHPR3	MMIO_REG(0xe000ed20, uint32_t)
#define SCB_SHPR3_PRI_14(x)	((x) << 22)
#define SCB_SHPR3_PRI_14_MSK	0x00c00000
#define SCB_SHPR3_PRI_14_VAL(x)	(((x) >> 22) & 0x3)
#define SCB_SHPR3_PRI_15(x)	((x) << 30)
#define SCB_SHPR3_PRI_15_MSK	0xc0000000
#define SCB_SHPR3_PRI_15_VAL(x)	(((x) >> 30) & 0x3)

#define SCB_SHPR3_s    MMIO_REG(0xe000ed20, struct __struct_SCB_SHPR3)
struct __struct_SCB_SHPR3
{
  uint32_t  : 22;
  uint32_t pri_14 : 2;
  uint32_t  : 6;
  uint32_t pri_15 : 2;
};

#define SCB_SHCSR	MMIO_REG(0xe000ed24, uint32_t)
#define SCB_SHCSR_SVCALLPENDED	(1 << 15)

#define SCB_SHCSR_s    MMIO_REG(0xe000ed24, struct __struct_SCB_SHCSR)
struct __struct_SCB_SHCSR
{
  uint32_t  : 15;
  uint32_t svcallpended : 1;
  uint32_t  : 16;
};

#define SCB_DFSR	MMIO_REG(0xe000ed30, uint32_t)
#define SCB_DFSR_HALTED	(1 << 0)
#define SCB_DFSR_BKPT	(1 << 1)
#define SCB_DFSR_DWTTRAP	(1 << 2)
#define SCB_DFSR_VCATCH	(1 << 3)
#define SCB_DFSR_EXTERNAL	(1 << 4)

#define SCB_DFSR_s    MMIO_REG(0xe000ed30, struct __struct_SCB_DFSR)
struct __struct_SCB_DFSR
{
  uint32_t halted : 1;
  uint32_t bkpt : 1;
  uint32_t dwttrap : 1;
  uint32_t vcatch : 1;
  uint32_t external : 1;
  uint32_t  : 27;
};

#endif // _ATSAMD20_H_
